Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/service.osmc.settings/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, nb_no, nl_nl, pt_br, uk_ua

# #32055
source: The Raspberry Pi doesn't have a conventional BIOS. System configuration parameters are stored in a "config.txt" file. For more detail, visit http://elinux.org/RPiconfig[CR]This settings module allows you to edit your config.txt from within OSMC using a graphical interface.[CR][CR]The module includes:[CR]- display rotation[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- function to save edid to file[CR]- sdtv_mode & sdtv_aspect[CR]- GPU memory split[CR]- MPG2 & WVC1 licences (including status)[CR]- your Pi's serial number[CR][CR]Finally, there is a Config Editor that will allow you to quickly add, edit, or delete lines in your config.txt.[CR][CR]Overclock settings are set using the Pi Overclock module.
de_de: Der Raspberry Pi besitzt kein konventionelles BIOS. Systemkonfigurationsparameter sind in einer "config.txt"-Datei hinterlegt. Für weitere Details, besuchen Sie http://elinux.org/RPiconfig[CR]Dieses Einstellundsmodul ermöglicht es, config.txt aus OSMC heraus über eine graphische Oberfläche zu bearbeiten.[CR][CR]Das Modul enthält:[CR]- Displaydrehung[CR]]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- eine Funktion zum Speichern der EDID in eine Datei[CR]- sdtv_mode & sdtv_aspect[CR]- GPU-Arbeitsspeicheraufteilung[CR]- MPG2- & WVC1-Lizenzen (inklusive des Status)[CR]- Ihre Pi-Seriennnummer[CR][CR]Außerdem gibt es einen Konfigurationseditor, der Ihnen das schnelle Hinzufügen, Anpassen oder Löschen in Ihrer config.txt erlaubt.[CR][CR]Übertaktungseinstellungen werden im Pi-Übertaktungsmodul eingestellt.
hu_hu: A Raspberry Pi nem rendelkezik hagyományos BIOS-szal. A rendszer konfigurációs paramétereit egy "config.txt" fájlban tárolja. További részletekért látogasson el a http://elinux.org/RPiconfig[CR]Ez a beállítási modul lehetővé teszi a config.txt szerkesztését az OSMC-ből egy grafikus felület segítségével.[CR][CR]A modul a következőket tartalmazza: [CR]- a kijelző forgatása[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- az edid fájlba mentésének funkciója[CR]- sdtv_mode & sdtv_aspect[CR]- GPU memória megosztás[CR]- MPG2 & WVC1 licencek (beleértve az állapotot)[CR]- a Pi sorozatszáma[CR][CR]- végül, van egy Config Editor, amely lehetővé teszi, hogy gyorsan hozzáadjon, szerkesszen vagy töröljön sorokat a config.txt fájlban.[CR][CR]A túlhajtási beállításokat a Pi Overclock modul segítségével állíthatja be.
it_it: Il Raspberry Pi non ha un BIOS convenzionale. I parametri di configurazione del sistema sono memorizzati in un file "config.txt". Per maggiori dettagli, visita http://elinux.org/RPiconfig[CR]Questo modulo di impostazioni ti consente di modificare il file config.txt dall'interno di OSMC utilizzando un'interfaccia grafica.[CR][CR]Il modulo include:[CR]- rotazione del display[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- funzione per salvare edid su file[CR]- sdtv_mode & sdtv_aspect[CR]- Divisione memoria GPU[CR]- Licenze MPG2 & WVC1 (incluso lo stato)[CR]- il numero di serie del tuo Pi[CR][CR]Infine, c'è un editor di configurazione che ti permetterà di aggiungere, modificare o eliminare rapidamente linee dal tuo config.txt.[CR][CR]Le impostazioni di overclock vengono impostate utilizzando il modulo Pi Overclock.
nb_no: Raspberry Pi har ikke en vanlig BIOS. Systemkonfigurasjonsparametere lagres i en "config.txt" -fil. Hvis du vil ha mer informasjon, kan du gå til http://elinux.org/RPiconfig[CR]Denne innstillingsmodulen lar deg redigere config.txt fra OSMC ved hjelp av et grafisk grensesnitt.[CR][CR]Modulen inneholder:[CR]- visningsrotasjon[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- funksjon for å lagre edid til fil[CR]- sdtv_mode & sdtv_aspect[CR]- GPU-minnesplitt[CR]- MPG2- og WVC1-lisenser (inkludert status)[CR]- Pi-serienummeret[CR][CR]Endelig er det en konfigurasjonseditor som lar deg raskt legge til, redigere eller slette linjer i config.txt.[CR][CR]Overklokkeinnstillinger er satt ved hjelp av Pi Overclock -modulen.
nl_nl: De Raspberry Pi heeft geen conventioneel BIOS. Systeem configuratie parameters worden opgeslagen in een "config.txt" bestand. Voor meer details, ga naar http://elinux.org/RPiconfig[CR]Met deze instellingenmodule kun je je config.txt bewerken vanuit OSMC met behulp van een grafische interface.[CR][CR]De module bevat:[CR]- beeldschermrotatie[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- functie om edid op te slaan in bestand[CR]- sdtv_mode & sdtv_aspect[CR]- GPU memory split[CR]- MPG2 & WVC1 licenties (inclusief status)[CR]- het serienummer van je Pi[CR][CR]Tot slot is er een configuratie-editor waarmee je snel regels kunt toevoegen, bewerken of verwijderen in je config. txt.[CR][CR]Overklokinstellingen stel je in met de Pi Overklok-module.
pt_br: O Raspberry Pi não possui BIOS convencional. Os parâmetros de configuração do sistema são armazenados em um arquivo "config.txt". Para obter mais detalhes, visite http://elinux.org/RPiconfig[CR]Este módulo de configurações permite que você edite seu config.txt de dentro do OSMC usando uma interface gráfica.[CR][CR]O módulo inclui:[CR]- rotação da tela[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- função para salvar edid em arquivo[CR] - sdtv_mode & sdtv_aspect[CR] - divisão de memória GPU[CR] - licenças MPG2 e WVC1 (incluindo status)[CR] - o número de série do seu Pi[CR][CR]Finalmente, há um Editor de Configuração que permitirá que você adicione, edite ou exclua linhas rapidamente em seu config.txt.[CR][CR]Configurações de overclock são realizadas utilizando o módulo Pi Overclock.
uk_ua: У Raspberry Pi немає звичайного BIOS. Конфігурація системи зберігається у файлі «config.txt». Додаткові відомості дивіться на веб-сторінці http://elinux.org/RPiconfig[CR]Цей модуль налаштувань дозволяє редагувати файл config.txt прямо з графічного інтерфейсу OSMC.[CR][CR]Модуль включає:[CR]- поворот дисплея[CR]- hdmi_safe і hdmi_boost[CR]- hdmi_group і hdmi_mode[CR]- функція збереження edid у файл[CR]- sdtv_mode і sdtv_aspect[CR]- розділення пам'яті GPU[CR]- ліцензії MPG2 і WVClu (включаючи їх стан)[CR]- серійний номер вашого Pi[CR][CR]Також тут є редактор конфігурації, який дозволить швидко додати, змінити або видалити рядки у файлі config.txt.[CR][CR]Параметри розгону налаштовуються за допомогою модуля Розгін Pi.

# #32056
source: Remotes
cs_cz: Ovládání
de_de: Fernbedienungen
hu_hu: Vezérlők
it_it: Telecomandi
nb_no: Fjernkontroller
nl_nl: Afstandsbedieningen
pt_br: Controles Remotos
uk_ua: Пульти

# #32057
source: This module allows the user to select the appropriate lirc.conf file for their remote.
cs_cz: Tento modul umožňuje uživateli vybrat vhodný soubor lirc.conf pro svůj dálkový ovladač.
de_de: Dieses Modul erlaubt das Auswählen der passenden lirc.conf-Datei für die genutzte Fernbedienung.
hu_hu: Ez a modul lehetővé teszi a felhasználó számára, hogy kiválassza a megfelelő lirc.conf fájlt a távoli rendszeréhez.
it_it: Questo modulo consente l'impostazione del corretto file lirc.conf per il tuo telecomando.
nb_no: Denne modulene tillater brukeren å velge riktige lirc.conf fil for sin fjernkontroll.
nl_nl: In deze module kiest de gebruiker het juiste lirc.conf-bestand voor zijn afstandsbediening.
pt_br: Este módulo permite que o usuário selecione o arquivo lirc.conf apropriado para seu controle remoto.
uk_ua: В цьому модулі можна вибрати відповідний файл lirc.conf для свого пульта.

# #32058
source: Services
cs_cz: Služby
de_de: Dienste
hu_hu: Szolgáltatások
it_it: Servizi
nb_no: Tjenester
pt_br: Serviços
uk_ua: Служби

# #32059
source: Control OSMC services
cs_cz: Ovládání OSMC služeb
de_de: OSMC-Dienste steuern
hu_hu: OSMC-szolgáltatások ellenőrzése
it_it: Controlla i servizi di OSMC
nb_no: Kontroll OSMC tjenester
nl_nl: Bedien OSMC services
pt_br: Controlar serviços do OSMC
uk_ua: Керування службами OSMC

# #32060
source: Updates
cs_cz: Aktualizace
de_de: Aktualisierungen
hu_hu: Frissítések
it_it: Aggiornamenti
nb_no: Oppdateringer
pt_br: Atualizações
uk_ua: Оновлення

# #32061
source: Manage updates
cs_cz: Řízení aktualizací
de_de: Aktualisierungen verwalten
hu_hu: Frissítések kezelése
it_it: Gestisci gli aggiornamenti
nb_no: Administrere oppdateringer
nl_nl: Beheer updates
pt_br: Gerenciar atualizações
uk_ua: Керування оновленнями

# #32062
source: Developer
cs_cz: Vývojář
de_de: Entwickler
hu_hu: Fejlesztő
it_it: Sviluppatore
nb_no: Utvikler
nl_nl: Ontwikkelaar
pt_br: Desenvolvedor
uk_ua: Розробник

# #32063
source: Test walk through
cs_cz: Vyzkoušejte procházku
de_de: Test-Durchgang
hu_hu: Tesztelés próba
nb_no: Test gjennomgang
nl_nl: Doorlopen van de test
pt_br: Testar passo a passo
uk_ua: Тестовий прохід

# #32064
source: Look + Feel
de_de: Aussehen + Verhalten
hu_hu: Megjelenés

# #32065
source: Sign-Up
de_de: Registrierung
hu_hu: Regisztráció
it_it: Iscriviti
nl_nl: Aanmelden

# #32066
source: Exit
de_de: Schließen
hu_hu: Kilépés
it_it: Esci
nl_nl: Verlaten

# #32067
source: SSH gives you full control of your device and is accessible via your network. This is very useful for troubleshooting.
de_de: SSH ermöglicht volle Kontrolle über das Gerät und ist über das Netzwerk erreichbar. Dies ist zur Fehlerbehebung nützlich.
hu_hu: Az SSH teljes körű ellenőrzést biztosít az eszköz felett, és a hálózaton keresztül elérhető. Ez nagyon hasznos a hibaelhárításhoz.
it_it: SSH ti da il completo controllo del tuo dispositivo ed è accessibile tramite la tua rete. È molto utile per investigare e correggere problemi.
nl_nl: SSH geeft je volledige controle over je apparaat en is toegankelijk via je netwerk. Dit is erg handig voor het oplossen van problemen.

# #32068
source: Would you like to receive the newsletter?
de_de: Den Newsletter erhalten?
hu_hu: Szeretné megkapni a hírlevelet?
it_it: Vuoi ricevere la newsletter?
nl_nl: Wil je de nieuwsbrief ontvangen?

# #32069
source: Sure, sign me up
de_de: Sicher, registrieren
hu_hu: Persze, írj fel a listára
it_it: Certo, iscrivimi pure
nl_nl: Jazeker, meld me aan

# #32070
source: No thanks
de_de: Nein danke
hu_hu: Nem köszönöm
it_it: No, grazie
nl_nl: Nee bedankt

# #32071
source: Africa
de_de: Afrika
hu_hu: Afrika
nl_nl: Afrika

# #32072
source: America
de_de: Amerika
hu_hu: Amerika
nl_nl: Amerika

# #32073
source: Asia
de_de: Asien
hu_hu: Ázsia
nl_nl: Azië

# #32074
source: Atlantic
de_de: Atlantik
hu_hu: Atlanti-Óceán
it_it: Atlantico
nl_nl: Atlantisch

# #32075
source: Australia
de_de: Australien
hu_hu: Ausztrália
nl_nl: Australië

# #32076
source: Europe
de_de: Europa
hu_hu: Európa
it_it: Europa
nl_nl: Europa

# #32078
source: Pacific
de_de: Pazifik
hu_hu: Csendes-Óceán
it_it: Pacifico

# #32080
source: Accept
de_de: Akzeptieren
hu_hu: Elfogadás
it_it: Accetta
nl_nl: Accepteren

# #32081
source: OSMC Remote Pairing
de_de: OSMC-Fernbedienung verbinden
hu_hu: OSMC távirányító párosítás
it_it: Accoppia telecomando OSMC

# #32082
source: Please press and hold [B]OK[/B] and [B]HOME[/B] to pair your OSMC remote control.
de_de: Bitte [B]OK[/B] und [B]Home[/B] zum Verbinden der OSMC-Fernbedienung drücken und halten.
hu_hu: Nyomja meg és tartsa lenyomva az [B]OK[/B] és a [B]Kezdőképernyő[/B] gombokat az OSMC távirányító párosításához.
it_it: Tieni premuti [B]OK[/B] e [B]HOME[/B] per accoppiare il tuo telecomando OSMC.

# #32077
source: India
de_de: Indien

# #32017
source: That's it! You're now ready to enjoy OSMC.
cs_cz: A je to! Nyní jste připraveni si OSMC užít.
nb_no: Det var alt! Du er nå klar til å nyte OSMC.

# #32018
source: If you need any help we have a wealth of resources
cs_cz: Pokud potřebujete pomoc, máme spoustu zdrojů
nb_no: Om du trenger hjelp, så har vi mange som kan bidra

# #32019
source: to help you get the best of OSMC.
cs_cz: abychom vám pomohli získat to nejlepší z OSMC.
nb_no: med å hjelpe deg til å få mest mulig ut av OSMC.

# #32020
source: We hope you enjoy using OSMC
cs_cz: Doufáme, že vás používání OSMC baví
nb_no: Vi håper du nyter bruken av OSMC

# #32021
source: ~ Team OSMC ~
cs_cz: ~ Vývojáři OSMC ~

# #32034
source: just as much as we enjoy developing it!
cs_cz: stejně jako nás baví jeho vývoj!
nb_no: like mye som vi har kost oss med å utvikle det!

# #32055
source: The Raspberry Pi doesn't have a conventional BIOS. System configuration parameters are stored in a "config.txt" file. For more detail, visit http://elinux.org/RPiconfig[CR]This settings module allows you to edit your config.txt from within OSMC using a graphical interface.[CR][CR]The module includes:[CR]- display rotation[CR]- hdmi_safe & hdmi_boost[CR]- hdmi_group & hdmi_mode[CR]- function to save edid to file[CR]- sdtv_mode & sdtv_aspect[CR]- GPU memory split[CR]- MPG2 & WVC1 licences (including status)[CR]- your Pi's serial number[CR][CR]Finally, there is a Config Editor that will allow you to quickly add, edit, or delete lines in your config.txt.[CR][CR]Overclock settings are set using the Pi Overclock module.
cs_cz: Raspberry Pi nemá standardní BIOS. Konfigurační parametry systému jsou uloženy v souboru „config.txt“. Více podrobností naleznete na stránce http://elinux.org/RPiconfig[CR]Tento modul nastavení umožňuje upravit soubor config.txt v rámci OSMC pomocí grafického rozhraní. [CR] [CR] Modul obsahuje: [CR] - rotace displeje [CR] - nastavení hdmi_safe & hdmi_boost [CR] - nastavení hdmi_group & hdmi_mode [CR] - funkce pro uložení edid nastavení do souboru [CR] - nastavení sdtv_mode & sdtv_aspect [CR] - rozdělení paměti GPU [CR] - licence MPG2 a WVC1 (včetně stavu) [CR] - sériové číslo vašeho Pi [CR] [CR] Nakonec je zde Editor Konfigurace, který vám umožní rychle přidávat, upravovat nebo mazat řádky v souboru config.txt. [CR] [CR] Nastavení přetaktování se nastavují pomocí modulu Pi Přetaktování.
