Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/service.osmc.settings/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, nb_no, nl_nl, pt_br, uk_ua

# #32001
source: OSMC Settings
cs_cz: Nastavení OSMC
de_de: OSMC-Einstellungen
hu_hu: OSMC beállítások
it_it: Impostazioni OSMC
nb_no: OSMC innstillinger
nl_nl: OSMC instellingen
pt_br: Configurações do OSMC
uk_ua: Налаштування OSMC

# #32003
source: Hostname
hu_hu: Hosztnév
it_it: Nome host
nl_nl: Hostnaam

# #32005
source: Please wait a few seconds and try again.
cs_cz: Prosím počkejte několik sekund a zkuste to znovu.
de_de: Bitte einige Sekunden warten und erneut versuchen.
hu_hu: Kérjük, várjon néhány másodpercet, és próbálja meg újra.
it_it: Aspetta qualche secondo e riprova.
nb_no: Vennligst vent i noen sekunder og prøv igjen.
nl_nl: Wacht enkele seconden en probeer opnieuw.
pt_br: Aguarde alguns segundos e tente novamente.
uk_ua: Зачекайте кілька секунд і повторіть спробу.

# #32006
source: If this error persists, try disabling then re-enabling the OSMC Settings Service.
cs_cz: Pokud tato chyba přetrvává, zkuste v nastavení OSMC službu vypnout a znovu zapnout.
de_de: Falls dieser Fehler bestehen bleibt, das Deaktivieren und erneute Aktivieren des OSMC-Einstellungsdienstes versuchen.
hu_hu: Ha a hiba továbbra is fennáll, próbálja meg letiltani, majd újra engedélyezni az OSMC Beállítások Szolgáltatás szolgáltatást.
it_it: Se questo errore persiste, prova a disabilitare e riattivare il servizio Impostazioni OSMC.
nb_no: Om feilen fortsetter, prøv å deaktiver for så å reaktiver OSMC innstillingstjeneste.
nl_nl: Als deze fout zich blijft voordoen, probeer dan de OSMC Instellingen Service uit- en weer in te schakelen.
pt_br: Se o erro persistir, tente desativar e reativar o Serviço de Configurações do OSMC.
uk_ua: Якщо ця помилка не зникає, спробуйте вимкнути, а потім знову ввімкнути службу налаштувань OSMC.

# #32007
source: My OSMC service is unavailable
cs_cz: Služba My OSMC je nedostupná
de_de: My OSMC-Dienst ist nicht verfügbar
hu_hu: Az OSMC szolgáltatás nem elérhető
it_it: Il servizio My OSMC non è disponibile
nb_no: Min OSMC tjeneste er ikke tilgjengelig
nl_nl: My OSMC service is niet beschikbaar
pt_br: O serviço My OSMC não está disponível
uk_ua: Служба My OSMC недоступна

# #32008
source: Welcome
cs_cz: Vítejte
de_de: Willkommen
hu_hu: Üdvözöljük
it_it: Benvenuto
nb_no: Velkommen
nl_nl: Welkom
pt_br: Bem vindo
uk_ua: Вітаємо

# #32009
source: Timezone
cs_cz: Časové pásmo
de_de: Zeitzone
hu_hu: Időzóna
it_it: Fuso orario
nb_no: Tidssone
nl_nl: Tijdzone
pt_br: Fuso horário
uk_ua: Часовий пояс

# #32010
source: License
cs_cz: Licence
de_de: Lizenz
hu_hu: Licenc
it_it: Licenza
nb_no: Lisens
nl_nl: Licentie
pt_br: Licença
uk_ua: Ліцензія

# #32011
source: Networking
cs_cz: Síť
de_de: Netzwerk
hu_hu: Hálózat
it_it: Rete
nb_no: Nettverk
nl_nl: Netwerken
pt_br: Rede
uk_ua: Мережа

# #32012
source: Finish
cs_cz: Konec
de_de: Schluss
hu_hu: Befejezés
it_it: Finisci
nb_no: Ferdig
nl_nl: Voltooien
pt_br: Concluir
uk_ua: Готово

# #32013
source: Continue
cs_cz: Pokračovat
de_de: Weiter
hu_hu: Folytatás
it_it: Continua
nb_no: Fortsett
nl_nl: Doorgaan
pt_br: Continuar
uk_ua: Продовжити

# #32014
source: OSMC could not automatically connect to the Internet.
cs_cz: OSMC se nemohlo automaticky připojit k internetu.
de_de: OSMC konnte nicht automatisch zum Internet verbinden.
hu_hu: Az OSMC nem tudott automatikusan csatlakozni az internethez.
it_it: OSMC non si è potuto connettere automaticamente ad Internet.
nb_no: OSMC kunne ikke automatisk koble til Internett.
nl_nl: OSMC kon niet automatisch verbinden met internet.
pt_br: O OSMC não conseguiu se conectar automaticamente à Internet.
uk_ua: OSMC не вдалося автоматично підключитися до Інтернету.

# #32015
source: I'd like to set up networking manually
cs_cz: Chtěl bych nastavit síť ručně
de_de: Netzwerk manuell einrichten
hu_hu: Szeretném manuálisan beállítani a hálózatot
it_it: Voglio impostare la rete manualmente
nb_no: Jeg ønsker å sette opp nettverket manuelt
nl_nl: Ik wil mijn netwerk handmatig instellen
pt_br: Eu gostaria de configurar a rede manualmente
uk_ua: Я налаштую мережу вручну

# #32016
source: I'll set up networking later
cs_cz: Chtěl bych nastavit síť později
de_de: Netzwerk später einrichten
hu_hu: Később beállítom a hálózatot
it_it: Imposterò la rete successivamente
nb_no: Jeg vil sette opp nettverket seinere
nl_nl: Ik stel mijn netwerk later in
pt_br: Vou configurar a rede mais tarde
uk_ua: Я налаштую мережу пізніше

# #32017
source: That's it! You're now ready to enjoy OSMC.[CR][CR]If you need any help we have a wealth of resources to help you get the best of OSMC.[CR]We hope you enjoy using OSMC just as much as we enjoy developing it![CR][CR]~ Team OSMC ~
de_de: Fertig! Alles ist zum Genießen von OSMC bereit.[CR][CR]Falls Hilfe benötigt wird, stehen viele Hilfsressourcen zur Verfügung, um das bestmögliche OSMC-Erlebnis zu ermöglichen.[CR]Wir hoffen, dass Sie OSMC ebenso genießen werden, wie wir die Entwicklung![CR][CR]~ Team OSMC ~
hu_hu: Ennyi! Most már készen áll, hogy élvezze az OSMC-t.[CR][CR]Ha segítségre lenne szüksége, akkor rengeteg erőforrás áll rendelkezésére, amelyek segítségével a legtöbbet hozhatja ki az OSMC-ből.[CR]Reméljük, hogy az OSMC használatát ugyanúgy élvezni fogja, mint mi a fejlesztését![CR][CR]~ Az OSMC csapata ~
it_it: Ecco fatto! Ora sei pronto a divertirti usando OSMC.[CR][CR]Se ti serve aiuto abbiamo un sacco di modi per aiutarti a sfruttare al meglio OSMC.[CR]Ti auguriamo di divertirti ad usare OSMC tanto quanto a noi piace svilupparlo![CR][CR]~ Team OSMC ~
nl_nl: Dat was het! Je bent nu klaar om van OSMC te genieten.[CR][CR]Als je hulp nodig hebt, hebben we een schat aan middelen om je te helpen het beste uit OSMC te halen.[CR]We hopen dat je net zoveel plezier beleeft aan het gebruik van OSMC als wij aan de ontwikkeling ervan![CR][CR]~ Team OSMC ~

# #32018
source: The OSMC Skin
de_de: Der OSMC Skin
hu_hu: Az OSMC megjelenés
it_it: La skin OSMC
nl_nl: De OSMC Skin

# #32020
source: Give your device a name
de_de: Dem Gerät einen Namen geben
hu_hu: Adjon meg egy nevet a készüléknek
it_it: Dai un nome al tuo dispositivo
nl_nl: Geef je apparaat een naam

# #32021
source: Current name: osmc
de_de: Aktueller Name: osmc
hu_hu: Jelenlegi név: osmc
it_it: Nome corrente: osmc
nl_nl: Huidige naam: osmc

# #32022
source: I'd like to stay updated with OSMC news by email
cs_cz: Chtěl bych zůstat informován o novinkách OSMC e-mailem
de_de: Per E-Mail mit OSMC-Neuigkeiten auf dem Laufenden bleiben
hu_hu: Szeretnék e-mailben értesülni az OSMC híreiről
it_it: Vorrei rimanere informato tramite email sulle ultime novità di OSMC
nb_no: Jeg ønsker å holde meg oppdatert med nyheter fra OSMC via e-post
nl_nl: Ik blijf graag op de hoogte van OSMC-nieuws per e-mail
pt_br: Eu gostaria de me manter atualizado com as novidades do OSMC por e-mail
uk_ua: Я хочу отримувати новини про OSMC на електронну пошту

# #32023
source: Warranty
cs_cz: Záruka
de_de: Garantie
hu_hu: Garancia
it_it: Garanzia
nb_no: Garanti
nl_nl: Garantie
pt_br: Garatia
uk_ua: Гарантія

# #32024
source: Please Wait...
cs_cz: Prosím čekejte...
de_de: Bitte warten...
hu_hu: Kérjük várjon...
it_it: Prego Attendere...
nb_no: Vennligst vent...
nl_nl: Even wachten...
pt_br: Aguarde...
uk_ua: Зачекайте, будь ласка...

# #32025
source: Configuring Network Connection
cs_cz: Nastavení připojení sítě
de_de: Netzwerkverbindung einrichten
hu_hu: Hálózati kapcsolat beállítása
it_it: Configurazione della connessione di rete
nb_no: Konfigurerer nettverket
nl_nl: Instellen netwerkverbinding
pt_br: Configurando Conexão de Rede
uk_ua: Налаштування підключення до мережі

# #32026
source: Check for Updates?
cs_cz: Zkontrolovat aktualizace?
de_de: Auf Aktualisierungen prüfen?
hu_hu: Ellenőrizzük a frissítéseket?
it_it: Cerca Aggiornamenti?
nb_no: Sjekk for oppdateringer?
nl_nl: Controleren op updates?
pt_br: Verificar Atualizações?
uk_ua: Перевірити наявність оновлень?

# #32027
source: As you've installed OSMC via NOOBS,
cs_cz: Protože jste nainstalovali OSMC přes NOOBS,
de_de: Da OSMC via NOOBS installiert worden ist,
hu_hu: Mivel az OSMC-t a NOOBS-on keresztül telepítette,
it_it: Avendo installato OSMC tramite NOOBS,
nb_no: Siden du har installert OSMC via NOOBS,
nl_nl: Omdat je OSMC hebt geïnstalleerd via NOOBS,
pt_br: Como você instalou o OSMC via NOOBS,
uk_ua: Оскільки ви встановили OSMC через NOOBS,

# #32028
source: we recommend you ensure you're on the latest version.
cs_cz: doporučujeme vám ověřit, zda používáte nejnovější verzi.
de_de: empfehlen wir, sicherzustellen, dass die neuste Version verwendet wurd.
hu_hu: javasoljuk, hogy győződjön meg róla, hogy a legújabb verziót használja.
it_it: ti consigliamo di assicurarti di utilizzare la versione più recente.
nb_no: anbefaler vi at du validerer at du er på siste versjon.
nl_nl: adviseren we je om te zorgen dat je de laatste versie gebruikt.
pt_br: recomendamos que você verifique se está usando a versão mais recente.
uk_ua: рекомендуємо переконатися, що у вас остання версія.

# #32029
source: Would you like to check for updates now?
cs_cz: Chcete nyní zkontrolovat aktualizace?
de_de: Auf Aktualisierungen prüfen?
hu_hu: Szeretné most ellenőrizni a frissítéseket?
it_it: Vuoi controllare gli aggiornamenti ora?
nb_no: Ønsker du å sjekke for oppdateringer nå?
nl_nl: Wil je nu op updates controleren?
pt_br: Gostaria de verificar se há atualizações agora?
uk_ua: Перевірити наявність оновлень зараз?

# #32030
source: Thanks for trying OSMC.
cs_cz: Děkujeme, že jste vyzkoušeli OSMC.
de_de: Danke für das Ausprobieren von OSMC.
hu_hu: Köszönjük, hogy kipróbálta az OSMC-t.
it_it: Grazie per aver provato OSMC.
nb_no: Takk for at du prøver OSMC.
nl_nl: Bedankt voor het uitproberen van OSMC.
pt_br: Obrigado por experimentar o OSMC.
uk_ua: Дякуємо за те, що спробували OSMC.

# #32031
source: We recommend you check for updates now to ensure you're on the latest version.
cs_cz: Doporučujeme vám zkontrolovat aktualizace, abyste měli jistotu, že používáte nejnovější verzi.
de_de: Wir empfehlen, jetzt auf Aktualisierungen zu prüfen, um sicherzustellen, dass die neuste Version verwendet wird.
hu_hu: Javasoljuk, hogy most ellenőrizze a frissítéseket, hogy biztosan a legújabb verziót használja.
it_it: Ti consigliamo di verificare la disponibilità di aggiornamenti ora per assicurarti di utilizzare la versione più recente.
nb_no: Vi anbefaler at du sjekker etter oppdateringer nå for å forsikre deg at du kjører på siste versjon.
nl_nl: We adviseren om te controleren op updates om zeker te zijn dat je op de laatste versie zit.
pt_br: Recomendamos que você verifique se há atualizações agora para garantir que esteja com a versão mais recente.
uk_ua: Рекомендуємо перевірити зараз наявність оновлень, щоб переконатися, що у вас встановлено останню версію.

# #32032
source: What would you like to do?
cs_cz: Co byste rádi udělali?
de_de: Was tun?
hu_hu: Mit szeretne tenni?
it_it: Cosa ti piacerebbe fare?
nb_no: Hva ønsker du å gjøre?
nl_nl: Wat wil je doen?
pt_br: O que gostaria de fazer?
uk_ua: Що бажаєте зробити?

# #32033
source: at osmc.tv/help and a bustling community
cs_cz: na osmc.tv/help a u komunity nadšenců
de_de: unter osmc.tv/help und einer lebhaften Community-
hu_hu: az osmc.tv/help oldalon és egy nyüzsgő közösségben
it_it: a osmc.tv/help e una vivace comunità
nb_no: på osmc.tv/help og et aktivt miljø
nl_nl: op osmc.tv/help en een bruisende gemeenschap
pt_br: em osmc.tv/help e uma comunidade movimentada
uk_ua: на osmc.tv/help і активної спільноти

# #32034
source: (Suggest a random name)
de_de: (Einen zufälligen Namen vorschlagen)
hu_hu: (Javasoljon egy véletlenszerű nevet)
it_it: (Suggerisci un nome casuale)
nl_nl: (Suggereer een willekeurige naam)

# #32035
source: Give your device a name
cs_cz: Dejte svému zařízení jméno
de_de: Geben Sie Ihrem Gerät einen Namen
hu_hu: Adjon nevet a készülékének
it_it: Dai un nome al dispositivo
nb_no: Gi enheten din et navn
nl_nl: Geef je apparaat een naam
pt_br: Dê um nome ao seu dispositivo
uk_ua: Дайте назву своєму пристрою

# #32036
source: SSH Service is Enabled
cs_cz: Služba SSH je Povolena
de_de: SSH-Dienst ist aktiviert
hu_hu: SSH szolgáltatás engedélyezve van
it_it: Servizio SSH è Attivato
nb_no: SSH-tjeneste er aktivert
nl_nl: SSH-service ingeschakeld
pt_br: Serviço SSH está Ativado
uk_ua: Служба SSH увімкнена

# #32037
source: SSH Service is Disabled
cs_cz: Služba SSH je Zakázána
de_de: SSH-Dienst ist deaktiviert
hu_hu: SSH szolgáltatás le van tiltva
it_it: Servizio SSH è Disattivato
nb_no: SSH-tjeneste er deaktivert
nl_nl: SSH-service uitgeschakeld
pt_br: Serviço SSH está Desativado
uk_ua: Служба SSH вимкнена

# #32038
source: Please enter your password
cs_cz: Prosím zadejte své heslo
de_de: Bitte das Passwort eingeben
hu_hu: Kérjük adja meg a jelszavát
it_it: Inserisci password
nb_no: Vennligst legg inn ditt passord
nl_nl: Voer je wachtwoord in
pt_br: Digite sua senha
uk_ua: Введіть пароль

# #32039
source: Please confirm your password
cs_cz: Prosím potvrďte své heslo
de_de: Bitte das Passwort bestätigen
hu_hu: Kérjük erősítse meg a jelszavát
it_it: Conferma la password
nb_no: Vennligst bekreft ditt passord
nl_nl: Bevestig je wachtwoord
pt_br: Confirme sua senha
uk_ua: Введіть пароль ще раз

# #32040
source: Password mismatch
cs_cz: Heslo nesouhlasí
de_de: Passwort stimmt nicht überein
hu_hu: A jelszavak nem egyeznek
it_it: Password non combaciano
nb_no: Passordene stemmer ikke overens
nl_nl: Wachtwoorden komen niet overeen
pt_br: As senhas não coincidem
uk_ua: Паролі не співпадають

# #32041
source: Would you like to enter your password in plain text?
cs_cz: Chcete zadat heslo jako prostý text?
de_de: Passwort im Klartext eingeben?
hu_hu: Szeretné a jelszavát egyszerű szöveges formában megadni?
it_it: Vuoi inserire la tua password in testo normale?
nb_no: Ønsker du å legge inn passordet ditt i klar tekst?
nl_nl: Wil je je wachtwoord in platte tekst invoeren?
pt_br: Você gostaria de inserir sua senha em texto simples?
uk_ua: Ввести пароль відкритим текстом?

# #32042
source: Your password entries did not match
cs_cz: Zadané heslo nesouhlasí
de_de: Die Passworteingaben stimmen nicht überein
hu_hu: A jelszavai nem egyeznek
it_it: Le password inserite non combaciano
nb_no: Dine innlagte passord er ikke identiske
nl_nl: Je wachtwoorden komen niet overeen
pt_br: As senhas digitadas não coincidem
uk_ua: Введені паролі не співпадають

# #32043
source: Name your device
cs_cz: Název vašeho zařízení
de_de: Gerät benennen
hu_hu: Az Ön eszközének a neve
it_it: Dai un nome al dispositivo
nb_no: Gi navn til enheten
nl_nl: Geef je apparaat een naam
pt_br: Nomeie seu dispositivo
uk_ua: Назвіть свій пристрій

# #32044
source: Click here to change/confirm password:
cs_cz: Kliknutím zde změníte/potvrdíte heslo:
de_de: Zum Ändern/Bestätigen des Passworts hier klicken:
hu_hu: Kattintson ide a jelszó megváltoztatásához/megerősítéséhez:
it_it: Clicca per cambiare/confermare password:
nb_no: Klikk her for å endre/bekrefte passord:
nl_nl: Klik hier voor wijzigen/bevestigen wachtwoord:
pt_br: Clique aqui para alterar/confirmar a senha:
uk_ua: Натисніть тут, щоб змінити/підтвердити пароль:

# #32045
source: Please enter your email
cs_cz: Prosím zadejte svůj email
de_de: Bitte E-Mail eingeben
hu_hu: Kérjük, adja meg az email címét
it_it: Inserisci email
nb_no: Vennligst oppgi din e-post
nl_nl: Voer je e-mailadres in
pt_br: Digite seu e-mail
uk_ua: Введіть свою електронну адресу

# #32046
source: Confirm
cs_cz: Potvrdit
de_de: Bestätigen
hu_hu: Megerősítés
it_it: Comferma
nb_no: Bekreft
nl_nl: Bevestigen
pt_br: Confirmar
uk_ua: Підтвердити

# #32048
source: App Store
cs_cz: Obchod App Store
hu_hu: Alkalmazásközpont
uk_ua: Додатки

# #32049
source: This module is where you can grab awesome APFs like...
cs_cz: Tento modul je místo, kde můžete najít úžasné APF jako ...
de_de: Mit diesem Modul können großartige APFs bezogen werden wie...
hu_hu: Ebben a modulban olyan fantasztikus APF-eket kaphat, mint...
it_it: Questo modulo è dove puoi reprire fantastici APF come ...
nb_no: I denne modulen kan du hente fantastiske APF'er som...
nl_nl: In deze module vind je geweldige APFs zoals...
pt_br: Este módulo é onde você pode pegar APFs incríveis como...
uk_ua: За допомогою цього модуля можна отримати зручні доповнення, такі як...

# #32050
source: Log Uploader
cs_cz: Odesílání Logů
de_de: Protokoll-Uploader
hu_hu: Naplófeltöltő
it_it: Invio Log
nb_no: Logg opplaster
pt_br: Uploader de Logs
uk_ua: Завантажувач журналів

# #32051
source: This module helps with debugging and troubleshooting by retrieving logs, various xml, and config information from your system and uploading them in a single file.[CR]Once uploading is complete, you are provided with a URL which you can share on the OSMC forums.[CR]The information stored in the URL will help others diagnose your issue and decrease the amount of time it takes to find a resolution.
cs_cz: Tento modul pomáhá při ladění a odstraňování problémů načítáním logů, různých souborů XML a konfiguračních informací z vašeho systému a jejich nahráváním do jednoho souboru. [CR] Po dokončení nahrávání vám bude poskytnuta adresa URL, kterou můžete sdílet na fórech OSMC. [CR] Informace uložené v adrese URL pomohou ostatním diagnostikovat váš problém a zkrátí dobu potřebnou k nalezení řešení.
de_de: Dieses Modul hilft beim Debuggen und der Fehlersuche durch das Sammeln von Protokollen, verschiedenen XML- sowie Konfigurationsinformationen Ihres Systems und das Hochladen dieser in einer einzigen Datei.[CR]Sobald das Hochladen abgeschlossen ist, erhalten Sie eine URL, die Sie im OSMC-Forum teilen können.[CR]Die in der URL hinterlegten Informationen werden anderen helfen, Ihr Problem zu diagnostizieren, und die Zeit bis zum Finden einer Lösung zu reduzieren.
hu_hu: Ez a modul segít a hibakeresésben és a hibaelhárításban azáltal, hogy naplófájlokat, különböző xml-eket és konfigurációs információkat kér le a rendszeredből, és ezeket egyetlen fájlban feltölti. [CR]Miután a feltöltés befejeződött, kap egy hivatkozást, amelyet megoszthat az OSMC fórumokon.[CR] A hivatkozásban tárolt információk segítenek másoknak diagnosztizálni a problémát, és csökkentik a megoldáshoz szükséges időt.
it_it: Questo modulo aiuta con il debug e la risoluzione dei problemi recuperando log, vari xml e informazioni di configurazione dal sistema e caricandoli in un singolo file.[CR]Una volta completato il caricamento, ti viene fornito un URL che puoi condividere sui forum OSMC.[CR]Le informazioni memorizzate nell'URL aiuteranno gli altri a diagnosticare il problema e a ridurre il tempo necessario per trovare una soluzione.
nb_no: Denne modulen hjelper med feilretting og feilsøking ved å hente logger, forskjellige xml og konfigurasjonsinformasjon fra systemet ditt og laste dem opp i en enkelt fil.[CR]Når opplastingen er fullført, får du en URL som du kan dele på OSMC -forumet.[CR]Informasjonen som er lagret i nettadressen, vil hjelpe andre med å diagnostisere problemet ditt og redusere tiden det tar å finne en løsning.
nl_nl: Deze module helpt bij het opsporen en oplossen van problemen door logs, diverse xml en configuratie-informatie van je systeem op te halen en in een enkel bestand te uploaden.[CR]Zodra het uploaden voltooid is, krijg je een URL die je kunt delen op het OSMC forum.[CR]De informatie die in de URL is opgeslagen helpt anderen bij het diagnosticeren van je probleem en verkort de tijd die het kost om een oplossing te vinden.
pt_br: Este módulo ajuda na depuração e solução de problemas, recuperando logs, vários xml e informações de configuração do seu sistema e enviando-os em um único arquivo.[CR]Uma vez que o envio for concluído, você receberá uma URL que pode ser compartilhada nos fóruns do OSMC.[CR]As informações armazenadas no URL ajudarão outras pessoas a diagnosticar seu problema e diminuirão o tempo necessário para encontrar uma solução.
uk_ua: Цей модуль допомагає в налагодженні та усуненні неполадок. Він збирає журнали, різні XML-файли та конфігураційні дані з системи та завантажує їх на сервер в одному файлі.[CR]Після завантаження вам буде надано URL-адресу, якою ви можете поділитися на форумах OSMC.[CR]Інформація, що доступна за цією адресою, допоможе іншим діагностувати вашу проблему та прискорити пошук її вирішення.

# #32052
source: Network
cs_cz: Síť
de_de: Netzwerk
hu_hu: Hálózat
it_it: Rete
nb_no: Nettverk
nl_nl: Netwerk
pt_br: Rede
uk_ua: Мережа

# #32053
source: This is network settings, it contains settings for the network.
cs_cz: Toto je nastavení sítě, obsahuje nastavení pro připojení k síti.
de_de: Dies sind Netzwerkeinstellungen, sie enthalten Einstellungen für das Netzwerk.
hu_hu: A hálózati beállítások, a hálózat beállításait tartalmazza.
it_it: Impostazioni di rete, contiene impostazioni per le varie tipologie di rete.
nb_no: Dette er nettverksinnstillingene, det inneholder innstillinger for nettverket.
nl_nl: Dit zijn netwerkinstellingen, het bevat de instellingen voor het netwerk.
pt_br: Estas são as configurações de rede, que contém configurações para a rede.
uk_ua: Тут налаштовуються параметри мережі.

# #32054
source: Pi Config
cs_cz: Nastavení Raspberry
de_de: Pi-Konfiguration
hu_hu: Pi beállítások
it_it: Configurazione Pi
nb_no: Konfigurasjon for Raspberry Pi
nl_nl: Pi configuratie
pt_br: Configurações do Pi
uk_ua: Налаштування PI
