Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.pi/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, uk_ua

# #32001
source: Display
cs_cz: Displej
de_de: Anzeige
hu_hu: Monitor
lt_lt: Ekranas
nb_no: Skjerm
nl_nl: Beeldscherm
uk_ua: Екран

# #32002
source: GPU Mem & Codec
cs_cz: GPU paměť a kodeky
de_de: GPU Arbeitsspeicher & Codec
hu_hu: GPU memória és kodekek
it_it: Mem GPU & Codec
lt_lt: GPU atmintis ir kodekas
nb_no: GPU minne & kodek
nl_nl: GPU geh. & codec
uk_ua: Пам'ять GPU та кодек

# #32003
source: display_rotate
cs_cz: př. display_rotate

# #32007
source: Flip Horizontal
cs_cz: Převrátit vodorovně
de_de: Horizontal spiegeln
hu_hu: Vízszintes tükrözés
it_it: Capovolgi in orizzontale
lt_lt: Apversti horizontaliai
nb_no: Vend horisontalt
nl_nl: Horizontaal omklappen
uk_ua: Відобразити зліва направо

# #32008
source: Flip Vertical
cs_cz: Převrátit svisle
de_de: Vertikal spiegeln
hu_hu: Függőleges tükrözés
it_it: Capovolgi in verticale
lt_lt: Apversti vertikaliai
nb_no: Vend vertikalt
nl_nl: Verticaal omklappen
uk_ua: Відобразити зверху вниз

# #32009
source: hdmi_safe
cs_cz: př. hdmi_safe

# #32010
source: hdmi_force_hotplug=1, hdmi_ignore_edid=0xa5000080, config_hdmi_boost=4, hdmi_group=2, hdmi_mode=4, disable_overscan=0
cs_cz: př. hdmi_force_hotplug=1, hdmi_ignore_edid=0xa5000080, config_hdmi_boost=4, hdmi_group=2, hdmi_mode=4, disable_overscan=0

# #32011
source: hdmi_ignore_edid
cs_cz: př. hdmi_ignore_edid

# #32012
source: store_hdmi_to_file
cs_cz: př. store_hdmi_to_file

# #32013
source: hdmi_force_hotplug should be disabled before using a different tv or hdmi port
cs_cz: př. hdmi_force_hotplug by měl být deaktivován před použitím jiného portu tv nebo hdmi
de_de: hdmi_force_hotplug sollte vor der Nutzung eines anderen TV- oder HDMI-Eingangs deaktiviert werden
hu_hu: A hdmi_force_hotplug-ot ki kell kapcsolni, mielőtt más tv-t vagy hdmi portot használna
it_it: hdmi_force_hotplug andrebbe disabilitato prima di cambiare porta tv o hdmi
lt_lt: hdmi_force_hotplug turėtų būti išjungtas prieš naudojant kitą televizorių ar hdmi prievadą
nb_no: hdmi_force_hotplug bør deaktiveres før du bruker en annen tv eller hdmi-port
uk_ua: Перед використанням іншого телевізора або порту HDMI слід вимкнути hdmi_force_hotplug

# #32014
source: hdmi_ignore_cec
cs_cz: př. hdmi_ignore_cec

# #32015
source: config_hdmi_boost (0 to disable)
cs_cz: př. config_hdmi_boost (0 pro vypnutí)
de_de: config_hdmi_boost (0 zum Deaktivieren)
hu_hu: config_hdmi_boost (0 a letiltáshoz)
it_it: config_hdmi_boost (0 per disabilitare)
lt_lt: config_hdmi_boost (0 - išjungta)
nb_no: config_hdmi_boost (0 for a deaktivere)
uk_ua: config_hdmi_boost (0 — вимкнуто)

# #32016
source: hdmi_group
cs_cz: př. hdmi_group

# #32017
source: Auto
cs_cz: Automaticky
hu_hu: Automatikus
lt_lt: Automatiškai
uk_ua: Автоматично

# #32020
source: hdmi_mode (max 59 for CEA)
cs_cz: př. hdmi_mode (max 59 pro CEA)
de_de: hdmi_mode (max 59 für CEA)
hu_hu: HDMI Mód (max 59 a CEA esetében)
it_it: hdmi_mode (massimo 59 per CEA)
lt_lt: hdmi_mode (maks. 59 CEA)
nb_no: hdmi_mode (maks 59 for CEA)
nl_nl: hdmi_mode (max. 59 voor CEA)
uk_ua: hdmi_mode (макс. 59 для CEA)

# #32021
source: sdtv_mode
cs_cz: př. sdtv_mode

# #32022
source: NTSC
cs_cz: norma NTSC

# #32023
source: NTSC (Japan)
cs_cz: norma NTSC (Japonsko)
hu_hu: NTSC (Japán)
it_it: NTSC (Giappone)
lt_lt: NTSC (Japonija)
uk_ua: NTSC (Японія)

# #32024
source: PAL
cs_cz: norma PAL

# #32025
source: Pal(Brazil)
cs_cz: norma PAL (Brazílie)
de_de: PAL (Brasilien)
nl_nl: PAL (BraziliÃ«)

# #32026
source: sdtv_aspect
cs_cz: př. sdtv_aspect

# #32030
source: Set for 256mb Pi
cs_cz: Nastavení pro 256MB Pi
de_de: Für 256mb Pi einstellen
hu_hu: Pi 256mb használata
it_it: Imposta per Pi da 256mb
lt_lt: Nustatytas 256mb Pi
nb_no: Sett for 256MB Pi
nl_nl: Instellen voor 256mb Pi
uk_ua: Налаштування для Pi 256 МБ

# #32031
source: Set for 512mb Pi
cs_cz: Nastavení pro 512MB Pi
de_de: Für 512mb Pi einstellen
hu_hu: Pi 512mb használata
it_it: Imposta per Pi da 512mb
lt_lt: Nustatytas 512mb Pi
nb_no: Sett for 512MB Pi
nl_nl: Instellen voor 512mb Pi
uk_ua: Налаштування для Pi 512 МБ

# #32032
source: Enter MPG2 Licence:
cs_cz: Zadej MPG2 licenci:
de_de: MPG2-Lizenz eingeben:
hu_hu: Adja meg az MPG2 engedélyét:
it_it: Inserisci licenza MPG2:
lt_lt: Įveskite MPG2 licenciją:
nb_no: Skriv inn MPG2-lisens:
nl_nl: Invoer MPG2 licentie:
uk_ua: Введіть ліцензію MPG2:

# #32033
source: Enter WVC1 Licence:
cs_cz: Zadej WVC1 licenci:
de_de: WVC1-Lizenz eingeben:
hu_hu: Adja meg a WVC1 engedélyt:
it_it: Inserisci licenza WVC1:
lt_lt: Įveskite WVC1 licenciją:
nb_no: Skriv inn WVC1-lisens:
nl_nl: Invoer WVC1 licentie:
uk_ua: Введіть ліцензію WVC1:

# #32034
source: Open config-user.txt Editor
cs_cz: Otevřít editor config-user.txt
de_de: config-user.txt-Editor öffnen
hu_hu: config-user.txt megnyitása szerkesztővel
it_it: Apri editor config-user.txt
lt_lt: Atidaryti config-user.txt redaktorių
nb_no: Åpne config-user.txt redigering
uk_ua: Відкрити редактор config-user.txt

# #32050
source: Done
cs_cz: Hotovo
de_de: Fertig
hu_hu: Befejezés
it_it: Fatto
lt_lt: Atlikta
nb_no: Gjort
nl_nl: Gereed
uk_ua: Готово

# #32051
source: OSMC Pi Config Editor
cs_cz: OSMC Editor nastavení Pi
de_de: OSMC-Pi-Konfigurationseditor
hu_hu: OSMC Pi Beállításszerkesztő
it_it: Editor Configurazione OSMC Pi
lt_lt: OSMC Pi konfigūracijos redaktorius
uk_ua: Редактор конфігурації Pi OSMC

# #32052
source: New Entry
cs_cz: Nová položka
de_de: Neuer Eintrag
hu_hu: Új bejegyzés
it_it: Nuova Voce
lt_lt: Naujas įrašas
nb_no: Ny oppføring
nl_nl: Nieuw item
uk_ua: Новий запис

# #32053
source: Would you like to write these changes to the config file?
cs_cz: Chcete zapsat tyto změny do konfiguračního souboru?
de_de: Sollen diese Änderungen in die Konfigurationsdatei geschrieben werden?
hu_hu: Szeretné ezeket a változtatásokat a konfigurációs fájlba írni?
it_it: Scrivere queste modifiche nel file di configurazione?
lt_lt: Ar norite įrašyti šiuos pakeitimus į konfigūracijos failą?
nb_no: Vil du skrive disse endringene i konfigurasjonsfilen?
nl_nl: Wil je deze wijzigingen wegschrijven in het configbestand?
uk_ua: Записати ці зміни у файл конфігурації?

# #32054
source: Discard
cs_cz: Zrušit
de_de: Verwerfen
hu_hu: Eldobás
it_it: Cancella
lt_lt: Atmesti
nb_no: Kast
nl_nl: Weggooien
uk_ua: Відкинути

# #32055
source: Write
cs_cz: Zapsat
de_de: Schreiben
hu_hu: Írás
it_it: Scrivi
lt_lt: Įrašyti
nb_no: Skriv
nl_nl: Schrijven
uk_ua: Записати

# #32056
source: DELETE
cs_cz: SMAZAT
de_de: LÖSCHEN
hu_hu: TÖRLÉS
it_it: ELIMINA
lt_lt: IŠTRINTI
nb_no: SLETTE
nl_nl: VERWIJDEREN
uk_ua: ВИДАЛИТИ

# #32057
source: Would you like to EDIT or DELETE this entry?
cs_cz: Chcete UPRAVIT nebo SMAZAT tento záznam?
de_de: Diesen Eintrag ANPASSEN or LÖSCHEN?
hu_hu: Szerkeszteni vagy törölni szeretné ezt a bejegyzést?
it_it: Vuoi MODIFICARE o ELIMINARE questa voce?
lt_lt: Norite REDAGUOTI ar IŠTRINTI šį įrašą?
nb_no: Vil du REDIGERE eller SLETTE denne oppføringen?
nl_nl: Wil je dit item BEWERKEN of VERWIJDEREN?
uk_ua: ЗМІНИТИ чи ВИДАЛИТИ цей запис?

# #32058
source: Edit
cs_cz: Upravit
de_de: Anpassen
hu_hu: Szerkesztés
it_it: Modifica
lt_lt: Redaguoti
nb_no: REDIGERE
nl_nl: Bewerken
uk_ua: Змінити

# #32059
source: Delete
cs_cz: Smazat
de_de: Löschen
hu_hu: Törlés
it_it: Elimina
lt_lt: Ištrinti
nb_no: Slette
nl_nl: Verwijderen
uk_ua: Видалити

# #32060
source: Edit the config entry
cs_cz: Upravit nastavovací záznam
de_de: Den Konfigurationseintrag anpassen
hu_hu: A konfigurációs bejegyzés szerkesztése
it_it: Modifica la voce di configurazione
lt_lt: Redaguoti konfigūracijos įrašą
nb_no: Rediger konfigurasjonsoppføringen
nl_nl: Bewerk het configitem
uk_ua: Редагування запису конфігурації

# #32061
source: Would you like to EDIT or UNDELETE this entry?
cs_cz: Chcete UPRAVIT nebo OBNOVIT tento záznam?
de_de: Diesen Eintrag ANPASSEN oder WIEDERHERSTELLEN?
hu_hu: Szeretné szerkeszteni vagy töröltetni ezt a bejegyzést?
it_it: Vuoi MODIFICARE o ANNULLARE L'ELIMINAZIONE questa voce?
nb_no: Vil du REDIGERE eller GJENOPPRETTE denne oppføringen?
nl_nl: Wil je dit item BEWERKEN of ONGEDAAN MAKEN?
uk_ua: ЗМІНИТИ чи ВІДНОВИТИ цей запис?

# #32062
source: Undelete
cs_cz: Obnovit
de_de: Wiederherstellen
hu_hu: Törlés visszavonása
it_it: Annulla eliminazione
lt_lt: Atšaukti ištrynimą
nb_no: Gjenopprette
nl_nl: Ongedaan maken
uk_ua: Відновити

# #32063
source: Edit the config entry
cs_cz: Upravit nastavovací záznam

# #32064
source: Add a new config entry
cs_cz: Vložit nový nastavovací záznam
de_de: Einen neuen Konfigurationseintrag hinzufügen
hu_hu: Új konfigurációs bejegyzés hozzáadása
it_it: Aggiungi nuova voce di configurazione
lt_lt: Pridėti naują konfigūracijos įrašą
nb_no: Legg til en ny konfigurasjonsoppføring
nl_nl: Nieuw configitem toevoegen
uk_ua: Додайте новий запис конфігурації

# #32065
source: Your config-user.txt contains duplicate entries.
cs_cz: Váš soubor config-user.txt obsahuje zdvojené záznamy.
de_de: config-user.txt enthält doppelte Einträge.
hu_hu: A config-user.txt duplikált bejegyzéseket tartalmaz.
it_it: Il file config-user.txt contiene voci duplicate.
lt_lt: Jūsų config-user.txt faile yra pasikartojančių įrašų.
nb_no: Din config-user.txt inneholder dublettoppføringer.
nl_nl: Je config-user.txt bevat dubbele items.
uk_ua: Файл config-user.txt містить повторювані записи.

# #32066
source: Please consider deleting the obsolete entry.
cs_cz: Zvažte prosím odstranění zastaralé položky.
de_de: Bitte das Löschen der doppelten Einträge erwägen.
hu_hu: Kérjük, fontolja meg az elavult bejegyzés törlését.
it_it: Considerate l'eliminazione delle voci obsolete.
lt_lt: Apsvarstykite galimybę ištrinti pasenusį įrašą.
nb_no: Vennligst vurder å slette den foreldede oppføringen.
nl_nl: Overweeg om het overbodige item te verwijderen.
uk_ua: Видаліть зайві записи.

# #32067
source: This setting already exists in your config-user.txt.
cs_cz: Toto nastavení již je ve vašem souboru config-user.txt.
de_de: Diese Einstellung existiert bereits in config-user.txt.
hu_hu: Ez a beállítás már létezik a config-user.txt fájlban.
it_it: Questa impostazione esiste già nel file config-user.txt.
lt_lt: Šis nustatymas jau yra jūsų config-user.txt faile.
nb_no: Denne innstillingen eksisterer allerede i config-user.txt.
nl_nl: Deze instelling bestaat al in je config-user.txt.
uk_ua: Це налаштування вже є у файлі config-user.txt.

# #32068
source: Pi Serial:
cs_cz: Sériové číslo Pi:
de_de: Pi-Seriennummer:
hu_hu: Pi Sorozat:
it_it: Seriale Pi:
lt_lt: Pi serijinis numeris:
nb_no: Pi serienummer:
nl_nl: Pi serienummer:
uk_ua: Серійний номер Pi:

# #32069
source: Codec status:
cs_cz: Stav kodeku:
hu_hu: Kodek állapot:
it_it: Status Codec:
lt_lt: Kodeko būsena:
nb_no: Kodek status:
uk_ua: Стан кодека:

# #32070
source: Config Editor
cs_cz: Editor Nastavení
de_de: Konfigurationseditor
hu_hu: Beállításszerkesztő
it_it: Editor Configurazione
lt_lt: Konfigūracijos redaktorius
nb_no: Konfigureringseditor
uk_ua: Редактор конфігурації

# #32071
source: GPU Memory Allocation
cs_cz: Alokace GPU paměti
de_de: GPU-Arbeitsspeicherverteilung
hu_hu: GPU memória kiosztása
it_it: Allocazione Memoria GPU
lt_lt: GPU atminties paskirstymas
nb_no: GPU-minnetildeling
nl_nl: GPU geheugentoewijzing
uk_ua: Виділення пам'яті GPU

# #32074
source: Hardware Support
cs_cz: Podpora hardwaru
de_de: Hardwareunterstützung
hu_hu: Hardveres támogatás
it_it: Supporto Hardware
lt_lt: Techninės įrangos palaikymas
nb_no: Maskinvarestøtte
nl_nl: Hardwareondersteuning
uk_ua: Підтримка обладнання

# #32075
source: Enable HifiBerry DAC sound card
cs_cz: Povolit zvukovou kartu Hifiberry DAC
de_de: HifiBerry DAC-Soundkarte aktivieren
hu_hu: HifiBerry DAC hangkártya engedélyezése
it_it: Abilita scheda audio HifiBerry DAC
lt_lt: Įgalinti HifiBerry DAC garso plokštę
nb_no: Aktiver HifiBerry DAC lydkort
nl_nl: Activeer HifiBerry DAC geluidskaart
uk_ua: Увімкнути звукову карту HifiBerry DAC

# #32076
source: Enable HifiBerry DAC sound card
cs_cz: Povolit zvukovou kartu Hifiberry DAC

# #32077
source: Enable HiFiBerry Digi sound card
cs_cz: Povolit zvukovou kartu Hifiberry DAC
de_de: HifiBerry Digi-Soundkarte aktivieren
hu_hu: HiFiBerry Digi hangkártya engedélyezése
it_it: Abilita scheda audio HifiBerry Digi
lt_lt: Įgalinti HiFiBerry Digi garso plokštę
nb_no: Aktiver HiFiBerry Digi lydkort
nl_nl: Activeer HifiBerry Digi geluidskaart
uk_ua: Увімкнути звукову карту HiFiBerry Digi

# #32078
source: Enable IQAudio DAC sound card
cs_cz: Povolit zvukovou kartu IQAudio DAC

# #32079
source: Enable IQAudio DAC sound card
cs_cz: Povolit zvukovou kartu IQAudio DAC
de_de: IQAudio DAC-Soundkarte aktivieren
hu_hu: IQAudio DAC hangkártya engedélyezése
it_it: Abilita scheda audio IQAudio
lt_lt: Įgalinti IQAudio DAC garso plokštę
nb_no: Aktiver IQAudio DAC lydkort
nl_nl: Activeer IQAudio DAC geluidskaart
uk_ua: Увімкнути звукову карту IQAudio DAC

# #32080
source: Enable LIRC GPIO support
cs_cz: Povolit podporu LIRC GPIO
de_de: LIRC-GPIO-Unterstützung aktivieren
hu_hu: LIRC GPIO támogatás engedélyezése
it_it: Abilita supporto GPIO per LIRC
lt_lt: Įgalinti LIRC GPIO palaikymą
nb_no: Aktiver LIRC GPIO -støtte
nl_nl: Activeer LIRC GPIO ondersteuning
uk_ua: Увімкнути підтримку LIRC GPIO

# #32081
source: Enable 1-wire GPIO support
cs_cz: Povolit podporu 1-wire GPIO
de_de: 1-wire GPIO-Unterstützung aktivieren
hu_hu: 1-wire GPIO támogatás engedélyezése
it_it: Abilita supporto GPIO a 1-filo
lt_lt: Įgalinti 1-wire GPIO palaikymą
nb_no: Aktiver 1-leder GPIO-støtte
nl_nl: Activeer 1-draads GPIO support
uk_ua: Увімкнути підтримку 1-дротового GPIO

# #32082
source: Enable 1-wire pull-up GPIO support
cs_cz: Povolit podporu 1-wire pull-up GPIO
de_de: 1-wire pull-up GPIO-Unterstützung aktivieren
hu_hu: 1-wire pull-up GPIO támogatás engedélyezése
it_it: Abilita supporto GPIO a 1-filo pull-up
lt_lt: Įgalinti 1-wire pull-up GPIO palaikymą
nb_no: Aktiver 1-tråds opptrekkbar GPIO-støtte
nl_nl: Activeer 1-draads pull-up GPIO ondersteuning
uk_ua: Увімкнути підтримку 1-дротового GPIO з підтяжкою

# #32083
source: Suppress all overlays
cs_cz: Potlačit všechna overlays
de_de: Alle Overlays unterdrücken
hu_hu: Minden átfedés elnyomása
it_it: Disabilita ogni sovrimpressione
lt_lt: Slopinti visas perdangas
nb_no: Undertrykk alle overlegg
nl_nl: Onderdruk alle overlays
uk_ua: Заблокувати всі накладення

# #32084
source: Set for 1024mb Pi2
cs_cz: Nastavení pro 1024MB Pi2
de_de: Für 1024mb Pi einstellen
hu_hu: Pi2 1024mb használata
it_it: Imposta per Pi2 da 1024mb
lt_lt: 1024mb Pi2 skirtas rinkinys
nb_no: Sett for 1024MB Pi2
nl_nl: Instellen voor 1024mb Pi2
uk_ua: Налаштування для Pi2 1024 МБ

# #32085
source: Off
cs_cz: Vypnuto
de_de: Aus
hu_hu: Ki
it_it: Spento
lt_lt: Išjungta
nb_no: Av
nl_nl: Uit
uk_ua: Вимк

# #32086
source: Enable SPI support
cs_cz: Povolit podporu SPI
de_de: SPI-Unterstützung aktivieren
hu_hu: SPI támogatás engedélyezése
it_it: Abilita supporto SPI
lt_lt: Įgalinti SPI palaikymą
nb_no: Aktiver SPI-støtte
nl_nl: Activeer SPI ondersteuning
uk_ua: Увімкнути підтримку SPI

# #32087
source: hdmi_pixel_encoding
cs_cz: př. hdmi_pixel_encoding

# #32088
source: default
cs_cz: výchozí
de_de: Standard
hu_hu: alapértelmezett
it_it: predefinito
lt_lt: numatytasis
nb_no: standard
nl_nl: standaard
uk_ua: за замовчуванням

# #32089
source: RGB limited
cs_cz: RGB omezeno
de_de: RGB beschränkt
hu_hu: Korlátozott RGB
it_it: RGB limitato
lt_lt: RGB ribotas
nb_no: RGB begrenset
nl_nl: RGB gelimiteerd
uk_ua: обмежений RGB

# #32090
source: RGB full
cs_cz: Plné RGB
de_de: RGB voll
hu_hu: Teljes RGB
it_it: RGB completo
lt_lt: RGB pilnas
nl_nl: RGB volledig
uk_ua: повний RGB

# #32091
source: YCbCr limited
cs_cz: YCbCr omezeno
de_de: YCbCr beschränkt
hu_hu: Korlátozott YCbCr
it_it: YCbCr limitato
lt_lt: YCbCr ribotas
nb_no: YCbCr begrenset
nl_nl: YCbCr gelimiteerd
uk_ua: обмежений YCbCr

# #32092
source: YCbCr full
cs_cz: Plné YCbCr
de_de: YCbCr voll
hu_hu: Teljes YCbCr
it_it: YCbCr completo
lt_lt: YCbCr pilnas
nl_nl: YCbCr volledig
uk_ua: повний YCbCr

# #32094
source: Soundcard Overlay
cs_cz: Overlay soubor pro zvukovou kartu
de_de: Soundkarten-Overlay
hu_hu: Hangkártya átfedés
lt_lt: Garso plokštės perdanga
nb_no: Lydkortoverlegg
nl_nl: Geluidskaart overlay
uk_ua: Накладання звукової карти

# #32095
source: Please Note
cs_cz: Upozornění
de_de: Hinweis
hu_hu: Kérjük, vegye figyelembe
lt_lt: Atkreipkite dėmesį
nb_no: Vennligst merk
nl_nl: Let op
uk_ua: Зверніть увагу

# #32096
source: Changes to Pi config require a restart.
cs_cz: Změny v nastavení Raspbery vyžadují restart.
de_de: Änderungen der Pi-Konfiguratuin erfordern einen Neustart.
hu_hu: A Pi konfigurációjának módosítása újraindítást igényel.
it_it: Cambiamenti alla configurazione Pi richiedono un riavvio.
lt_lt: Pakeitus Pi konfigūraciją, reikia paleisti iš naujo.
nb_no: Endringer i Pi -konfigurasjonen krever en omstart.
nl_nl: Wijzigingen aan Pi-configuratie vereisen een herstart.
uk_ua: Після зміни конфігурації Pi потрібне перезавантаження.

# #32097
source: Force audio=on
cs_cz: Vynutit audio=on
de_de: audio=on erzwingen
hu_hu: Force audio=on (audió kényszerítése)
it_it: Forza audio=on
nb_no: Tving lyd = på
nl_nl: Forceer audio=on
uk_ua: Примусово audio=on

# #32098
source: (Defaults: 2 for Pi A & B, 5 for later versions)
cs_cz: (Výchozí: 2 pro Pi A & B, 5 pro pozdější verze)
de_de: (Standards: 2 für Pi A & B, 5 für spätere Versionen)
hu_hu: (Alapértelmezett: Pi 2 A és B esetében, 5 a későbbi verzióknál)
it_it: (Predefiniti: 2 per Pi A & B, 5 per versioni successive)
nb_no: (Standard: 2 for Pi A & B, 5 for senere versjoner)
nl_nl: (Standaard: 2 voor Pi A & B, 5 voor latere versies)
uk_ua: (За замовчуванням: 2 для Pi A та B, 5 для пізніших версій)

# #32099
source: hdmi_edid_file
cs_cz: př. hdmi_edid_file

# #32100
source: hdmi_force_hotplug
cs_cz: př. hdmi_force_hotplug

# #32101
source: Enable Justboom DAC sound card
cs_cz: Povolit zvukové karty Justboom DAC
de_de: Justboom DAC-Soundkarte aktivieren
hu_hu: Justboom DAC hangkártya engedélyezése
it_it: Abilita scheda audio Justboom DAC
lt_lt: Įgalinti Justboom DAC garso plokštę
nb_no: Aktiver Justboom DAC lydkort
nl_nl: Activeer Justboom DAC geluidskaart
uk_ua: Увімкнути звукову карту Justboom DAC

# #32102
source: Enable Justboom Digi sound card
cs_cz: Povolit zvukové karty Justboom Digi
de_de: Justboom Digi-Soundkarte aktivieren
hu_hu: Justboom Digi hangkártya engedélyezése
it_it: Abilita scheda audio Justboom Digi
lt_lt: Įgalinti Justboom Digi garso plokštę
nb_no: Aktiver Justboom Digi lydkort
nl_nl: Activeer Justboom Digi geluidskaart
uk_ua: Увімкнути звукову карту Justboom Digi

# #32103
source: Enable Allo Piano DAC sound card
cs_cz: Povolit zvukové karty Allo Piano DAC
de_de: Allo Piano DAC-Soundkarte aktivieren
hu_hu: Allo Piano DAC hangkártya engedélyezése
it_it: Abilita scheda audio Allo Piano DAC
lt_lt: Įgalinti Allo Piano DAC garso plokštę
nb_no: Aktiver Allo Piano DAC lydkort
nl_nl: Activeer Allo Piano DAC geluidskaart
uk_ua: Увімкнути звукову карту Allo Piano DAC

# #32104
source: Enable Allo Boss DAC sound card
cs_cz: Povolit zvukové karty Allo Boss DAC
de_de: Allo Boss DAC-Soundkarte aktivieren
hu_hu: Allo Boss DAC hangkártya engedélyezése
it_it: Abilita scheda audio Allo Piano Digi
lt_lt: Įgalinti Allo Boss DAC garso plokštę
nb_no: Aktiver Allo Boss DAC lydkort
nl_nl: Activeer Allo Boss DAC geluidskaart
uk_ua: Увімкнути звукову карту Allo Boss DAC

# #32105
source: Enable Allo Digione sound card
cs_cz: Povolit zvukové karty Allo Digione
de_de: Allo Boss Digione-Soundkarte aktivieren
hu_hu: Allo Digione hangkártya engedélyezése
it_it: Abilita scheda audio Allo Digione
lt_lt: Įgalinti Allo Digione garso plokštę
nb_no: Aktiver Allo Digione lydkort
nl_nl: Activeer Allo Digione geluidskaart
uk_ua: Увімкнути звукову карту Allo Digione

# #32025
source: PAL (Brazil)
hu_hu: PAL (Brazilia)
it_it: PAL (Brasile)
lt_lt: PAL (Brazilija)
uk_ua: PAL (Бразилія)

# #32106
source: [COLOR red]Warning[/COLOR]: GPIO remote support with default pins incompatible with HiFiBerry and iqaudio.
de_de: [COLOR red]Warnung[/COLOR]: GPIO-Fernbedienungsunterstützung mit Standard-Pins zu HiFiBerry und iqaudio inkompatibel.
hu_hu: [COLOR red]Figyelmeztetés[/COLOR]: HiFiBerryvel és iqaudio-val inkompatibilis GPIO távoli támogatás alapértelmezett pinekkel.
it_it: [COLOR red]Attenzione[/COLOR]: supporto remoto a GPIO su pin predefiniti è incompatibile con HiFiBerry e iqaudio.
nb_no: [COLOR red]Advarsel[/COLOR]: GPIO fjernkontroll støtte med standard pinner som ikke er kompatible med HiFiBerry og iqaudio.
nl_nl: [COLOR red]Waarschuwing[/COLOR]: GPIO ondersteuning op afstand met standaard-pinnen is niet compatibel met HiFiBerry en iqaudio.
uk_ua: [COLOR red]Попередження[/COLOR]: підтримка віддаленого GPIO з контактами за замовчуванням несумісна з HiFiBerry та iqaudio.

# #32107
source: gpio_pin (0 for disabled)
de_de: gpio_pin (0 für deaktiviert)
hu_hu: gpio_pin (0 a letiltáshoz)
it_it: gpio_pin (0 per disabilitare)
lt_lt: gpio_pin (0 - išjungta)
nb_no: gpio_pin (0 for deaktivert)
nl_nl: gpio_pin (0 voor uitgeschakeld)
uk_ua: gpio_pin (0 — вимкнуто)
