Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.remotes/resources/language/resource.language.*/strings.po
Languages: cs_cz, da_dk, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_br, pt_pt, sv_se, uk_ua

# #32001
source: Apply
cs_cz: Použít
da_dk: Anvend
hu_hu: Alkalmaz
it_it: Applica
lt_lt: Pritaikyti
nb_no: Bruk
nl_nl: Toepassen
pt_br: Aplicar
pt_pt: Aplicar
sv_se: Verkställ
uk_ua: Застосувати

# #32002
source: Remote Selection
cs_cz: Výběr dálkového ovládání
da_dk: Valg af fjernbetjening
hu_hu: Távirányító kiválasztása
it_it: Selezione telecomando
lt_lt: Pultelio pasirinkimas
nb_no: Fjernkontroll valg
nl_nl: Afstandsbediening selectie
pt_br: Seleção Remota
pt_pt: Seleção de Comando
sv_se: Fjärrkontrollsval
uk_ua: Вибір пульту

# #32003
source: Browse
cs_cz: Procházet
da_dk: Gennemse
hu_hu: Böngészés
it_it: Sfoglia
lt_lt: Naršyti
nb_no: Utforsk
nl_nl: Bladeren
pt_br: Navegar
pt_pt: Navegar
sv_se: Bläddra
uk_ua: Огляд

# #32004
source: Exit
cs_cz: Ukončit
da_dk: Afslut
hu_hu: Kilépés
it_it: Esci
lt_lt: Išeiti
nb_no: Avslutt
nl_nl: Afsluiten
pt_br: Sair
pt_pt: Saír
sv_se: Avsluta
uk_ua: Вихід

# #32005
source: Select .conf file
cs_cz: Vybrat soubor .conf
da_dk: Vælg .conf fil
hu_hu: .conf fájl kiválasztása
it_it: Seleziona file .conf
lt_lt: Parinkti .conf failą
nb_no: Velg .conf fil
nl_nl: Selecteer .conf bestand
pt_br: Selecione arquivo .conf
pt_pt: Escolha ficheiro .conf
sv_se: Välj .conf fil
uk_ua: Виберіть conf-файл

# #32006
source: OSMC Remotes
cs_cz: Dálková ovládání OSMC
da_dk: OSMC Fjernbetjeninger
hu_hu: OSMC Távvezérlés
it_it: Telecomandi OSMC
lt_lt: OSMC pulteliai
nb_no: OSMC fjernkontroller
nl_nl: OSMC afstandsbedieningen
pt_br: Controles Remotos OSMC
pt_pt: Comandos OSMC
sv_se: OSMC Kontrollers
uk_ua: Пульти OSMC

# #32007
source: Please confirm change
cs_cz: Prosím potvrdit změnu
da_dk: Bekræft venligst ændringen
hu_hu: Kérjük, erősítse meg a változást
it_it: Conferma cambiamenti
lt_lt: Patvirtinkite pakeitimą
nb_no: Vennligst bekreft endringer
nl_nl: Bevestig de wijziging
pt_br: Confirme a alteração
pt_pt: Por favor confirmar escolha
sv_se: Vänligen bekräfta ändringar
uk_ua: Підтвердить зміни

# #32008
source: Changes will revert in x seconds
cs_cz: Změny se zruší za x sekund
da_dk: Ændringer vil tilbageføres om x sekunder
hu_hu: A változások x másodperc múlva visszaállnak
it_it: I cambiamenti saranno ripristinati tra x secondi
lt_lt: Pakeitimai bus anuliuoti po x sekundžių
nb_no: Endringer vil tilbakestilles om x sekunder
nl_nl: Wijzigingen worden teruggedraaid over x seconden
pt_br: A alteração será revertida em x segundos
pt_pt: Mudanças serão revertidas em x segundos
sv_se: Ändringar ångras om x sekunder
uk_ua: Зміни буде скасовано через x секунд

# #32009
source: Revert
cs_cz: Zrušit změny
da_dk: Tilbagestil
hu_hu: Visszaállítás
it_it: Ripristina
lt_lt: Grąžinti atgal
nb_no: Tilbakestill
nl_nl: Terugdraaien
pt_br: Reverter
pt_pt: Reverter
sv_se: Återställ
uk_ua: Скасувати

# #32010
source: Confirm
cs_cz: Potvrdit
da_dk: Bekræft
hu_hu: Megerősítés
it_it: Conferma
lt_lt: Patvirtinti
nb_no: Bekreft
nl_nl: Bevestigen
pt_br: Confirmar
pt_pt: Confirmar
sv_se: Bekräfta
uk_ua: Підтвердити

# #32011
source: Implementing change ...
cs_cz: Provádí se změna ...
da_dk: Implementere ændring ...
hu_hu: A változás végrehajtása ...
it_it: Applicazione cambiamenti...
lt_lt: Įgyvendinamas pakeitimas ...
nb_no: Implementerer endring ...
nl_nl: Wijziging doorvoeren ...
pt_br: Implementando mudança...
pt_pt: Implementando mudança ...
sv_se: Applicerar ändringar ...
uk_ua: Застосування змін...

# #32012
source: Disable RC6
lt_lt: Išjungti RC6
sv_se: Avaktivera RC6

# #32013
source: Service failed to restart.
cs_cz: Restart služby selhal.
da_dk: Genstart af tjeneste fejlede.
hu_hu: A szolgáltatás újraindítása nem sikerült.
it_it: Avvio servizio fallito.
lt_lt: Paslaugos nepavyko paleisti iš naujo.
nb_no: Omstart av tjeneste feilet.
nl_nl: Herstarten service mislukt.
pt_br: O serviço falhou ao reiniciar.
pt_pt: Serviço falhou ao reiniciar.
sv_se: Tjänsten kunde in startas om.
uk_ua: Не вдалося перезапустити службу.
