Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.updates/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_br, uk_ua

# #32148
source: Location for backup not provided.
cs_cz: Umístění zálohy nebylo nastaveno.
de_de: Sicherungsort nicht festgelegt.
hu_hu: A biztonsági mentés helye nincs beállítva.
it_it: Posizione per il backup non fornita.
lt_lt: Nenurodyta atsarginės kopijos vieta.
nb_no: Mål for sikkerhetskopi ikke oppgitt.
nl_nl: Locatie voor backup niet opgegeven.
pt_br: Local para backup não fornecido.
uk_ua: Не вказано розташування для резервного копіювання.

# #32149
source: Set the backup folder in MyOSMC.
cs_cz: Nastavte adresář pro zálohy v MyOSMC.
de_de: Sicherungsordner in My OSMC festlegen.
nl_nl: Stel de backupmap in bij MyOSMC.

# #32150
source: Insufficent diskspace at target location.
cs_cz: Nedostatek místa v cílovém úložišti.
de_de: Ungenügender Speicherplatz am Zielort.
hu_hu: Nincs elég szabad hely a megadott útvonalon.
it_it: Spazio su disco insufficente nella posizione specificata.
lt_lt: Nurodytoje vietoje nepakankama disko vieta.
nb_no: Ikke not ledig plass på mål-lokasjon.
nl_nl: Onvoldoende schijfruimte op de doellocatie.
pt_br: Espaço em disco insuficiente no local de destino.
uk_ua: У кінцевому розташуванні недостатньо місця на диску.

# #32151
source: Backup location not writeable.
cs_cz: Úložiště pro zálohy je chráněno proti zápisu.
de_de: Sicherungsort nicht beschreibbar.
hu_hu: A biztonsági mentés útvonala nem írható.
it_it: Posizione di backup non scrivibile.
lt_lt: Neįmanoma įrašyti į atsarginės kopijos vietą.
nb_no: Sikkerhetskopi lokasjon ikke skrivbar.
nl_nl: Backuplocatie is niet beschrijfbaar.
pt_br: Local de backup não gravável.
uk_ua: Помилка запису у розташування для резервних копій.

# #32152
source: Backup failed
cs_cz: Záloha selhala
de_de: Sicherung fehlgeschalgen
hu_hu: A biztonsági mentés sikertelen
it_it: Backup fallito
lt_lt: Nepavyko sukurti atsarginės kopijos
nb_no: Sikkerhetskopi feilet
nl_nl: Backup mislukt
pt_br: Falha no Backup
uk_ua: Помилка резервного копіювання

# #32153
source: Backup failed to copy the tar file.
cs_cz: Selhalo kopírování zálohy do tar souboru.
de_de: Sicherung beim Kopieren der tar-Datei fehgeschlagen.
hu_hu: A tar fájl másolása nem sikerült a biztonsági mentés során.
it_it: Backup fallito nella copia del file tar.
nb_no: Sikkerhetskopi feilet med å kopiere tar-filen.
nl_nl: Kopiëren van tar-bestand mislukt bij backup.
pt_br: O backup falhou ao tentar copiar o arquivo tar.
uk_ua: Не вдалося скопіювати tar-файл.

# #32154
source: Select a backup file
cs_cz: Vyberte soubor se zálohou
de_de: Backupdatei auswählen
hu_hu: Válasszon ki egy biztonsági mentést
it_it: Seleziona un file di backup
lt_lt: Pasirinkite atsarginės kopijos failą
nb_no: Velg en sikkerhetskopifil
nl_nl: Kies een backupbestand
pt_br: Selecione um arquivo de backup
uk_ua: Виберіть файл резервної копії

# #32155
source: Browse to backup file
cs_cz: Najděte soubor se zálohou
de_de: Nach Backupdatei durchsuchen
hu_hu: Biztonsági mentés betallózása
it_it: Cerca un file di backup
nb_no: Bla til sikkerhetskopifil
nl_nl: Blader naar backupbestand
pt_br: Busque o arquivo de backup
uk_ua: Перейти до файлу резервної копії

# #32156
source: Restore failed to copy the file.
cs_cz: Obnovení selhalo při kopírování souboru.
de_de: Wiederherstellungen am Kopieren der Datei gescheitert.
hu_hu: A visszaállítás nem tudta átmásolni a fájlt.
it_it: Ripristino fallito nella copia del file.
lt_lt: Atkūriant nepavyko nukopijuoti failo.
nb_no: Gjenoppretting feilet å kopiere fil.
nl_nl: Kopiëren van bestand mislukt bij herstel.
pt_br: A restauração falhou ao copiar o arquivo.
uk_ua: Не вдалося скопіювати файл під час відновлення.

# #32157
source: Could not identify contents of backup file.
cs_cz: Nelze rozpoznat obsah záložního souboru.
de_de: Inhalte der Sicherungsdatei konnten nicht festgestellt werden.
hu_hu: Nem ismerhető fel a biztonsági mentési fájl tartalma.
it_it: Impossibile identificare contenuto del file di backup.
lt_lt: Nepavyko nustatyti atsarginės kopijos failo turinio.
nb_no: Kunne ikke identifisere innhold av sikkerhetskopifil.
nl_nl: Kon de inhoud van het backupbestand niet identificeren.
pt_br: Não foi possível identificar o conteúdo do arquivo de backup.
uk_ua: Не вдалося визначити вміст файлу резервної копії.

# #32158
source: Items successfully restored
cs_cz: Položky byly úspěšně obnoveny
de_de: Elemente erfolgreich wiederhergestellt
hu_hu: Az elemek sikeresen visszaállítva
it_it: Elementi ripristinati con successo
lt_lt: Elementai sėkmingai atkurti
nb_no: Elementer gjenopprettet
nl_nl: Items succesvol hersteld
pt_br: Itens restaurados com sucesso
uk_ua: Елементи успішно відновлено

# #32159
source: Starting backup
cs_cz: Záloha začíná
de_de: Sicherung beginnen
hu_hu: Biztonsági mentés indítása
it_it: Avvio backup
lt_lt: Pradedamas atsarginė kopijos kūrimas
nb_no: Starter sikkerhetskopi
nl_nl: Start met backup
pt_br: Iniciando backup
uk_ua: Початок резервного копіювання

# #32160
source: Transferring backup file
cs_cz: Přesun záložního souboru
de_de: Sicherungsdatei übertragen
hu_hu: A biztonsági mentés fájljának átvitele
it_it: Trasferimento file backup
lt_lt: Perkeliamas atsarginės kopijos failas
nb_no: Overfører sikkerhetskopifil
nl_nl: Overzetten backupbestand
pt_br: Transferindo arquivo de backup
uk_ua: Передача файлу резервної копії

# #32161
source: Removing old backup file: %s
cs_cz: Vymazání starých záložních souborů: %s
de_de: Alte Sicherungsdatei entfernen: %s
hu_hu: Régi biztonsági másolat eltávolítása: %s
it_it: Rimozione vecchio file di backup: %s
lt_lt: Pašalinamas senas atsarginės kopijos failas: %s
nb_no: Fjerner gammel sikkerhetskopifil: %s
nl_nl: Verwijderen oud backupbestand: %s
pt_br: Removendo arquivo de backup antigo: %s
uk_ua: Видалення старого файлу резервної копії: %s

# #32162
source: Select items to restore
cs_cz: Vyberte položky pro obnovení
de_de: Wiederherzustellende Elemente auswählen
hu_hu: Válassza ki a visszaállítani kívánt elemeket
it_it: Seleziona elementi da ripristinare
lt_lt: Pasirinkite elementus, kuriuos norite atkurti
nb_no: Velg elementer å gjenopprette
nl_nl: Kies items voor herstel
pt_br: Selecione os itens para restaurar
uk_ua: Виберіть елементи для відновлення

# #32163
source: Overwrite existing files
cs_cz: Přepsat existující soubory
de_de: Bestehende Dateien überschreiben
hu_hu: A meglévő fájlok felülírása
it_it: Sovrascrivi file esistenti
lt_lt: Perrašyti esamus failus
nb_no: Overskriv eksisterende filer
nl_nl: Overschrijf bestaande bestanden
pt_br: Sobrescrever arquivos existentes
uk_ua: Перезаписати наявні файли

# #32164
source: Select new restore folder
cs_cz: Vyberte nový adresář pro obnovení
de_de: Neuen Wiederherstellungsordner auswählen
hu_hu: Válassza ki az új visszaállítási mappát
it_it: Seleziona nuova cartella ripristino
lt_lt: Pasirinkite naują atkūrimo aplanką
nb_no: Velg ny gjenopprettingsmappe
nl_nl: Kies nieuwe herstelfolder
pt_br: Selecione uma nova pasta de restauração
uk_ua: Вибрати нову папку для відновлення

# #32165
source: Browse to restore location
cs_cz: Vyhledejte úložiště se zálohou
de_de: Nach Wiederherstellungsort durchsuchen
hu_hu: Visszaállítási hely betallózása
it_it: Cerca cartella di ripristino
nb_no: Bla til gjenopprettingslokasjon
nl_nl: Blader naar herstellocatie
pt_br: Navegue para o local da restauração
uk_ua: Перейти до розташування для відновлення

# #32166
source: Addons Folder
cs_cz: Adresář doplňků
de_de: Addon-Ordner
hu_hu: Kiegészítők mappája
it_it: Cartella Addon
lt_lt: Priedų aplankas
nb_no: Mappe for utvidelser
nl_nl: Add-ons map
pt_br: Pasta de Addons
uk_ua: Папка надбудов

# #32167
source: Addon Data Folder
cs_cz: Adresář dat doplňků
de_de: Addon-Daten-Ordner
hu_hu: Kiegészítők adat-mappája
it_it: Cartella Dati Addon
lt_lt: Addon duomenų aplankas
nb_no: Data-mappe for utvidelser
nl_nl: Add-on datamap
pt_br: Pasta dos Dados de Addons
uk_ua: Папка даних надбудов

# #32168
source: Database Folder
cs_cz: Adresář databáze
de_de: Datenbank-Ordner
hu_hu: Adatbázisok mappája
it_it: Cartella Database
lt_lt: Duomenų bazės aplankas
nb_no: Mappe for database
nl_nl: Databasemap
pt_br: Pasta do Banco de Dados
uk_ua: Папка бази даних

# #32169
source: Keymaps Folder
cs_cz: Adresář mapování kláves
de_de: Tastenzuordnungs-Ordner
hu_hu: Billentyűtérképek mappája
it_it: Cartella Mappe Caratteri
nb_no: Mappe for tastaturer
nl_nl: Keymaps-map
pt_br: Pasta de Keymaps
uk_ua: Папка розкладок

# #32170
source: Library Folder
cs_cz: Adresář knihovny
de_de: Bibliotheks-Ordner
hu_hu: Médiakönyvtár mappája
it_it: Cartella Libreria
lt_lt: Bibliotekos aplankas
nb_no: Mappe for bibliotek
nl_nl: Bibliotheekmap
pt_br: Pasta de Biblioteca
uk_ua: Папка медіатеки

# #32172
source: Playlists Folder
cs_cz: Adresář playlistu
de_de: Wiedergabelisten-Ordner
hu_hu: Lejátszási listák mappája
it_it: Cartella Playlist
lt_lt: Grojaraščių aplankas
nb_no: Mappe for spillelister
nl_nl: Afspeellijstenmap
pt_br: Pasta de Playlists
uk_ua: Папка списків відтворення

# #32173
source: Profiles Folder
cs_cz: Adresář profilů
de_de: Profile-Ordner
hu_hu: Profilok mappája
it_it: Cartella Profili
lt_lt: Profilių aplankas
nb_no: Mapper for profiler
nl_nl: Profielenmap
pt_br: Pasta de Perfis
uk_ua: Папка профілів

# #32174
source: Thumbnails Folder (very large)
cs_cz: Adresář náhledů (velmi velké)
de_de: Miniaturansichten-Ordner (sehr groß)
hu_hu: Miniatűrök mappája (nagy méretű)
it_it: Cartella Miniature (molto grande)
lt_lt: Miniatiūrų aplankas (labai didelis)
nb_no: Mappe for miniatyrbilder (veldig stor)
nl_nl: Miniaturenmap (erg groot)
pt_br: Pasta de Miniaturas (muito grande)
uk_ua: Папка ескізів (дуже велика)

# #32175
source: Save States Folder
cs_cz: Adresář uložených stavů her
de_de: Speicherstands-Ordner
hu_hu: Állapotmentések mappája
it_it: Cartella Salvataggi
lt_lt: Išsaugojimo būsenų aplankas
nb_no: Mappe for å lagre status
nl_nl: Tussentijdse staat-map
pt_br: Pasta de Estados Salvos
uk_ua: Папка збережених станів

# #32176
source: Tvheadend Folder
cs_cz: Adresář TVheadendu
de_de: Tvheadend-Ordner
hu_hu: Tvheadend mappája
it_it: Cartella Tvheadend
lt_lt: Tvheadend aplankas
nb_no: Mappe for Tvheadend
nl_nl: Tvheadend-map
pt_br: Pasta Tvheadend
uk_ua: Папка Tvheadend

# #32178
source: Authorized SSH Keys
cs_cz: Autorizované klíče SSH
de_de: Autorisierte SSH-Schlüssel
hu_hu: Engedélyezett SSH-kulcsok
it_it: Chiavi SSH Autorizzate
lt_lt: Autorizuoti SSH raktai
nb_no: Autoriserte SSH-nøkler
nl_nl: Geautoriseerde SSH-sleutels
pt_br: Chaves SSH Autorizadas
uk_ua: Авторизовані ключі SSH

# #32179
source: Addons
cs_cz: Doplňky
hu_hu: Kiegészítők
it_it: Addon
lt_lt: Priedai
nb_no: Utvidelser
uk_ua: Надбудови

# #32180
source: Addon Data
cs_cz: Data doplňků
de_de: Addon-Daten
hu_hu: Kiegészítők adatai
it_it: Dati Addon
lt_lt: Priedo duomenys
nb_no: Utvidelse-data
pt_br: Dados de Addon
uk_ua: Дані надбудов

# #32181
source: Database
cs_cz: Databáze
de_de: Datenbank
hu_hu: Adatbázis
lt_lt: Duomenų bazė
pt_br: Banco de Dados
uk_ua: База даних

# #32182
source: Keymaps
cs_cz: Mapování kláves
de_de: Tastenzuordnungen
hu_hu: Billentyűtérképek
it_it: Mappa Caratteri
nb_no: Tastatur
uk_ua: Розкладки

# #32183
source: Library
cs_cz: Knihovna
de_de: Bibliothek
hu_hu: Médiakönyvtár
it_it: Libreria
lt_lt: Biblioteka
nb_no: Bibliotek
nl_nl: Bibliotheek
pt_br: Biblioteca
uk_ua: Медіатека

# #32184
source: Playlists
cs_cz: Seznam pro přehrátí
de_de: Wiedergabelisten
hu_hu: Lejátszási listák
it_it: Playlist
lt_lt: Grojaraščiai
nb_no: Spillelister
nl_nl: Afspeellijsten
uk_ua: Списки відтворення

# #32185
source: Profiles
cs_cz: Profily
de_de: Profile
hu_hu: Profilok
it_it: Profili
lt_lt: Profiliai
nb_no: Profiler
nl_nl: Profielen
pt_br: Perfis
uk_ua: Профілі

# #32186
source: Thumbnails
cs_cz: Náhledy
de_de: Miniaturansichten
hu_hu: Miniatűrök
it_it: Miniature
lt_lt: Miniatiūros
nb_no: Miniatyrbilder
nl_nl: Miniaturen
pt_br: Miniaturas
uk_ua: Ескізи

# #32187
source: Save States
cs_cz: Uložené stavy her
de_de: Speicherstände
hu_hu: Állapotmentések
it_it: Salvataggi
lt_lt: Išsaugojimo būsenos
nb_no: Lagre status
nl_nl: Tussentijdse staat
pt_br: Estados Salvos
uk_ua: Збережені стани

# #32189
source: Directory
cs_cz: Adresář-
de_de: Verzeichnis-
hu_hu: Könyvtár
it_it: Cartella
lt_lt: Aplankas
nb_no: Katalog
nl_nl: Map-
pt_br: Diretório
uk_ua: Папка

# #32190
source: Mixed
cs_cz: Smíšené
de_de: Gemischt
hu_hu: Vegyes
it_it: Misto
lt_lt: Mišrus
nb_no: Blandet
nl_nl: Gemengd
pt_br: Misturado
uk_ua: Змішаний

# #32191
source: File
cs_cz: Soubor
de_de: Datei
hu_hu: Fájl
lt_lt: Failas
nb_no: Fil
nl_nl: Bestand
pt_br: Arquivo
uk_ua: Файл

# #32065
source: Only show prompts on the home screen
hu_hu: Csak a kezdőképernyőn jelenítse meg az utasításokat
it_it: Chiedi conferma solo sulla schermata Home
lt_lt: Rodyti perklausimą tik pradiniame ekrane
pt_br: Somente exibir diálogos na tela inicial
uk_ua: Лише показати підказку на головному екрані

# #32149
source: Set the backup folder in My OSMC.
hu_hu: Állítsa be a biztonsági mentési mappát a My OSMC-ben.
it_it: Imposta cartella backup in My OSMC.
lt_lt: Nustatykite atsarginės kopijos aplanką My OSMC programoje.
pt_br: Defina a pasta de backup em My OSMC.
uk_ua: Вкажіть папку для резервного копіювання у My OSMC.
