Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.updates/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_br, uk_ua

# #32095
source: Download updates, then prompt
cs_cz: Stáhnout aktualizace a poté upozornit
de_de: Updates herunterladen, dann auffordern
hu_hu: Frissítések letöltése, majd rákérdezés a folytatásra
it_it: Scarica gli aggiornamenti, poi chiedi cosa fare
lt_lt: Atsisiųsti naujinimus, tada perklausti
nb_no: Last ned oppdateringer, spør deretter
nl_nl: Download updates, vraag dan
pt_br: Baixar atualizações, depois perguntar
uk_ua: Завантажити оновлення, а потім запитати

# #32096
source: Backup
cs_cz: Záloha
de_de: Sicherung
hu_hu: Biztonsági mentés
lt_lt: Atsarginė kopija
nb_no: Sikkerhetskopi
uk_ua: Резервне копіювання

# #32097
source: Backup error. Details in log.
cs_cz: Chyba zálohování. Podrobnosti v logu.
de_de: Sicherungsfehler. Details im Log.
hu_hu: Biztonsági mentési hiba. Részletek a naplóban.
it_it: Errore di backup. Dettagli nel log.
lt_lt: Atsarginės kopijos klaida. Išsami informacija žurnale.
nb_no: Sikkerhetskopi feilet. Detaljer kan sees i logg.
nl_nl: Backupfout. Details in log.
pt_br: Erro no backup. Detalhes no log.
uk_ua: Помилка резервного копіювання. Подробиці див. у журналі.

# #32098
source: Items successfully restored.
cs_cz: Položky byly úspěšně obnoveny.
de_de: Elemente erfolgreich wiederhergestellt.
hu_hu: Az elemek sikeresen visszaállítva.
it_it: Elemento ripristinato con successo.
lt_lt: Elementai sėkmingai atkurti.
nb_no: Elementer ble gjenopprettet.
nl_nl: Items succesvol hersteld.
pt_br: Itens restaurados com sucesso.
uk_ua: Елементи успішно відновлено.

# #32099
source: Restoring guisettings.xml requires Kodi to restart.
cs_cz: Obnovení souboru guisettings.xml vyžaduje restart Kodi.
de_de: Das Wiederherstellen der guisettings.xml erfordert das Neustarten von Kodi.
hu_hu: A guisettings.xml visszaállításához újra kell indítani a Kodit.
it_it: Ripristinare guisettings.xml richiede il riavvio di Kodi.
lt_lt: Norint atkurti guisettings.xml, reikia iš naujo paleisti Kodi.
nb_no: Gjenoppretting av guisettings.xml krever omstart av Kodi.
nl_nl: Herstellen van guisettings.xml vereist een Kodi herstart.
pt_br: Restaurar o guisettings.xml requere reinicialização.
uk_ua: Для відновлення guisettings.xml потрібно перезапустити Kodi.

# #32100
source: Restart Now
cs_cz: Restartovat ihned
de_de: Jetzt neustarten
hu_hu: Újraindítás most
it_it: Riavvia Adesso
lt_lt: Paleisti iš naujo dabar
nb_no: Restart nå
nl_nl: Nu herstarten
pt_br: Reinicializar Agora
uk_ua: Перезавантажити зараз

# #32101
source: Restart Later
cs_cz: Restartovat později
de_de: Später neustarten
hu_hu: Újraindítás később
it_it: Riavvia Dopo
lt_lt: Paleisti iš naujo vėliau
nb_no: Restart seinere
nl_nl: Later herstarten
pt_br: Reinicializar Depois
uk_ua: Перезавантажити пізніше

# #32102
source: Error
cs_cz: Chyba
de_de: Fehler
hu_hu: Hiba
it_it: Errore
lt_lt: Klaida
nb_no: Feil
nl_nl: Fout
pt_br: Erro
uk_ua: Помилка

# #32103
source: Unsupported Alphas cannot be upgraded.
cs_cz: Nepodporované Alfa verze nemohou být aktualizovány.
de_de: Nicht unterstützte Alphas können nicht upgegradet werden.
hu_hu: A nem támogatott Alfa-verziók nem frissíthetők.
it_it: Le Alpha non supportate non possono essere aggiornate.
lt_lt: Nepalaikomų alfa versijų naujovinti negalima.
nb_no: Alpha-versjoner som ikke er støttet kan ikke oppgraderes.
nl_nl: Niet-ondersteunde alphas kunnen niet worden bijgewerkt.
pt_br: Alphas não suportados não podem ser atualizados.
uk_ua: Непідтримувані альфа-версії не можна оновити.

# #32104
source: Please install the latest version of OSMC.
cs_cz: Prosím nainstalujte poslední verzi OSMC.
de_de: Bitte die neueste OSMC-Version installieren.
hu_hu: Kérjük telepítse az OSMC legújabb verzióját.
it_it: Installa l'ultima versione di OSMC.
lt_lt: Įdiekite naujausią OSMC versiją.
nb_no: Vennligst installer siste versjon av OSMC.
nl_nl: Installeer svp de laatste versie van OSMC.
pt_br: Por favor instale a última versão do OSMC.
uk_ua: Встановіть останню версію OSMC.

# #32105
source: Run Backup of settings now.
cs_cz: Spustit nyní zálohu nastavení.
de_de: Einstellungssicherung jetzt erstellen.
hu_hu: A beállítások biztonsági mentésének futtatása most.
it_it: Esegui un backup delle impostazioni adesso.
lt_lt: Sukurti atsarginę nustatymų kopiją dabar.
nb_no: Kjør sikkerhetskopiering av innstillinger nå.
nl_nl: Maak nu een backup van de instellingen.
pt_br: Realizar Backup das configurações agora.
uk_ua: Зробити резервну копію налаштувань зараз.

# #32106
source: Restore a backup of settings now.
cs_cz: Obnovit nyní zálohu nastavení.
de_de: Einstellungssicherung jetzt wiederherstellen.
hu_hu: A beállítások egy biztonsági mentésének visszaállítása most.
it_it: Ripristina un backup delle impostazioni adesso.
lt_lt: Atkurti nustatymus iš atsarginės kopijos dabar.
nb_no: Gjenopprett sikkerhetskopi av innstillinger nå.
nl_nl: Herstel nu een backup van de instellingen.
pt_br: Restaurar as configurações do backup agora.
uk_ua: Відновити резервну копію налаштувань зараз.

# #32107
source: Backup before each update (excludes manual update).
cs_cz: Provést zálohu před každou aktualizací (kromě ruční aktualizace).
de_de: Vor jedem Update sichern (schließt keine manuellen Updates ein).
hu_hu: Biztonsági mentés készítése minden frissítés előtt (kivéve a kézi frissítést).
it_it: Backup prima di ogni aggiornamento (esclusi aggiornamenti manuali).
lt_lt: Sukurti atsarginę kopiją prieš kiekvieną naujinimą (išskyrus rankinį naujinimą).
nb_no: Lag en sikkerhetskopi før hver oppdatering (utelukker manuelle oppdateringer).
nl_nl: Backup voor elke update (behalve handmatige update).
pt_br: Realizar backup antes de cada atualização (com exceção das manuais).
uk_ua: Робити копію перед кожним оновленням (за винятком оновлення вручну).

# #32108
source: Number of backup files to keep (0 for keep all)
cs_cz: Počet uchovávaných souborů se zálohou (0 zachovat vše)
de_de: Anzahl der zu behaltenden Sicherungsdateien (0 für das Behalten aller)
hu_hu: Megőrzendő biztonsági mentési fájlok száma (0 = az összes megtartása)
it_it: Numero dei file di backup da mantenere (0 per tenerli tutti)
lt_lt: Saugomų atsarginių kopijų failų skaičius (0, jei norite saugoti visus)
nb_no: Antall sikkerhetskopier å beholde (0 for å beholde alle)
nl_nl: Aantal backupbestanden om te behouden (0 voor alle)
pt_br: Quantidade de arquivos de backup para manter (0 para todos)
uk_ua: Кількість копій для зберігання (0 — зберігати всі)

# #32109
source: Backups
cs_cz: Zálohy
de_de: Sicherungen
hu_hu: Biztonsági mentések
it_it: Backup
lt_lt: Atsarginės kopijos
nb_no: Sikkerhetskopier
uk_ua: Резервні копії

# #32110
source: OSMC Restore
cs_cz: Obnovení OSMC
de_de: OSMC-Wiederherstellung
hu_hu: OSMC visszaállítás
it_it: Ripristino di OSMC
lt_lt: OSMC atkūrimas
nb_no: OSMC gjenopprett
pt_br: Restauração do OSMC
uk_ua: Відновлення OSMC

# #32111
source: Minute
cs_cz: Minut
hu_hu: Perc
it_it: Minuto
lt_lt: Minutė
nb_no: Minutt
nl_nl: Minuut
uk_ua: Хвилина

# #32112
source: Some packages were not installed/removed.
cs_cz: Některé balíčky nebyly nainstalovány/odebrány.
de_de: Einige Pakete sind nicht installiert/entfernt worden.
hu_hu: Egyes csomagok nem lettek telepítve/eltávolítva.
it_it: Alcuni pacchetti non sono stati installati/rimossi.
lt_lt: Kai kurie paketai nebuvo įdiegti/pašalinti.
nb_no: Noen pakker ble ikke installert/fjernet.
nl_nl: Sommige pakketten zijn niet geïnstalleerd/verwijderd.
pt_br: Alguns pacotes não foram instalados/removidos.
uk_ua: Деякі пакунки не були встановлені/видалені.

# #32113
source: Details have been written to the Kodi log.
cs_cz: Podrobnosti budou zapsány do Kodi logu.
de_de: Details sind in das Kodi-Log geschrieben worden.
hu_hu: A részletek bekerültek a Kodi naplójába.
it_it: I dettagli sono stati scritti nel log di Kodi.
lt_lt: Išsami informacija buvo įrašyta į Kodi žurnalą.
nb_no: Mer informasjon har blitt skrevet til kodi-logg.
nl_nl: Details zijn weggeschreven in het Kodi log.
pt_br: Os detalhes foram escritos no log do Kodi.
uk_ua: Подробиці були записані в журнал Kodi.

# #32114
source: Apply HotFix
cs_cz: Použít HotFix
de_de: Hotfix anwenden
hu_hu: Gyorsjavítás alkalmazása
it_it: Applica HotFix
lt_lt: Pritaikyti karštąją pataisą
nb_no: Legg til HotFix
nl_nl: Hotfix toepassen
pt_br: Aplicar HotFix
uk_ua: Застосувати виправлення

# #32115
source: Enter HotFix ID
cs_cz: Vložit HotFix ID
de_de: Hotfix-ID eingeben
hu_hu: Írja be a gyorsjavítás azonosítóját
it_it: Inserisci ID Hotfix
lt_lt: Įveskite karštosios pataisos ID
nb_no: Skriv inn HotFix ID
nl_nl: Voer hotfix-ID in
pt_br: Insira o ID do HotFix
uk_ua: Введіть ідентифікатор виправлення

# #32116
source: OSMC HotFix
cs_cz: HotFix OSMC
hu_hu: OSMC gyorsjavítás
it_it: HotFix OSMC
lt_lt: OSMC karštoji pataisa
pt_br: HotFix do OSMC
uk_ua: Виправлення OSMC

# #32117
source: HotFixes run commandline code on your device.
cs_cz: HotFixy spouští na vašem zařízení kód přes příkazový řádek.
de_de: Hotfixes führen Kommandozeilencode auf Ihrem Gerät aus.
hu_hu: A gyorsjavítások parancssori kódot futtatnak az eszközön.
it_it: Gli HotFix eseguono comandi sul tuo dispositivo.
lt_lt: Karštosios pataisos paleidžia komandinės eilutės kodą jūsų įrenginyje.
nb_no: Hotfix'er kjører kommandolinje kode på din enhet.
nl_nl: Hotfixes draaien opdrachtregel-code op je apparaat.
pt_br: Os HotFixes executam linhas de comandos em seu dispositivo.
uk_ua: Виправлення виконує певний код на вашому пристрої.

# #32118
source: Only use Hotfixes provided by people you trust.
cs_cz: Používejte pouze HotFixy od důvěryhodných lidí.
de_de: Nutzen Sie nur Hotfixes von vertrauten Personen.
hu_hu: Csak olyan gyorsjavításokat alkalmazzon, amelyekben megbízik.
it_it: Usa solo gli HotFix messi a disposizione da persone di cui ti fidi.
lt_lt: Karštąsias pataisas naudokite tik gautas iš žmonių, kuriais pasitikite.
nb_no: Kun bruk Hotfix'er levert av mennesker du stoler på.
nl_nl: Gebruik alleen hotfixes van mensen die je vertrouwt.
pt_br: Use apenas Hotfixes fornecidos por pessoas em quem você confia.
uk_ua: Використовуйте лише виправлення від людей, яким ви довіряєте.

# #32119
source: Are you sure you would like to apply this HotFix?
cs_cz: Jste si jistý, že chcete použít tento HotFix?
de_de: Sind Sie sicher, dass Sie diesen Hotfix anwenden wollen?
hu_hu: Biztos benne, hogy alkalmazni szeretné ezt a gyorsjavítást?
it_it: Sicuro di voler applicare questo HotFix?
lt_lt: Ar tikrai norite pritaikyti šią karštąją pataisą?
nb_no: Er du sikker på at du vil bruke denne Hotfix'en?
nl_nl: Weet je zeker dat je deze hotfix wilt toepassen?
pt_br: Tem certeza de que deseja aplicar este HotFix?
uk_ua: Дійсно застосувати це виправлення?

# #32120
source: OSMC HotFix Uploader
cs_cz: Odeslání OSMC HotFixu
hu_hu: OSMC gyorsjavítás feltöltő
it_it: Uploader HotFix OSMC
lt_lt: OSMC karštosios pataisos įkėlimo priemonė
nb_no: OSMC HotFix opplaster
pt_br: Uploader de HotFix do OSMC
uk_ua: Завантажувач виправлень OSMC

# #32121
source: HotFix Upload failed.
cs_cz: Odeslání HotFixu selhalo.
de_de: Hotfix-Hochladen fehlgeschlagen.
hu_hu: A gyorsjavítás feltöltése sikertelen.
it_it: Invio HotFix fallito.
lt_lt: Karštosios pataisos įkėlimas nepavyko.
nb_no: HotFix opplasting feilet.
nl_nl: Hotfix upload mislukt.
pt_br: Upload de HotFix falhou.
uk_ua: Не вдалося завантажити виправлення.

# #32122
source: Save the output to SD card?
cs_cz: Uložit výstup na SD kartu?
de_de: Die Ausgabe auf einer SD-Karte speichern?
hu_hu: Menti a kimenetet az SD-kártyára?
it_it: Salvare l'output sulla scheda SD?
lt_lt: Išsaugoti išvestį SD kortelėje?
nb_no: Lagre resultatet til SD-kort?
nl_nl: Output opslaan op SD kaart?
pt_br: Gravar resultados no cartão SD?
uk_ua: Зберегти вихідні дані на SD-карту?

# #32123
source: HotFix output successfully uploaded.
cs_cz: Výstup HotFixu byl úspěšně odeslán.
de_de: Hotfix-Ausgabe erfolgreich hochgeladen.
hu_hu: A gyorsjavítás kimenete sikeresen feltöltve.
it_it: Output dell'HotFix inviato correttamente.
lt_lt: Karštosios pataisos išvestis sėkmingai įkelta.
nb_no: HotFix resultat lastet opp.
nl_nl: Hotfix output succesvol geupload.
pt_br: Upload do resultado do HotFix realizado com sucesso.
uk_ua: Вихідні дані виправлення були успішно завантажені.

# #32124
source: Cancel
cs_cz: Zrušit
de_de: Abbrechen
hu_hu: Visszavonás
it_it: Annulla
lt_lt: Atšaukti
nb_no: Avbryt
nl_nl: Annuleren
pt_br: Cancelar
uk_ua: Скасувати

# #32125
source: Proceed
cs_cz: Pokračovat
de_de: Fortsetzen
hu_hu: Folytatás
it_it: Procedi
lt_lt: Tęsti
nb_no: Fortsett
nl_nl: Doorgaan
pt_br: Avançar
uk_ua: Продовжити

# #32126
source: Visit osmc.tv/blog for more details.
cs_cz: Pro podrobnosti navštivte osmc.tv/blog.
de_de: osmc.tv/blog für weitere Details besuchen.
hu_hu: További részletekért látogasson el az osmc.tv/blog oldalra.
it_it: Visita osmc.tv/blog per maggiori dettagli.
lt_lt: Norėdami gauti daugiau informacijos, apsilankykite osmc.tv/blog.
nb_no: Besøk osmc.tv/blog for mer informasjon.
nl_nl: Ga naar osmc.tv/blog voor meer details.
pt_br: Visite osmc.tv/blog para mais detalhes.
uk_ua: Додаткові відомості шукайте на веб-сайті osmc.tv/blog.

# #32127
source: Major updates may cause addon and database incompatibility.
cs_cz: Velká aktualizace může způsobit nekompatibilitu doplňků a databáze.
de_de: Große Updates können Addon- und Datenbank-Inkompatibilitäten verursachen.
hu_hu: A nagyobb frissítések a kiegészítők és az adatbázisok inkompatibilitásához vezethetnek.
it_it: Gli aggiornamenti importanti possono causare incompatibilità agli addon o al database.
lt_lt: Dėl pagrindinių atnaujinimų gali atsirasti priedų ir duomenų bazės nesuderinamumas.
nb_no: Hovedoppdateringer kan medføre at utvidelser og database ikke er kompatibel.
nl_nl: Grote updates kunnen leiden tot addon- en database incompatibiliteit.
pt_br: As atualizações major podem causar incompatibilidade de addons e banco de dados.
uk_ua: Серйозні оновлення можуть призвести до несумісності надбудов з базою даних.

# #32128
source: Detected major update for Kodi.
cs_cz: Zjištěna Velká aktualizace pro Kodi.
de_de: Großes Update for Kodi gefunden.
hu_hu: Jelentős frissítés észlelve a Kodi-hoz.
it_it: Rilavato aggiornamento importante per Kodi.
lt_lt: Aptiktas pagrindinis Kodi atnaujinimas.
nb_no: Oppdag hovedoppdatering for Kodi.
nl_nl: Grote update voor Kodi gevonden.
pt_br: Atualização major detectada para o Kodi.
uk_ua: Знайдено серйозне оновлення для Kodi.

# #32129
source: Insufficient space for Update to proceed.
cs_cz: Nedostatek místa pro pokračování aktualizace.
de_de: Ungenügender Platz für das Fortsetzen des Updates.
hu_hu: Nincs elegendő szabad hely a frissítés folytatásához.
it_it: Spazio insufficiente per effettuare l'Aggiornamento.
lt_lt: Nepakanka vietos, kad būtų galima tęsti naujinimą.
nb_no: Ikke nok ledig plass for at oppdateringen kan fortsette.
nl_nl: Onvoldoende ruimte om de update uit te voeren.
pt_br: Espaço insuficiente para atualização.
uk_ua: На диску недостатньо місця для оновлення.

# #32130
source: Free some storage space and try again later.
cs_cz: Uvolněte místo v úložišti a zkuste to znovu později.
de_de: Einigen Speicherplatz freigeben und später erneut versuchen.
hu_hu: Szabadítson fel helyet, és próbálja meg újra később.
it_it: Libera un po' di spazio di memorizzazione e riprova più tardi.
lt_lt: Atlaisvinkite saugyklos vietos ir bandykite dar kartą.
nb_no: Frigjør lagringsplass og prøv igjen seinere.
nl_nl: Maak wat ruimte vrij en probeer het opnieuw.
pt_br: Libere espaço de armazenamento e tente novamente.
uk_ua: Звільніть місце на диску та повторіть спробу.

# #32131
source: Unable to connect to the Update servers.
cs_cz: Není možné se připojit k serveru s aktualizacemi.
de_de: Keine Verbindung zum Updateserver möglich.
hu_hu: Nem sikerült csatlakozni a frissítési kiszolgálókhoz.
it_it: Impossibile connettersi al server degli aggiornamenti.
lt_lt: Nepavyko prisijungti prie naujinimo serverių.
nb_no: Ikke i stand å koble til oppdateringsservere.
nl_nl: Niet gelukt om updateservers te bereiken.
pt_br: Não foi possível conectar aos servidores de atualização.
uk_ua: Не вдається підключитись до серверів оновлення.

# #32132
source: Please try again later.
cs_cz: Prosím zkuste to znovu později.
de_de: Später erneut versuchen.
hu_hu: Próbálkozzon újra később.
it_it: Riprova più tardi.
lt_lt: Pabandykite dar kartą vėliau.
nb_no: Vennligst prøv igjen seinere.
nl_nl: Probeer het later opnieuw.
pt_br: Tente novamente mais tarde.
uk_ua: Повторіть спробу пізніше.

# #32133
source: The installed program requires a restart.
cs_cz: Nainstalované programy vyžadují restart.
de_de: Das installierte Program erfordert einen Neustart.
hu_hu: A telepített program újraindítást igényel.
it_it: Il programma installato necessita di un riavvio.
nb_no: Det installerte programmet krever omstart.
nl_nl: Het geïnstalleerde programma vereist een herstart.
pt_br: O programa instalado requer reinicialização.
uk_ua: Для встановленої програми необхідно перезавантажити систему.

# #32134
source: Reset Kodi on next reboot
cs_cz: Resetování Kodi při příštím restartu
de_de: Kodi beim nächsten Neustart zurücksetzen
hu_hu: A Kodi alaphelyzetbe állítása a következő újraindításkor
it_it: Ripristina Kodi al prossimo riavvio
lt_lt: Iš naujo nustatyti Kodi kito paleidimo metu
nb_no: Nullstill Kodi ved neste omstart
nl_nl: Reset Kodi bij volgende herstart
pt_br: Resetar Kodi na próxima reinicialização
uk_ua: Скинути налаштування Kodi під час наступного перезавантаження

# #32135
source: [COLOR red]Warning: This will delete ALL user data in Kodi; skins, addons, databases, settings, etc.[/COLOR]
cs_cz: [COLOR red]Varování: Toto vymaže VŠECHNA uživatelská data v Kodi; vzhledy, doplňky, databáze, nastavení atd. [/ COLOR]
de_de: [COLOR red]Warnung: Dies wird ALLE Kodi-Nutzerdaten löschen; Skins, Addons, Datenbanken, Einstellungen, etc.[/COLOR]
hu_hu: [COLOR red]Figyelmeztetés: Ezzel törli az ÖSSZES felhasználói adatot a Kodiban; felületek, kiegészítők, adatbázisok, beállítások, stb.[/COLOR]
it_it: [COLOR red]Attenzione: Questo cancellerà TUTTI i dati utente in Kodi; skin, addon, database, impostazioni, ecc.[/COLOR]
lt_lt: [COLOR red]Įspėjimas: tai ištrins VISUS Kodi vartotojo duomenis, odas, priedus, duomenų bazes, nustatymus ir kt.[/COLOR]
nb_no: [COLOR red]Advarsel: Dette vil slette alle brukerdata til Kodi, drakter, utvidelser, databaser, innstillinger osv.[/COLOR]
nl_nl: [COLOR red]Waarschuwing: dit verwijdert ALLE gebruikersdata in Kodi; skins, add-ons, databases, instellingen, etc.[/COLOR]
pt_br: [COLOR red]Aviso: Isso excluirá TODOS os dados de usuário no Kodi; skins, addons, bancos de dados, configurações, etc. [/ COLOR]
uk_ua: [COLOR red]Попередження: при цьому буде видалено ВСІ дані користувача в Kodi: обкладинки, надбудови, бази даних, налаштування тощо.[/COLOR]

# #32137
source: Update not permitted.
cs_cz: Aktualizace není povolena.
de_de: Update nicht zugelassen.
hu_hu: A frissítés nem engedélyezett.
it_it: Aggiornamento non permesso.
lt_lt: Atnaujinti neleidžiama.
nb_no: Oppdatere ikke tillatt.
nl_nl: Update niet toegestaan.
pt_br: Atualização não permitida.
uk_ua: Оновлення заборонено.

# #32138
source: Unable to reach internet.
cs_cz: Nedostupný internet.
de_de: Keine Internetverbindung.
hu_hu: Nem lehet csatlakozni az internethez.
it_it: Impossibile connettersi ad internet.
lt_lt: Nepavyko prisijungti prie interneto.
nb_no: Ikke i stand å koble til Internett.
nl_nl: Internet niet bereikbaar.
pt_br: Não foi possível alcançar a internet.
uk_ua: Не вдається підключитись до Інтернету.

# #32139
source: Restore
cs_cz: Obnovení
de_de: Wiederherstellen
hu_hu: Visszaállítás
it_it: Ripristina
lt_lt: Atkurti
nb_no: Gjenopprett
nl_nl: Herstellen
pt_br: Restaurar
uk_ua: Відновити

# #32140
source: Some items failed to restore.
cs_cz: Chyba při obnovení některých položek.
de_de: Einige Elemente konnten nicht wiederhergestellt werden.
hu_hu: Néhány elemet nem sikerült visszaállítani.
it_it: Alcuni elementi non sono stati ripristinati.
lt_lt: Kai kurių elementų nepavyko atkurti.
nb_no: Noen elementer kunne ikke bli gjenopprettet.
nl_nl: Sommige items konden niet hersteld worden.
pt_br: A restauração de alguns itens falhou.
uk_ua: Деякі елементи не вдалося відновити.

# #32141
source: See log for details.
cs_cz: Pro podrobnosti zkontrolujte log.
de_de: Siehe Logs für Details.
hu_hu: Nézze meg a naplót a részletekért.
it_it: Vedi log per dettagli.
lt_lt: Daugiau informacijos rasite žurnale.
nb_no: Se logg for detaljer.
nl_nl: Zie log voor details.
pt_br: Veja o log para detalhes.
uk_ua: Подробиці див. у журналі.

# #32142
source: Your system is running out of storage (<%sMB left).
cs_cz: Váš systém pracuje s nedostatkem místa (zbývá <%sMB ).
de_de: Das System hat nicht mehr genügend Speicherplatz (<%sMB left).
hu_hu: A rendszerben elfogy a szabad hely (<%sMB maradt).
it_it: Il tuo sistema stà finendo lo spazio disponibile (<%sMB rimasti).
lt_lt: Jūsų sistemoje baigiasi vieta saugykloje (liko <%sMB).
nb_no: Ditt system begynner å bli tomt for ledig plass (<%sMB igjen).
nl_nl: Je systeem heeft bijna geen opslagruimte meer (<%sMB over).
pt_br: O sistema está com baixo espaço de armazenamento livre (<%sMB).
uk_ua: У системі закінчується місце на диску (залишилось <%s МБ).

# #32143
source: Would you like to try and clear unused system files?
cs_cz: Chcete zkusit vymazat nepoužívané systémové soubory?
de_de: Möchten Sie versuchen, ungenutzte Systemdateien zu entfernen?
hu_hu: Szeretné eltávolítani a nem használt rendszerfájlokat?
it_it: Vuoi provare a pulire file di sistema non utilizzati?
lt_lt: Ar norite pamėginti išvalyti nenaudojamus sistemos failus?
nb_no: Ønsker du å rydde opp i ubrukte system filer?
nl_nl: Wil je proberen om ongebruikte systeembestanden op te schonen?
pt_br: Gostaria de limpar alguns arquivos de sistemas não utilizados?
uk_ua: Хочете спробувати видалити невикористані системні файли?

# #32144
source: Try rebooting a couple times to clear out temporary files.
cs_cz: Několikrát restartujte pro vymazání dočasných souborů.
de_de: Einige Neustarts zum Leeren temporärer Dateien versuchen.
hu_hu: Próbálja meg többször újraindítani a rendszert az ideiglenes fájlok eltávolításához.
it_it: Prova a riavviare un paio di volte per ripulire i file temporanei.
lt_lt: Pamėginkite kelis kartus paleisti iš naujo, kad išvalytumėte laikinuosius failus.
nb_no: Prøv å starte på nytt et par ganger for å rydde opp i midlertidige filer.
nl_nl: Probeer enkele malen te herstarten om tijdelijke bestanden op te ruimen.
pt_br: Tente reiniciar algumas vezes para limpar os arquivos temporários.
uk_ua: Спробуйте кілька разів перезавантажити систему, щоб видалити тимчасові файли.

# #32145
source: Restore failed
cs_cz: Obnovení selhalo
de_de: Wiederherstellung fehlgeschlagen
hu_hu: A visszaállítás sikertelen
it_it: Ripristino fallito
lt_lt: Atkurti nepavyko
nb_no: Gjenoppretting feilet
nl_nl: Herstel mislukt
pt_br: Falha na Restauração
uk_ua: Помилка відновлення

# #32146
source: Failure to reading the file.
cs_cz: Chyba při čtení souboru.
de_de: Lesen der Datei fehlgeschlagen.
hu_hu: Nem sikerült beolvasni a fájlt.
it_it: Impossibile leggere il file.
lt_lt: Nepavyko nuskaityti failo.
nb_no: Feilet å lese filen.
nl_nl: Bestand lezen is mislukt.
pt_br: Falha ao ler o arquivo.
uk_ua: Не вдалось прочитати файл.

# #32147
source: OSMC Backup
cs_cz: Záloha OSMC
de_de: OSMC-Sicherung
hu_hu: OSMC biztonsági mentés
it_it: Backup OSMC
lt_lt: OSMC atsarginė kopija
nb_no: OSMC sikkerhetskopi
pt_br: Backup do OSMC
uk_ua: Резервне копіювання OSMC
