Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.updates/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_br, uk_ua

# #32001
source: Schedule
cs_cz: Plán
de_de: Zeitplan
hu_hu: Ütemezés
it_it: Pianificazione
lt_lt: Tvarkaraštis
nb_no: Plan
nl_nl: Plannen
pt_br: Agendamentos
uk_ua: Розклад

# #32002
source: How often do you want to check for updates?
cs_cz: Jak často chcete kontrolovat aktualizace?
de_de: Wie oft möchten Sie auf Updates prüfen?
hu_hu: Milyen gyakran szeretné ellenőrizni a frissítéseket?
it_it: Quanto spesso vuoi cercare aggiornamenti?
lt_lt: Kaip dažnai norite patikrinti, ar nėra atnaujinimų?
nb_no: Hvor ofte ønsker du å sjekke etter oppdateringer?
nl_nl: Hoe vaak wil je op updates controleren?
pt_br: Com que frequência você deseja verificar se há atualizações?
uk_ua: Як часто перевіряти наявність оновлень?

# #32003
source: Never
cs_cz: Nikdy
de_de: Niemals
hu_hu: Soha
it_it: Mai
lt_lt: Niekada
nb_no: Aldri
nl_nl: Nooit
pt_br: Nunca
uk_ua: Ніколи

# #32004
source: Daily
cs_cz: Denně
de_de: Täglich
hu_hu: Naponta
it_it: Giornalmente
lt_lt: Kasdien
nb_no: Daglig
nl_nl: Dagelijks
pt_br: Diariamente
uk_ua: Щодня

# #32005
source: Weekly
cs_cz: Týdně
de_de: Wöchentlich
hu_hu: Hetente
it_it: Settimanalmente
lt_lt: Kas savaitę
nb_no: Ukentlig
nl_nl: Wekelijks
pt_br: Semanalmente
uk_ua: Щотижня

# #32006
source: Monthly
cs_cz: Měsíčně
de_de: Monatlich
hu_hu: Havonta
it_it: Mensilmente
lt_lt: Kas mėnesį
nb_no: Månedlig
nl_nl: Maandelijks
pt_br: Mensalmente
uk_ua: Щомісяця

# #32007
source: Day
cs_cz: Den
de_de: Tag
hu_hu: Nap
it_it: Giorno
lt_lt: Diena
nb_no: Dag
nl_nl: Dag
pt_br: Dia
uk_ua: День

# #32008
source: Monday
cs_cz: Pondělí
de_de: Montag
hu_hu: Hétfő
it_it: Lunedì
lt_lt: Pirmadienis
nb_no: Mandag
nl_nl: Maandag
pt_br: Segunda-feira
uk_ua: Понеділок

# #32009
source: Tuesday
cs_cz: Úterý
de_de: Dienstag
hu_hu: Kedd
it_it: Martedì
lt_lt: Antradienis
nb_no: Tirsdag
nl_nl: Dinsdag
pt_br: Terça-feira
uk_ua: Вівторок

# #32010
source: Wednesday
cs_cz: Středa
de_de: Mittwoch
hu_hu: Szerda
it_it: Mercoledì
lt_lt: Trečiadienis
nb_no: Onsdag
nl_nl: Woensdag
pt_br: Quarta-feira
uk_ua: Середа

# #32011
source: Thursday
cs_cz: Čtvrtek
de_de: Donnerstag
hu_hu: Csütörtök
it_it: Giovedì
lt_lt: Ketvirtadienis
nb_no: Torsdag
nl_nl: Donderdag
pt_br: Quinta-feira
uk_ua: Четвер

# #32012
source: Friday
cs_cz: Pátek
de_de: Freitag
hu_hu: Péntek
it_it: Venerdì
lt_lt: Penktadienis
nb_no: Fredag
nl_nl: Vrijdag
pt_br: Sexta-feira
uk_ua: П'ятниця

# #32013
source: Saturday
cs_cz: Sobota
de_de: Samstag
hu_hu: Szombat
it_it: Sabato
lt_lt: Šeštadienis
nb_no: Lørdag
nl_nl: Zaterdag
pt_br: Sábado
uk_ua: Субота

# #32014
source: Sunday
cs_cz: Neděle
de_de: Sonntag
hu_hu: Vasárnap
it_it: Domenica
lt_lt: Sekmadienis
nb_no: Søndag
nl_nl: Zondag
pt_br: Domingo
uk_ua: Неділя

# #32015
source: Days before/after month-end
cs_cz: Den před/po konci měsíce
de_de: Tage vor/nach dem Monatsende
hu_hu: Hónap vége előtti/utáni nap
it_it: Giorni prima/dopo la fine del mese
lt_lt: Dienų prieš/po mėnesio pabaigos
nb_no: Dager før/etter slutten av måneden
nl_nl: Dagen voor/na einde van de maand
pt_br: Dias antes/após final do mês
uk_ua: За кілька днів до/після кінця місяця

# #32016
source: Do you want to choose a specific time to check?
cs_cz: Chcete si vybrat nějaký vlastní čas pro kontrolu?
de_de: Möchten Sie eine bestimmte Zeit zum Prüfen einstellen?
hu_hu: Szeretne egy adott időpontot kiválasztani az ellenőrzéshez?
it_it: Vuoi scegliere un orario specifico per il controllo?
lt_lt: Ar norite pasirinkti konkretų patikrinimo laiką?
nb_no: Ønsker du å velge et spesifikt tidspunkt for å sjekke?
nl_nl: Wil je een specifiek tijdstip kiezen voor de controle?
pt_br: Você quer escolher um horário específico para verificar?
uk_ua: Виконувати перевірку у конкретний час?

# #32017
source: Random
cs_cz: Náhodně
de_de: Zufällig
hu_hu: Véletlenszerű
it_it: Casuale
lt_lt: Atsitiktinis
nb_no: Tilfeldig
nl_nl: Willekeurig
pt_br: Aleatório
uk_ua: Випадково

# #32018
source: Specific
cs_cz: Vlastní
de_de: Spezifisch
hu_hu: Meghatározott
it_it: Specifico
lt_lt: Konkretus
nb_no: Spesifikk
nl_nl: Specifiek
pt_br: Específico
uk_ua: Конкретний час

# #32019
source: Hour
cs_cz: Hodina
de_de: Stunde
hu_hu: Óra
it_it: Ora
lt_lt: Valanda
nb_no: Time
nl_nl: Uur
pt_br: Hora
uk_ua: Година

# #32020
source: Location entry method
cs_cz: Metoda zadávání polohy
de_de: Standort-Eingabemethode
hu_hu: Hely beviteli mód
it_it: Metodo selezione posizione
lt_lt: Vietos įvedimo metodas
nb_no: Stedsoppføringsmetode
nl_nl: Locatie invoermethode
pt_br: Método de entrada da localização
uk_ua: Метод визначення розташування

# #32021
source: Browsed
cs_cz: Vyhledat
de_de: Durchsucht
hu_hu: Kiválasztva
it_it: Selezionato
lt_lt: Naršant
nb_no: Utforsket
nl_nl: Gebladerd
pt_br: Navegado
uk_ua: Шляхом вибору

# #32022
source: Typed
cs_cz: Napsat
de_de: Eingegeben
hu_hu: Beírva
it_it: Scritto
lt_lt: Įvedant
nb_no: Skrevet
nl_nl: Getypt
pt_br: Digitado
uk_ua: Введення вручну

# #32023
source: Click to Type
cs_cz: Kliknout na Typ
de_de: Zum Eingeben klicken
hu_hu: Kattintson a beíráshoz
it_it: Clicca per Digitare
lt_lt: Spustelėkite, norėdami įvesti
nb_no: Klikk for å skrive
nl_nl: Klik om te typen
pt_br: Clique para Digitar
uk_ua: Натисніть, щоб ввести

# #32024
source: Click to Browse
cs_cz: Kliknout na Vyhledat
de_de: Zum Durchsuchen klicken
hu_hu: Kattintson a kiválasztáshoz
it_it: Clicca per Sfogliare
lt_lt: Spustelėkite, norėdami naršyti
nb_no: Klikk for å utforske
nl_nl: Klik om te bladeren
pt_br: Clique para Navegar
uk_ua: Натисніть, щоб вибрати

# #32025
source: Select files/folders to backup
cs_cz: Vybrat soubory/adresáře pro zálohu
de_de: Dateien/Ordner zum Sichern auswählen
hu_hu: Válassza ki a mentésre kerülő fájlokat/mappákat
it_it: Seleziona file/cartelle di cui fare backup
lt_lt: Pasirinkite failus/aplankus, kurių atsarginę kopiją kurti
nb_no: Velg filer/mapper som skal sikkerhetskopieres
nl_nl: Kies bestanden/mappen om te back-uppen
pt_br: Selecione arquivos/pastas para realizar o backup
uk_ua: Виберіть файли/папки для резервного копіювання

# #32046
source: Suppress on-screen progress updates
cs_cz: Potlačit aktualizace průběhu na obrazovce
de_de: On-Screen-Fortschrittsupdates unterdrücken
hu_hu: A frissítéssel kapcsolatos állapotüzenetek elrejtése
it_it: Disabilità notifiche di progresso
lt_lt: Slėpti ekrane rodomus progreso atnaujinimus
nb_no: Skjul visning av fremdrift på skjermen
nl_nl: Onderdruk voortgangsupdates op het scherm
pt_br: Suprimir atualizações de progresso
uk_ua: Не показувати на екрані перебіг виконання

# #32053
source: Install available updates Now
cs_cz: Instalovat dostupné aktualizace ihned
de_de: Verfügbare Updates jetzt installieren
hu_hu: Telepítse a rendelkezésre álló frissítéseket most
it_it: Installa aggiornamenti disponibili Adesso
lt_lt: Įdiegti galimus naujinius dabar
nb_no: Installer tilgjengelige oppdateringer nå
nl_nl: Beschikbare updates nu installeren
pt_br: Instalar atualizações disponíveis agora
uk_ua: Встановити доступні оновлення прямо зараз

# #32056
source: Scan for updates now
cs_cz: Zkontrolovat aktualizace ihned
de_de: Jetzt auf Updates prüfen
hu_hu: Frissítések keresése most
it_it: Cerca aggiornamenti adesso
lt_lt: Ieškoti naujinių dabar
nb_no: Søk etter oppdateringer nå
nl_nl: Nu op updates controleren
pt_br: Verificar atualizações agora
uk_ua: Перевірити наявність оновлення прямо зараз

# #32057
source: Prompt for all actions
cs_cz: Upozornit na všechny akce
de_de: Aufforderung für jede Aktion
hu_hu: Kérjen megerősítést minden műveletnél
it_it: Chiedi per ogni cosa
lt_lt: Perklausti visų veiksmų
nb_no: Spør om alle handlinger
nl_nl: Vraag bij alle acties
pt_br: Perguntar para todas ações
uk_ua: Підтверджувати кожну дію

# #32058
source: Display icon on home screen only
cs_cz: Pouze zobrazit ikonu na výchozí obrazovce
de_de: Icon nur über dem Hauptmenü anzeigen
hu_hu: Az ikon csak a kezdőképernyőn jelenjen meg
it_it: Mostra icona solo nella schermata principale
lt_lt: Rodyti piktogramą tik pradiniame ekrane
nb_no: Vis ikon kun på hjemskjermen
nl_nl: Toon icoon alleen op het startscherm
pt_br: Exibir ícone somente na tela inicial
uk_ua: Лише показати піктограму на головному екрані

# #32059
source: When updating...
cs_cz: Při aktualizaci...
de_de: Während des Updates...
hu_hu: Frissítés közben...
it_it: Durante l'aggiornamento...
lt_lt: Atnaujinant...
nb_no: Ved oppdatering...
nl_nl: Bij het updaten...
pt_br: Quando estiver atualizando...
uk_ua: Під час оновлення...

# #32060
source: Download and display icon
cs_cz: Stáhnout a zobrazit ikonu
de_de: Herunterladen und Icon anzeigen
hu_hu: Letöltés és ikon megjelenítése
it_it: Scarica e mostra icona
lt_lt: Atsisiųsti ir rodyti piktogramą
nb_no: Last ned og vis vis ikon
nl_nl: Download en toon icoon
pt_br: Fazer download e exibir ícone
uk_ua: Завантажити та показати піктограму

# #32061
source: Download and install automatically
cs_cz: Stáhnout a instalovat automaticky
de_de: Herunterladen und automatisch installieren
hu_hu: Automatikus letöltés és telepítés
it_it: Scarica e installa automaticamente
lt_lt: Atsisiųsti ir įdiegti automatiškai
nb_no: Last ned og installer automatisk
nl_nl: Download en installeer automatisch
pt_br: Fazer download e instalar automaticamente
uk_ua: Завантажити та встановити автоматично

# #32062
source: Download, install, auto-restart if needed
cs_cz: Stáhnout, instalovat a automaticky restartovat pokud je třeba
de_de: Herunterladen, installieren, automatisch neustarten, falls nötig
hu_hu: Letöltés, telepítés, automatikus újraindítás, ha szükséges
it_it: Scarica, installa, e riavvia se necessario
lt_lt: Atsisiųsti, įdiegt, prireikus automatiškai paleisti iš naujo
nb_no: Last ned, installer, automatisk start på nytt ved behov
nl_nl: Download, installeer, auto-herstart als nodig
pt_br: Fazer download, instalar e reiniciar (se necessário)
uk_ua: Завантажити, встановити та перезавантажити, якщо необхідно

# #32063
source: Do not prompt, display icon, or take any action
cs_cz: Neupozorňovat, nezobrazovat ikonu ani neprovádět žádnou akci
de_de: Nicht auffordern, Icon anzeigen oder eine Aktion durchführen
hu_hu: Ne kérdezzen, ne jelenítse meg az ikont, és ne végezzen semmilyen műveletet se
it_it: Non chiedere, visualizzare icona o eseguire alcuna azione
lt_lt: Neperklausti, neatvaizduoti piktogramos ir neatlikti jokių veiksmų
nb_no: Ikke spør, vis ikon eller utfør noen handlinger
nl_nl: Geen vragen, geen icoon, geen actie
pt_br: Não perguntar, exibir ícone ou tomar qualquer ação
uk_ua: Не питати, не показувати піктограму та не виконувати жодних дій

# #32064
source: Action when updates are found
cs_cz: Při aktualizaci byly nalezeny akce
de_de: Aktionen, falls Updates gefunden worden sind
hu_hu: Művelet frissítések észlelésekor
it_it: Azione quando vengono trovati aggiornamenti
lt_lt: Veiksmas radus naujinių
nb_no: Handling når oppdateringer er tilgjengelig
nl_nl: Actie als updates zijn gevonden
pt_br: Ação quando atualizações são encontradas
uk_ua: Дія при виявленні оновлень

# #32065
source: Only show prompts on the Home screen
cs_cz: Pouze zobrazit upozornění na hlavní obrazovce
de_de: Aufforderungen nur über dem Hauptmenü anzeigen
nl_nl: Toon alleen vragen op het startscherm

# #32066
source: Icon Position Horizontal (% of screen)
cs_cz: Vodorovná pozice ikony (% z obrazovky)
de_de: Icon-Position horizontal (% des Birdschirms)
hu_hu: Az ikon vízszintes pozíciója (a képernyő %-ában)
it_it: Posizionamento Orizzontale Icona (% dello schermo)
lt_lt: Piktogramos padėtis horizontali (% ekrano)
nb_no: Ikon position horisontalt (% av skjerm)
nl_nl: Icoonpositie horizontaal (% van scherm)
pt_br: Posição Horizontal do Ícone (% da tela)
uk_ua: Розташування піктограми по горизонталі (% екрана)

# #32067
source: Icon Position Vertical (% of screen)
cs_cz: Svislá pozice ikony (% z obrazovky)
de_de: Icon-Position vertikal (% des Birdschirms)
hu_hu: Az ikon függőleges pozíciója (a képernyő %-ában)
it_it: Posizionamento Verticale Icona (% dello schermo)
lt_lt: Piktogramos padėtis vertikali (% ekrano)
nb_no: Ikon position vertikalt (% av skjerm)
nl_nl: Icoonpositie verticaal (% van scherm)
pt_br: Posição Vertical do Ícone (% da tela)
uk_ua: Розташування піктограми по вертикалі (% екрана)

# #32068
source: Do not show icon on home screen
cs_cz: Nezobrazovat ikonu na hlavní obrazovce
de_de: Icon nicht über dem Hauptmenü anzeigen
hu_hu: Ne jelenjen meg az ikon a kezdőképernyőn
it_it: Non mostrare icona nella schermata principale
lt_lt: Nerodyti piktogramos pradiniame ekrane
nb_no: Ikke vis ikon på hjemskjerm
nl_nl: Toon geen icoon op startscherm
pt_br: Não exibir ícone na tela inicial
uk_ua: Не показувати піктограму на головному екрані

# #32069
source: Only check for updates if system is idle for 1 minute
cs_cz: Aktualizace kontrolovat pouze pokud je systém 1 minutu nečinný
de_de: Nur nach Updates suchen, wenn sich das System für 1 Minute im Leerlauf befindet
hu_hu: Csak akkor ellenőrizze a frissítéseket, ha a rendszer már 1 perce üresjáratban van
it_it: Verifica la disponibilità di aggiornamenti solo se il sistema è inattivo per 1 minuto
lt_lt: Tikrinti, ar yra naujinių, kai sistema nenaudojama 1 minutę
nb_no: Sjekk bare etter oppdateringer om systemet ikke har vært i bruk på 1 minutt
nl_nl: Controleer alleen op updates als het systeem 1 minuut inactief is
pt_br: Somente checar por atualizações se sistema estiver ocioso por 1 minuto
uk_ua: Перевіряти наявність оновлень за умови, що система неактивна протягом 1 хвилини

# #32070
source: Do not check for updates during playback
cs_cz: Nekontrolovat aktualizace během přehrávání
de_de: Nicht während der Wiedergabe nach Updates suchen
hu_hu: Lejátszás közben ne keressen frissítéseket
it_it: Non verificare la disponibilità di aggiornamenti durante la riproduzione
lt_lt: Netikrinti, ar yra naujinių, atkūrimo metu
nb_no: Ikke sjekk etter oppdateringer under avspilling
nl_nl: Controleer niet op updates tijdens afspelen
pt_br: Não verificar atualizações durante reprodução
uk_ua: Не перевіряти наявність оновлень під час відтворення

# #32071
source: Delay (minutes)
cs_cz: Zpoždění (minut)
de_de: Verzögerung (Minuten)
hu_hu: Késleltetés (perc)
it_it: Ritardo (minuti)
lt_lt: Uždelsimas (minutėmis)
nb_no: Forsinkelse (minutter)
nl_nl: Vertraging (minuten)
pt_br: Atraso (minutos)
uk_ua: Затримка (хвилини)

# #32072
source: OSMC Update Available
cs_cz: Dostupná Aktualizace OSMC
de_de: OSMC-Updates verfügbar
hu_hu: OSMC frissítés érhető el
it_it: Aggiornamento OSMC Disponibile
lt_lt: Galimas OSMC naujinys
nb_no: OSMC oppdatering tilgjengelig
nl_nl: OSMC update beschikbaar
pt_br: Atualização do OSMC disponível
uk_ua: Доступне оновлення OSMC

# #32073
source: Updates have been downloaded and can be installed immediately.
cs_cz: Aktualizace byla stažena a bude neprodleně nainstalována.
de_de: Updates sind heruntergeladen worden und können umgehend installiert werden.
hu_hu: A frissítések letöltése megtörtént és telepítés azonnal megkezdhető.
it_it: Gli aggiornamenti sono stati scaricati e possono essere installati immediatamente.
lt_lt: Naujiniai buvo atsiųsti ir juos galima nedelsiant įdiegti.
nb_no: Oppdateringer har blitt lastet ned og kan installeres umiddelbart.
nl_nl: Updates zijn gedownload en kunnen direct worden geïnstalleerd.
pt_br: As atualizações foram baixadas e podem ser instaladas imediatamente.
uk_ua: Оновлення були завантажені, і їх можна встановити прямо зараз.

# #32074
source: Would you like to install the updates now?
cs_cz: Chcete provést instalaci aktualizací nyní?
de_de: Möchten Sie die Updates jetzt installieren?
hu_hu: Szeretné most telepíteni a frissítéseket?
it_it: Vuoi installare gli aggiornamenti adesso?
lt_lt: Ar norite įdiegti naujinius dabar?
nb_no: Ønsker du å installere oppdateringer nå?
nl_nl: Wil je de updates nu installeren?
pt_br: Você gostaria de instalar as atualizações agora?
uk_ua: Встановити оновлення негайно?

# #32075
source: Updates have been downloaded, but Kodi will need to exit to install them.
cs_cz: Aktualizace byly staženy, ale Kodi se bude muset ukončit pro jejich nainstalování.
de_de: Updates sind heruntergeladen worden, allerdings muss Kodi beenden werden, um diese zu installieren.
hu_hu: A frissítések letöltése megtörtént, de a Kodiból ki kell lépni a telepítésükhöz.
it_it: Gli aggiornamenti sono stati scaricati, ma Kodi necessita di essere chiuso per installarli.
lt_lt: Naujiniai buvo atsiųsti, tačiau reikia išjungti Kodi, kad būtų galima juos įdiegti.
nb_no: Oppdateringer har blitt lastet ned, men Kodi må avsluttes for å installere dem.
nl_nl: Updates zijn gedownload, maar Kodi moet worden afgesloten om te installeren.
pt_br: As atualizações foram baixadas, mas o Kodi precisará fechar para instalá-las.
uk_ua: Оновлення були завантажені, але для їх встановлення потрібно вийти з Kodi.

# #32076
source: Would you like to exit and install the updates now?
cs_cz: Chcete ukončit Kodi a provést instalaci aktualizací nyní?
de_de: Möchten Sie beenden und die Updates jetzt installieren?
hu_hu: Szeretne most kilépni és telepíteni a frissítéseket?
it_it: Vuoi uscire ed installare gli aggiornamenti adesso?
lt_lt: Ar norite išeiti ir įdiegti naujinius dabar?
nb_no: Ønsker du å avslutte og installere oppdateringene nå?
nl_nl: Wil je nu afsluiten en de updates installeren?
pt_br: Você gostaria de sair e instalar as atualizações agora?
uk_ua: Вийти зараз та встановити оновлення?

# #32077
source: OSMC Updater
cs_cz: Aktualizace OSMC
hu_hu: OSMC frissítő
it_it: Aggiornamento OSMC
lt_lt: OSMC naujinimo priemonė
nb_no: OSMC oppdaterer
pt_br: Atualizador do OSMC
uk_ua: Модуль оновлення OSMC

# #32078
source: Update Running.
cs_cz: Aktualizace probíhá.
de_de: Update wird durchgeführt.
hu_hu: A frissítés folyamatban.
it_it: Aggiornamento in corso.
lt_lt: Atnaujinimas veikia.
nb_no: Oppdatering kjører.
nl_nl: Update bezig.
pt_br: Rodando Atualização.
uk_ua: Триває оновлення.

# #32079
source: Packages have been installed that require a reboot.
cs_cz: Nainstalované balíčky vyžadují restart.
de_de: Pakete, die einen Neustart benötigen, sind installiert worden.
hu_hu: Olyan csomagok kerültek telepítésre, amelyek újraindítást igényelnek.
it_it: Sono stati installati pacchetti che richiedono il riavvio.
lt_lt: Įdiegti paketai, dėl kurių reikia iš naujo paleisti sistemą.
nb_no: Pakker har blitt installert som krever omstart.
nl_nl: Er zijn pakketten geïnstalleerd die een herstart vereisen.
pt_br: Os pacotes que foram instalados requerem reinicialização.
uk_ua: Встановлено пакети, які потребують перезавантаження.

# #32080
source: Would you like to reboot now?
cs_cz: Chcete nyní provést restart?
de_de: Möchten Sie jetzt neustarten?
hu_hu: Szeretné most elvégezni az újraindítást?
it_it: Vuoi riavviare adesso?
lt_lt: Norite paleisti iš naujo dabar?
nb_no: Ønsker du å starte på nytt nå?
nl_nl: Wil je nu herstarten?
pt_br: Você gostaria de reiniciar agora?
uk_ua: Перезавантажити зараз?

# #32081
source: Reboot Now
cs_cz: Restartovat nyní
de_de: Jetzt neustarten
hu_hu: Újraindítás most
it_it: Riavvia Adesso
lt_lt: Paleisti iš naujo dabar
nb_no: Starter på nytt
nl_nl: Nu herstarten
pt_br: Reinicializar Agora
uk_ua: Перезавантажити зараз

# #32082
source: Reboot Later
cs_cz: Restartovat později
de_de: Später neustarten
hu_hu: Újraindítás később
it_it: Riavvia Dopo
lt_lt: Paleisti iš naujo vėliau
nb_no: Omstart seinere
nl_nl: Later herstarten
pt_br: Reinicializar Mais Tarde
uk_ua: Перезавантажте пізніше

# #32083
source: There are updates that are available for install.
cs_cz: Jsou k dispozici aktualizace, které je možné nainstalovat.
de_de: Es sind Updates zum Installieren verfügbar.
hu_hu: Telepítésre váró frissítések találhatók.
it_it: Sono presenti aggiornamenti pronti per l'installazione.
lt_lt: Yra naujinimų, kuriuos galima įdiegti.
nb_no: Det er oppdateringer tilgjengelig for installasjon.
nl_nl: Er zijn updates beschikbaar voor installatie.
pt_br: Existem atualizações disponíveis para instalação.
uk_ua: Для встановлення доступні оновлення.

# #32084
source: Would you like to install them now?
cs_cz: Chcete je nainstalovat nyní?
de_de: Möchten Sie diese jetzt installieren?
hu_hu: Szeretné telepíteni őket most?
it_it: Vuoi installarli adesso?
lt_lt: Ar norėtumėte juos įdiegti dabar?
nb_no: Ønsker du å installere dem nå?
nl_nl: Wil je ze nu installeren?
pt_br: Você gostaria de instalá-las agora?
uk_ua: Встановити їх зараз?

# #32085
source: Fair enough, then.
cs_cz: Dost spravedlivé.
de_de: In Ordnung.
it_it: Come preferisci, allora.
lt_lt: Suprantama.
nb_no: Greit nok.
nl_nl: Goed dan.
pt_br: Combinado, então.
uk_ua: Добре.

# #32086
source: You can install them from within the OSMC settings later.
cs_cz: Můžete je nainstalovat z nastavení OSMC později.
de_de: Sie können diese aus den OSMC-Einstellungen heraus später installieren.
hu_hu: Később telepítheti őket az OSMC beállítások alól.
it_it: Puoi installarli all'interno delle impostazioni OSMC in seguito.
lt_lt: Vėliau galėsite juos įdiegti iš OSMC nustatymų.
nb_no: Du kan installere dem fra OSMC innstillinger seinere.
nl_nl: Je kunt ze later installeren vanuit de OSMC instellingen.
pt_br: Você pode instalá-las a partir das configurações do OSMC posteriormente.
uk_ua: Ви можете встановити їх пізніше із налаштувань OSMC.

# #32087
source: OSMC Update Error
cs_cz: Chyba aktualizace OSMC
de_de: OSMC-Updatefehler
hu_hu: OSMC frissítési hiba
it_it: Errore Aggiornamento OSMC
lt_lt: OSMC naujinimo klaida
nb_no: OSMC oppdatering feilet
nl_nl: OSMC updatefout
pt_br: Erro na Atualização do OSMC
uk_ua: Помилка оновлення OSMC

# #32088
source: Error installing: %s
cs_cz: Chyba instalace: %s
de_de: Fehler bei der Installation von: %s-
hu_hu: Hiba a telepítés során: %s
it_it: Errore installando: %s
lt_lt: Klaida diegiant: %s
nb_no: Feil ved installasjon av: %s
nl_nl: Fout bij installatie: %s-
pt_br: Erro instalando: %s
uk_ua: Помилка встановлення: %s

# #32089
source: Please report this on the OSMC forum.
cs_cz: Nahlaste to prosím na fóru OSMC.
de_de: Bitte melden Sie dies im OSMC-Forum.
hu_hu: Kérjük, jelentse ezt az OSMC fórumán.
it_it: Si prega di segnalare questo sul forum di OSMC.
lt_lt: Praneškite apie tai OSMC forume.
nb_no: Vennligst rapporter dette på OSMC-forumet.
nl_nl: Meld dit svp op het OSMC forum.
pt_br: Por favor, relate isso no fórum OSMC.
uk_ua: Будь ласка, повідомте про це на форумі OSMC.

# #32090
source: Update
cs_cz: Aktualizace
hu_hu: Frissítés
it_it: Aggiorna
lt_lt: Atnaujinti
nb_no: Oppdater
pt_br: Atualização
uk_ua: Оновити

# #32091
source: Operations successfully completed.
cs_cz: Operace úspěšně dokončena.
de_de: Arbeiten erfolgreich abgeschlossen.
hu_hu: A művelet sikeresen befejeződött.
it_it: Operazioni completate con successo.
lt_lt: Operacijos sėkmingai baigtos.
nb_no: Operasjonen er fullført.
nl_nl: Operaties succesvol afgerond.
pt_br: Operações concluídas com sucesso.
uk_ua: Операції виконані успішно.

# #32092
source: There are no updates available.
cs_cz: Žádné dostupné aktualizace.
de_de: Es sind keine Updates verfügbar.
hu_hu: Nincsenek elérhető frissítések.
it_it: Non ci sono aggiornamenti disponibili.
lt_lt: Nėra prieinamų naujinių.
nb_no: Det er ingen oppdateringer tilgjengelig.
nl_nl: Er zijn geen updates beschikbaar.
pt_br: Não há atualizações disponíveis.
uk_ua: Оновлення не знайдені.

# #32093
source: Update Settings
cs_cz: Nastavení aktualizací
de_de: Update-Einstellungen
hu_hu: Frissítés beállításai
it_it: Impostazioni Aggiornamento
lt_lt: Naujinimo nustatymai
nb_no: Oppdateringsinnstillinger
nl_nl: Update-instellingen
pt_br: Configurações de Atualização
uk_ua: Налаштування оновлення

# #32094
source: Manual Controls
cs_cz: Ruční ovládání
de_de: Manuelle Einstellungen
hu_hu: Kézi vezérlés
it_it: Controlli manuali
lt_lt: Rankinis valdymas
nb_no: Manuell kontroll
nl_nl: Handmatige bediening
pt_br: Controles Manuais
uk_ua: Ручне керування
