Repository: osmc/osmc
Catalog: package/mediacenter-osmc/patches/resource.language.*/resources/strings-osmc.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nl_nl, pt_br, sv_se

# #40061
source: Please check your Internet connection is active before using voice recognition
de_de: Bitte die Internetverbindung vor der Nutzung der Spracherkennung prüfen
hu_hu: A hangfelismerés használata előtt győződjön meg arról, hogy az internetkapcsolat aktív
it_it: Si prega di verificare che la connessione internet sia attiva prima di utilizzare il riconoscimento vocale
nl_nl: Controleer of je internetverbinding actief is voordat je stemherkenning gebruikt
sv_se: Var god och kontrollera internet access innan du använder röststyrning

# #40062
source: An unknown error occurred processing your request
de_de: Ein unbekannter Fehler ist während der Bearbeitung der Anfrage aufgetreten
hu_hu: Ismeretlen hiba történt a kérés feldolgozásakor
it_it: Si è verificato un errore sconosciuto elaborando la tua richiesta
nl_nl: Er was een onbekende fout bij het verwerken van je verzoek
sv_se: Ett oväntat fel uppstod under behandlingen av din flrfrågan

# #40063
source: OSMC Voice Remote
de_de: OSMC-Sprachfernbedienung
hu_hu: OSMC hang-alapú távirányító
it_it: Telecomando Vocale OSMC

# #40064
source: OSMC recommends leaving the UI resolution at a maximum of 1080p and will automatically switch to UHD resolutions during playback if necessary. Are you sure you wish to continue?
de_de: OSMC empfiehlt, die UI-Auflösung maximal bei 1080p zu belassen und automatisch während der Wiedergabe zu UHD-Auflösungen zu wechseln, falls notwendig. Wirklich fortfahren?
hu_hu: Az OSMC javasolja, hogy a felhasználói felület felbontását legfeljebb 1080p-re állítsa, és csak automatikusan, lejátszás közben váltson UHD felbontásra, amennyiben szükséges. Biztosan folytatni szeretné?
it_it: OSMC consiglia di mantenere la risoluzione della UI al massimo a 1080p per poi passare automaticamente a risoluzioni UHD solo durante la riproduzione se necessario. Prosegui comunque?
nl_nl: OSMC adviseert om de UI-resolutie op maximaal 1080p te laten staan en zal indien nodig automatisch overschakelen naar UHD-resoluties tijdens het afspelen. Weet je zeker dat je wilt doorgaan?

# #40065
source: Enable this to force RGB output for some legacy TVs such as Philips 2009 era TVs. Fixes blue / green screen flashes. Requires reboot.
de_de: Dies aktivieren, um RGB-Ausgabe für einige ältere TVs wie Philips TVs aus der 2009-Ära zu erzwingen. Behebt blaues / grünes Flackern des Bildschirms. Erfordert einen Neustart.
hu_hu: Engedélyezze az RGB-kimenet kényszerítéséhez egyes régi tévék esetén, például a 2009-es korszakból származó Philips TV-ken. Javítja a képernyő kék/zöld villogását. Újraindítást igényel.
it_it: Abilita questa opzione per forzare l'output RGB per alcuni vecchi televisori, tipo i Philips del 2009. Corregge i flash blu/verdi dello schermo. Richiede riavvio.
nl_nl: Schakel dit in om RGB-uitvoer te forceren voor sommige oudere tv's, zoals Philips-tv's uit het 2009-tijdperk. Herstelt blauw/groene schermflitsen. Herstart vereist.

# #40066
source: Disables HPD events. Can fix sound issues. Requires reboot.
de_de: HPD-Ereignisse deaktivieren. Kann Tonprobleme beheben. Erfordert einen Neustart.
hu_hu: Letiltja a HPD észlelést. Javíthatja a hangproblémákat. Újraindítást igényel.
it_it: Disabilita gli eventi HPD. Può risolvere problemi audio. Richiede riavvio.
nl_nl: Schakelt HPD-events uit. Kan geluidsproblemen oplossen. Herstart vereist.

# #40067
source: Turns off HDMI audio. Useful if you're using SPDIF audio and don't want audio on HDMI.
de_de: Deaktiviert HDMI-Audio. Nützlich, wenn SPDIF-Audio genutzt wird und Audio über HDMI nicht erwünscht ist.
hu_hu: Letiltja a HDMI hangkimenetet. Ez hasznos, ha SPDIF kimenetet használ, és nem szeretne hangot átvinni HDMI-n keresztül.
it_it: Disattiva l'audio HDMI. Utile se si utilizza l'audio SPDIF e non si desidera l'audio su HDMI.
nl_nl: Schakelt HDMI-audio uit. Nuttig als je SPDIF-audio gebruikt en geen audio wilt op HDMI.

# #40068
source: Some displays (usually LG) work better with 4:2:2 colour subsampling, especially at 4K resolutions.
de_de: Einige Displays (überlicherweise LG) arbeiten besser mit 4:2:2-Farbunterabtastung, inbesondere bei 4K-Auflösungen.
hu_hu: Egyes kijelzők (többnyire az LG-k) jobban működnek 4:2:2 szín-mintavételezés esetén, különösen 4K felbontáson.
it_it: Alcuni display (di solito LG) funzionano meglio con il sottocampionamento colore a 4:2:2, specialmente con risoluzioni 4K.
nl_nl: Sommige beeldschermen (meestal LG) werken beter met 4:2:2 kleursubsampling, vooral bij 4K-resoluties.

# #40069
source: Set this to the maximum luminance of your display if your display does not support HDR
de_de: Dies auf die maximal vom Display unterstützte Luminanz einstellen, falls das Display kein HDR unterstützt
hu_hu: Állítsa be ezt a kijelző által támogatott legnagyobb fényerőre, ha a kijelzője nem támogatja a HDR-t
it_it: Impostare questa proprietà sulla luminanza massima dello schermo se lo schermo non supporta HDR
nl_nl: Stel dit in op de maximale luminantie van uw beeldscherm als die geen HDR ondersteunt

# #36638
source: Mitigate MTU issues with SMBv2
cs_cz: Zmírnit problémy MTU v SMBv2
lt_lt: Sušvelninti MTU problemas, susijusias su SMBv2
pt_br: Mitigar problemas MTU com SMBv2
sv_se: Dämpa MTU problem med SMBv2

# #36639
source: Enabling this option can resolve some connectivity issues when connecting via SMBv2, however doing so will reduce throughput regardless of SMB version
cs_cz: Povolení této volby může vyřešit některé připojovací problémy s připojením pomocí SMBv2, nicméně se tím sníží průchodnost bez ohledu na verzi SMB
lt_lt: Įjungus šią parinktį gali būti išspręstos kai kurios ryšio problemos jungiantis per SMBv2, tačiau tai sumažins pralaidumą nepriklausomai nuo SMB versijos
pt_br: Habilitando esta opção pode resolver alguns problemas de conectividade ao se conectar via SMBv2, porém isso reduzirá a velocidade de transferência, independentemente da versão SMB
sv_se: Aktivering av detta tillval kan lösa anslutnings problematik när SMBv2 används, dock sänker det överföringshastighet i samtliga versioner av SMB protokollet

# #39154
source: Enable this to force RGB output for some legacy TVs such as Philips 2009 era TVs. Fixes blue / green screen flashes. Requires reboot.
cs_cz: Povolte toto pro vynucení výstupu RGB pro některé starší televize, jako jsou televizory řady Philips 2009. Opravuje blikání modré / zelené obrazovky. Vyžaduje restart.
lt_lt: Įgalinkite tai, kad priverstumėte kai kurių senų televizorių, pvz., Philips 2009 eros televizorių, RGB išvestį. Ištaiso mėlynos / žalios spalvos ekrano blyksnius. Reikia iš naujo paleisti.
pt_br: Habilite esta opção para forçar saída RGB em algumas TVs legadas como Philips 2009. Corrige piscadas azuis/verdes na tela. Requer reinicialização.
sv_se: Aktivera för att tvinga RGB signal för äldre TVs, som Philips TV modeller från cirka 2009. Åtgärdar problem med blå / grön blinkningar på skärmen. Kräver omstart.

# #39155
source: Disables HPD events. Can fix sound issues. Requires reboot.
cs_cz: Zakáže události HPD. Může opravit problémy se zvukem. Vyžaduje restart.
lt_lt: Išjungti HPD įvykius. Gali išspręsti garso problemas. Reikia iš naujo paleisti.
pt_br: Desabilita eventos HPD. Pode corrigir problemas de áudio. Requer reinicialização.
sv_se: Avaktivera HPD händelser. Kan fixa visa ljud problem. Kräver omstart.

# #39156
source: Turns off HDMI audio. Useful if you're using SPDIF audio and don't want audio on HDMI.
cs_cz: Vypíná zvuk HDMI. Užitečné, pokud používáte zvuk SPDIF a nechcete zvuk přes HDMI.
lt_lt: Išjungia HDMI garsą. Naudinga, jei naudojate SPDIF garsą ir nenorite garso per HDMI.
pt_br: Desliga o áudio HDMI. Útil se você estiver usando áudio SPDIF e não quiser áudio via HDMI.
sv_se: Stäng av HDMI ljud. Kan vara behjälpligt om du använder SPDIF och inte vill ha ljudet i HDMI bussen.

# #39157
source: Some displays (usually LG) work better with 4:2:2 colour subsampling, especially at 4K resolutions.
cs_cz: Některé displeje (obvykle LG) fungují lépe s podvzorkováním barev 4: 2: 2, zejména při rozlišení 4K.
lt_lt: Kai kurie ekranai (dažniausiai LG) geriau veikia su 4:2:2 spalvų atranka, ypač esant 4K raiškai.
pt_br: Alguns displays (geralmente LG) funcionam melhor com subamostragem de 4:2:2 cores, especialmente com resoluções 4K.
sv_se: Visa skärmar (vanligtvis LG) fungerar bättre med krona subsampling på 4-2-2, särskilt vid 4k upplösning.

# #39158
source: Set this to the maximum luminance of your display if your display does not support HDR
cs_cz: Pokud váš displej nepodporuje HDR, nastavte zde maximální jas displeje
lt_lt: Nustatykite maksimalų ekrano ryškumą, jei jūsų ekranas nepalaiko HDR
pt_br: Ajuste isto para a luminância máxima de sua tela se sua tela não suportar HDR
sv_se: Ändra detta värde till maximal luminans för din skärm, om skärmen inte stödjer HDR

# #13124
source: OSMC recommends leaving the UI resolution at a maximum of 1080p and will automatically switch to UHD resolutions during playback if necessary. Are you sure you wish to continue?
sv_se: OSMC rekomenderar att man lämnar meny upplösningen på max 1080p för då växlar Kodi automatiskt till UHD upplösning om uppspelningen kräver det och skärmen stödjer det.. Är du säker på att du vill fortsätta?

# #34215
source: BT2020SDR
cs_cz: Barevný mód BT2020SDR

# #40001
source: Enable Voice Recognition (accept terms)
cs_cz: Povolit rozpoznávání hlasu (přijmout podmínky)
lt_lt: Įgalinti balso atpažinimą (sutikite su sąlygomis)

# #40004
source: Headphone output audio offset (ms)
cs_cz: Posun audio výstupu sluchátek (ms)
lt_lt: Ausinių išvesties garso poslinkis (ms)

# #40005
source: When enabling voice recognition, you accept OSMC's privacy policy You understand your voice will be transmitted to an OSMC server.
cs_cz: Při povolení rozpoznávání hlasu přijímáte zásady ochrany osobních údajů OSMC Uvědomte si, že váš hlas bude přenesen na server OSMC.
lt_lt: Įgalindami balso atpažinimą sutinkate su OSMC privatumo politika Jūs suprantate, kad jūsų balsas bus perduotas OSMC serveriui.

# #40006
source: Voice will be instantly transcribed and discarded
cs_cz: Hlas bude okamžitě vyhodnocen a zahozen
lt_lt: Balsas bus nedelsiant transkribuotas ir pašalintas

# #40007
source: You must obtain consent from all people who may be within audible range of the device
cs_cz: Musíte získat souhlas od všech lidí, kteří mohou nacházet ve slyšitelném dosahu zařízení
lt_lt: Turite gauti sutikimą iš visų žmonių, kurie gali būti įrenginio girdėjimo diapazone

# #40010
source: English)
cs_cz: Angličtina)
lt_lt: Anglų)

# #40019
source: Silence Detection Threshold
cs_cz: Prahová hodnota detekce ticha
lt_lt: Tylos aptikimo slenkstis
