Repository: osmc/osmc
Catalog: package/mediacenter-osmc/patches/resource.language.*/resources/strings-osmc.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nl_nl, pt_br, sv_se

# #790
source: Remote control
cs_cz: Dálkové ovládání
de_de: Fernbedienung
hu_hu: Távirányító
it_it: Controllo remoto
lt_lt: Nuotolinis valdymas
nl_nl: Afstandsbediening
pt_br: Controle remoto
sv_se: Fjärrkontroll

# #10636
source: Use HDMI AVI signalling
cs_cz: Použít signalizaci HDMI AVI
de_de: HDMI AVI-Signalisierung verwenden
hu_hu: HDMI AVI jelátvitel használata
it_it: Utilizzare la segnalazione HDMI AVI
lt_lt: Naudokite HDMI AVI signalizavimą
nl_nl: Gebruik HDMI AVI signalering
pt_br: Utilizar formato HDMI AVI
sv_se: Använd HDMI AVI signalering

# #13050
source: Low battery, please replace
cs_cz: Nízká úroveň baterie, prosím vyměňte ji
de_de: Niedriger Batteriestand, bitte auswechseln
hu_hu: Az elem lemerült, csere szükséges
it_it: Batteria scarica, sostituire
lt_lt: Baterija baigia išsikrauti, pakeiskite ją
nl_nl: Batterij laag, svp vervangen
pt_br: Bateria fraca, favor substituir
sv_se: Låg batterinivå, byte rekommenderas

# #13133
source: Force RGB output
cs_cz: Nastavit RGB výstup
de_de: RGB-Ausgabe erzwingen
hu_hu: RGB kimenet kényszerítése
it_it: Forza output RGB
lt_lt: Priverstinė RGB išvestis
nl_nl: Forceer RGB uitvoer
pt_br: Forçar saída RGB
sv_se: Tvinga RGB signal

# #13134
source: Lock HDMI HPD
cs_cz: Uzamknout HDMI HPD
de_de: HDMI HPD feststellen
hu_hu: HDMI HPD zárolása
it_it: Blocca HDMI HPD
lt_lt: Užrakinti HDMI HPD
nl_nl: Vergrendel HDMI HPD
pt_br: Travar HDMI HPD
sv_se: Lås HDMI HPD

# #13135
source: Mute HDMI audio output
cs_cz: Ztišit HDMI audio výstup
de_de: HDMI-Audioausgabe stummschalten
hu_hu: HDMI hang kimenetének némítása
it_it: Disattiva output audio HDMI
lt_lt: Nutildyti HDMI garso išvestį
nl_nl: Demp HDMI audio-uitvoer
pt_br: Silenciar saída de áudio HDMI
sv_se: Tysta HDMI ljudsignal

# #13136
source: Force 422 colour subsampling
cs_cz: Zapnout podvzorkování 422 barev
de_de: 422 Farbunterabtastung erzwingen
hu_hu: 422 szín-almintavételezés kényszerítése
it_it: Forza sottocampionamento colore 422
lt_lt: Priverstinis 422 spalvų atrinkimas
nl_nl: Forceer 422 kleur subsampling
pt_br: Forçar subamostragem de cor 422
sv_se: Tvinga 422

# #13137
source: Display maximum luminance
cs_cz: Maximální svítivost displeje
de_de: Maximale Display-Luminanz
hu_hu: Maximális képernyő fényerő
it_it: Massima luminanza schermo
lt_lt: Rodyti maksimalų ryškumą
nl_nl: Maximale helderheid scherm
pt_br: Utilizar luminância máxima
sv_se: Skärmens maximala luminans

# #13438
source: Allow hardware acceleration
cs_cz: Povolit hardwarovou akceleraci
de_de: Hardwarebeschleunigung erlauben
hu_hu: Hardveres gyorsítás engedélyezése
it_it: Consenti accelerazione hardware
lt_lt: Leisti aparatinės įrangos spartinimą
nl_nl: Hardwareversnelling toestaan
pt_br: Permitir aceleração via hardware
sv_se: Tillåt hårdvaru acceleration

# #34210
source: HDR processing
cs_cz: Zpracování HDR
de_de: HDR-Verarbeitung
hu_hu: HDR feldolgozás
it_it: Eleborazione HDR
lt_lt: HDR apdorojimas
nl_nl: HDR verwerking
pt_br: Processamento HDR
sv_se: HDR behandling

# #34211
source: Choose how HDR10 signals will be processed. Auto outputs BT709 or HDR10 according to your display's capabilities. BT2020SDR forces SDR with BT2020 (if your display supports it).
cs_cz: Vyberte způsob zpracování HDR signálu. Automatický výstup BT709 nebo HDR10 podle možností vašeho displeje. BT2020SDR vynutí SDR s BT2020 (pokud je váš displej podporuje).
de_de: Die Art und Weise der Verarbeitung von HDR10-Signalen auswählen. Auto gibt BT709 oder HDR10 entsprechend den Fähigkeiten des Displays aus. BT2020SDR erzwingt SDR mit BT2020 (falls das Display dies unterstützt).
hu_hu: Válassza ki a HDR10 jelek feldolgozási módját. A kimenet automatikusan BT709 vagy HDR10, a kijelző képességeitől függően. A BT2020SDR SDR-t kényszerít ki BT2020-szal (ha a kijelző ezt támogatja).
it_it: Scegli come verranno elaborati i segnali HDR10. Trasmetti automaticamente BT709 o HDR10 in base alle caratteristiche del display. BT2020SDR forza SDR con BT2020 (se lo schermo lo supporta).
lt_lt: Pasirinkite, kaip bus apdorojami HDR10 signalai. Priklausomai nuo ekrano galimybių, automatinė išvestis yra BT709 arba HDR10. BT2020SDR priverstinai naudos SDR su BT2020 (jei jūsų ekranas jį palaiko).
nl_nl: Kies hoe HDR10-signalen verwerkt worden. Auto levert BT709 of HDR10 overeenkomstig de mogelijkheden van je scherm. BT2020SDR forceert SDR met BT2020 (als je scherm het ondersteunt).
pt_br: Escolha como sinais HDR10 serão processados. Auto utiliza BT709 ou HDR10 de acordo com a disponibilidade da tela. BT2020SDR força SDR com BT2020 (caso sua tela suporte).
sv_se: Välj hur HDR10 signaler skall hanteras. Automatisk BT709 signal eller HDR10 enligt din skärms kapacitet. BT2020SDR tvingar SDR med BT2020(om din skärm klara det).

# #34212
source: Auto
cs_cz: Automatické
hu_hu: Automatikus
it_it: Automatico
lt_lt: Automatiškai
pt_br: Automático
sv_se: Automatiskt

# #34213
source: Force passthrough
cs_cz: Vynutit průchod
de_de: Durchleitung erzwingen
hu_hu: Továbbítás kényszerítése
it_it: Forza passthrough
lt_lt: Priverstinis tranzitinis perdavimas
nl_nl: Forceer passthrough
pt_br: Forçar passthrough
sv_se: Tvinga genomströmning

# #34214
source: Force SDR
cs_cz: Vynutit SDR
de_de: SDR erzwingen
hu_hu: SDR kényszerítése
it_it: Forza SDR
lt_lt: Priverstinis SDR
nl_nl: Forceer SDR
pt_br: Forçar SDR
sv_se: Tvinga SDR

# #36439
source: Enable hardware video decode using Amlogic decoder.
cs_cz: Povolit hardwarové dekódování videa pomocí dekodéru Amlogic.
de_de: Hardware-Videodekodierung unter Nutzung des Amlogic-Decoders aktivieren.
hu_hu: Hardveres videódekódolás engedélyezése Amlogic dekóder használatával.
it_it: Abilita la decodifica hardware del video tramite decoder Amlogic.
lt_lt: Įgalinti vaizdo dekodavimą aparatine įranga naudojant Amlogic“ dekoderį.
nl_nl: Inschakelen hardwarematige videodecodering via Amlogic decoder.
pt_br: Habilitar decodificação de vídeo via hardware utilizando Amlogic.
sv_se: Aktivera Amlogic hårdvaru avkodning.

# #36457
source: Include LFE in stereo downmix
cs_cz: Včetně LFE ve stereo downmixu
de_de: LFE in den Stereo-Downmix einbeziehen
hu_hu: LFE beépítése a sztereó lekeverésbe
it_it: Includi LFE in downmix stereo
lt_lt: Įtraukti LFE permiksuojant į stereo
nl_nl: Inclusief LFE in stereo downmix
pt_br: Incluir LFE em downmix de estéreo
sv_se: Inkluderar LFE i nedmix till stereo

# #36458
source: Include low frequency effects channel in stereo downmix. 100% - Full LFE volume. 10% to 90% - reduced LFE volume. 0% - LFE excluded from stereo downmix. Note: To avoid damaging your speakers only enable LFE downmix if your speakers can handle very low bass frequencies.
cs_cz: Zahrne nízkofrekvenční efektový kanál do stereofonního downmixu. 100% - plný objem LFE. 10% až 90% - snížený objem LFE. 0% - LFE vyloučeno ze stereofonního downmixu. Poznámka: Aby nedošlo k poškození reproduktorů, povolte LFE downmix pouze tehdy, pokud vaše reproduktory zvládnou velmi nízké basové frekvence.
de_de: Niederfrequenz-Effektkanäle in den Stereo-Downmix einbeziehen. 100% - Volle LFE-Lautstärke. 10% bis 90% - reduzierte LFE-Lautstärke. 0% - LFE vom Stereo-Downmix exkludiert. Anmerkung: Um eine Beschädigung der Lautsprecher zu verhindern, nur den LFE-Downmix aktivieren, wenn die Lautsprecher niedere Bass-Frequenzen verarbeiten können.
hu_hu: Mélyhang átviteli csatorna bevonása a sztereó lekeverésbe. 100% - teljes LFE hangerő. 10% és 90% között - csökkentett LFE hangerő. 0% - az LFE kizárása a sztereó lekeverésből. Megjegyzés: A hangsugárzók károsodásának elkerülése érdekében csak akkor engedélyezze az LFE bekeverését, ha a hangszórók képesek a nagyon alacsony frekvenciájú mély hangokat lesugározni.
it_it: Includi il canale degli effetti a bassa frequenza nel downmix stereo. 100% - volume LFE completo. Dal 10% al 90% - volume LFE ridotto. 0% - volume LFE escluso dal downmix stereo. Nota: per evitare di danneggiare gli altoparlanti, abilitare il downmix LFE solo se gli altoparlanti sono in grado di gestire frequenze molto basse.
lt_lt: Įtraukti žemo dažnio efektų kanalą permiksuojant į stereo. 100% - visas LFE garsumas. Nuo 10% iki 90% - sumažintas LFE garsumas. 0% - LFE neįtraukiamas į stereo garsą. Pastaba: kad nesugadintumėte garsiakalbių, įtraukite LFE tik tuo atveju, jei jūsų garsiakalbiai gali susitvarkyti su labai žemais dažniais.
nl_nl: Inclusief lage-frequentie effectenkanaal in stereo downmix. 100% - Vol LFE volume. 10 tot 90% - verminderd LFE volume. 0% - LFE uitgesloten van stereo downmix. NB: om schade aan je luidsprekers te voorkomen, schakel LFE downmix alleen in als je luidsprekers erg lage basfrequenties ondersteunen.
pt_br: Incluir canal de efeitos de baixa freqüência no downmix estéreo. 100% - Volume LFE completo. 10% a 90% - volume reduzido do LFE. 0% - LFE excluído do downmix estéreo. Nota: Para evitar danos a seus alto-falantes, só habilite o LFE downmix caso seus alto-falantes suportem freqüências graves muito baixas.
sv_se: Inkluderar låg frekvent effekt kanal i nedmixning till stereo. 100% - Full LFE volym. 10% till 30% - Reducerad LFE volym. 0% - LFE filtrerad från nedmix till s.tereo. För att undvika att dina högtalare tar skada, aktivera bara LFE nedmixning om dina högtalare klara av väldigt låga basfrekvenser.

# #36643
source: Mitigate MTU issues with SMBv2
de_de: MTU-Probleme mit SMBv2 mindern
hu_hu: MTU-problémák csökkentése SMBv2-vel
it_it: Mitigare i problemi di MTU con SMBv2
nl_nl: Mitigeer MTU issues met SMBv2

# #36644
source: Enabling this option can resolve some connectivity issues when connecting via SMBv2, however doing so will reduce throughput regardless of SMB version
de_de: Das Aktivieren dieser Option kann Verbindungsprobleme bei SMBv2-Verbindungen lösen, allerdings wird dies den Durchsatz unabhängig von der SMB-Version reduzieren
hu_hu: Ennek a lehetőségnek az engedélyezése megoldhat néhány kapcsolódási problémát SMBv2 használata esetén, de ezzel csökken az átviteli sebesség, az SMB verziójától függetlenül
it_it: L'attivazione di questa opzione può risolvere alcuni problemi di connettività durante la connessione tramite SMBv2, tuttavia ciò ridurrà la velocità effettiva indipendentemente dalla versione SMB
nl_nl: Inschakelen van deze optie kan sommige problemen oplossen met SMBv2-verbindingen, maar dit zal de doorvoer verminderen ongeacht de SMB-versie

# #38007
source: Boost centre channel when downmixing
cs_cz: Zesílit středový kanál při downmixování
de_de: Verstärkung des Centerkanals während des Heruntermischens
hu_hu: A középső csatorna erősítése lekeverés esetén
it_it: Aumenta il canale centrale durante il downmixing
lt_lt: Sustiprinti centrinį kanalą permiksuojant
nl_nl: Versterk het middenkanaal bij downmixen
pt_br: Aumentar canal central quando ao realizar downmix
sv_se: Förstärk center kanalen, vid ned mixning

# #38008
source: Increase this value to make the dialogue louder compared to background sounds when downmixing multichannel audio
cs_cz: Zvýšením této hodnoty zvýšíte hlasitost dialogu ve srovnání se zvuky pozadí při downmixování vícekanálového zvuku
de_de: Diesen Wert erhöhen, um Dialoge während des Heruntermischens von Mehrkanalaudio im Vergleich zu Hintergrundgeräuschen lauter zu machen
hu_hu: Növelje ezt az értéket, hogy a párbeszédek hangosabbak legyenek a háttérhangokhoz képest többcsatornás hang lekeverése esetén
it_it: Aumenta questo valore per rendere il dialogo più forte rispetto ai suoni di sottofondo quando si fa downmix delll'audio multicanale
lt_lt: Padidinkite šią vertę, kad dialogas būtų garsesnis, palyginus su foniniais garsais, kai permiksuojamas daugiakanalis garsas
nl_nl: Verhoog deze waarde om de dialoog luider te maken in vergelijking met achtergrondgeluiden bij downmixen van meerkanaalsaudio
pt_br: Aumente este valor para tornar o diálogo mais alto em comparação com os sons de fundo ao realizar multicanal downmixing
sv_se: Öka detta värde för att förstärka dialogen gentemot bakgrunds ljud, vid ned mixning av flerkanaligt ljud

# #38999
source: Accelerate AV1
de_de: AV1 beschleunigen
hu_hu: AV1 gyorsítása
it_it: Accelera AV1
nl_nl: Versnel AV1
sv_se: Accelererad AV1

# #39000
source: HD and up
cs_cz: HD a vyšší
de_de: HD und darüber
hu_hu: HD és magasabb
it_it: HD o meglio
lt_lt: HD ir akščiau
nl_nl: HD en hoger
pt_br: HD ou superiores
sv_se: HD och högre

# #39001
source: Accelerate MPEG2
cs_cz: Akcelerovat MPEG2
de_de: MPEG2 beschleunigen
hu_hu: MPEG2 gyorsítása
it_it: Accelera MPEG2
lt_lt: Spartinti MPEG2
nl_nl: Versnel MPEG2
pt_br: Acelerar MPEG2
sv_se: Accelererad MPEG2

# #39002
source: Accelerate MPEG4
cs_cz: Akcelerovat MPEG4
de_de: MPEG4 beschleunigen
hu_hu: MPEG4 gyorsítása
it_it: Accelera MPEG4
lt_lt: Spartinti MPEG4
nl_nl: Versnel MPEG4
pt_br: Acelerar MPEG4
sv_se: Accelererad MPEG4

# #39003
source: Accelerate h264
cs_cz: Akcelerovat h264
de_de: H264 beschleunigen
hu_hu: h264 gyorsítása
it_it: Accelera h264
lt_lt: Spartinti h264
nl_nl: Versnel h264
pt_br: Acelerar h264
sv_se: Accelererad h264

# #40001
source: Enable voice recognition
de_de: Spracherkennung aktivieren
hu_hu: Hangfelismerés engedélyezése
it_it: Abilita riconoscimento vocale
nl_nl: Stemherkenning inschakelen
sv_se: Aktivera röst igenkänning

# #40002
source: Voice recognition language
cs_cz: Jazyk pro rozpoznávání hlasu
de_de: Spracherkennungs-Sprache
hu_hu: Hangfelismerés nyelve
it_it: Lingua riconoscimento vocale
lt_lt: Balso atpažinimo kalba
nl_nl: Stemherkenning taal
pt_br: Idioma do reconhecimento de voz
sv_se: Röststyrnings soråk

# #40003
source: API endpoint
cs_cz: Koncový bod API
de_de: API-Endpunkt
hu_hu: API végpont
it_it: Endpoint API
lt_lt: API galinis taškas
pt_br: Endpoint da API

# #40004
source: Headphone output audio offset
de_de: Kopfhörerausgabe-Audioversatz
hu_hu: Fejhallgató-kimenet hangjának késleltetése
it_it: Ritardo audio uscita cuffie
nl_nl: Hoofdtelefoon uitgang audio offset
sv_se: Kompensationsvärde för hörlursuttag

# #40005
source: When enabling voice recognition, you accept OSMC's privacy policy and understand that your voice will be transmitted to an OSMC server. Voice will be instantly transcribed and discarded. You must obtain consent from all people who may be within audible range of this device
de_de: Durch das Aktivieren der Spracherkennung wird die OSMC-Datenschutzerklärung und die Übertragung der Sprache an OSMC-Server akzeptiert. Sprache wird sofort transkribiert und verworfen. Die Zustimmung aller Personen in Hörreichweite dieses Geräts muss eingeholt werden
hu_hu: A hangfelismerés engedélyezésével Ön elfogadja az OSMC adatvédelmi szabályzatát, valamint tudomásul veszi, hogy hangja egy OSMC szerverre továbbításra kerül. A hang azonnal átírásra és eldobásra kerül. Rendelkeznie kell minden személy beleegyezésével, aki a készülékhez viszonyítva, annak hallható távolságán belül tartózkodik
it_it: Abilitando il riconoscimento vocale, accetti l'informativa sulla privacy di OSMC e sei a conoscenza che la tua voce venga trasmessa ad un server di OSMC. La voce verrà trascritta e immediatamente eliminata. Devi inoltre avere il permesso delle persone presenti nella stanza a breve distanza dal dispositivo
nl_nl: Wanneer je stemherkenning inschakelt, accepteer je het privacybeleid van OSMC en begrijp je dat je stem zal worden verzonden naar een server van OSMC. De stem zal onmiddellijk worden uitgeschreven en weggegooid. Je moet toestemming verkrijgen van alle personen die zich binnen het hoorbare bereik van dit apparaat kunnen bevinden
sv_se: När du aktiverar röststyrning, accepterar du OSMC personuppgifts hantering och är införstådd att din röst kommer att skickas till en OSMC server. Där kommer den snabbt transkriberas och raderas. Du är även skyldig att se till att andra inom radien för enhetens ljudupptagning område, acceptera samma vilkor

# #40010
source: English
de_de: Englisch
hu_hu: Angol
it_it: Inglese
nl_nl: Engels
sv_se: Engelska

# #40011
source: Dutch
cs_cz: Holandština
de_de: Niederländisch
hu_hu: Holland
it_it: Olandese
lt_lt: Olandų
nl_nl: Nederlands
pt_br: Holandês
sv_se: Holländska

# #40012
source: French
cs_cz: Francouzština
de_de: Französisch
hu_hu: Francia
it_it: Francese
lt_lt: Prancūzų
nl_nl: Frans
pt_br: Francês
sv_se: Franska

# #40013
source: German
cs_cz: Němčina
de_de: Deutsch
hu_hu: Német
it_it: Tedesco
lt_lt: Vokiečių
nl_nl: Duits
pt_br: Alemão
sv_se: Tyska

# #40014
source: Italian
cs_cz: Italština
de_de: Italienisch
hu_hu: Olasz
it_it: Italiano
lt_lt: Italų
nl_nl: Italiaans
pt_br: Italiano
sv_se: Italienska

# #40015
source: Spanish
cs_cz: Španělština
de_de: Spanisch
hu_hu: Spanyol
it_it: Spagnolo
lt_lt: Ispanų
nl_nl: Spaans
pt_br: Espanhol
sv_se: Spanska

# #40016
source: Wait Less
cs_cz: Počkat méně
de_de: Weniger warten
hu_hu: Kevesebb várakozás
it_it: Aspetta meno
lt_lt: Laukti mažiau
nl_nl: Wacht minder
pt_br: Aguardar menos
sv_se: Vänta minde

# #40017
source: Normal
cs_cz: Normální
hu_hu: Normál
it_it: Normale
lt_lt: Normaliai
nl_nl: Normaal

# #40018
source: Wait More
cs_cz: Ještě počkat
de_de: Mehr warten
hu_hu: Tovább várakozás
it_it: Aspetta di più
lt_lt: Laukti daugiau
nl_nl: Wacht meer
pt_br: Aguardar Mais
sv_se: Vänta mera

# #40019
source: Silence detection threshold
de_de: Grenzwert Stilleerkennung
hu_hu: Csend észlelésének küszöbértéke
it_it: Soglia rilevamento silenzio
nl_nl: Drempel voor stiltedetectie
sv_se: Gränsvärde för uppfattad tystnad

# #40020
source: Voice playback behaviour
de_de: Sprachwiedergabe-Verhalten
hu_hu: Hanglejátszás módja
it_it: Modalità riproduzione voce
nl_nl: Gedrag bij afspelen stem
sv_se: Röst uppspelnings beteende

# #40021
source: Choose how Kodi should behave when recording voice if you are playing video or audio. Voice transcription is more accurate when there is less background noise
de_de: Kodi-Verhalten bei der Sprachaufnahme während der Wiedergabe von Video oder Audio auswählen. Die Sprachtranskripton ist bei weniger Hintergrundgeräuschen genauer
hu_hu: Válassza ki, hogyan viselkedjen a Kodi hangfelvétel esetén, videó- vagy zenelejátszás közben. A hang átírása pontosabb, ha alacsonyabb a háttérzaj
it_it: Scegli come Kodi deve comportarsi durante la registrazione vocale se stai riproducendo video o audio. La trascrizione vocale è più accurata quando ci sono meno rumori di sottofondo
nl_nl: Kies hoe Kodi zich moet gedragen bij stemopname als je video of audio afspeelt. Spraaktranscriptie is nauwkeuriger als er minder achtergrondgeluid is
sv_se: Välj hur Kodis röstinspelning skall agera om du spelar upp video eller ljud. Röst transkription är mer träffsäker med mindre bakgrundsljud

# #40022
source: Keep playing (do nothing)
de_de: Weiter abspielen (nichts tun)
hu_hu: Lejátszás folytatása (ne történjen semmi)
it_it: Continua la riproduzione (non far nulla)
nl_nl: Blijf spelen (doe niets)
sv_se: Fortsätta att spela (gör ingenting)

# #40023
source: Pause playback until transcription is complete
de_de: Wiedergabe bis zur vollständigen Transkription pausieren
hu_hu: A lejátszás szüneteltetése, amíg az átírás be nem fejeződik
it_it: Metti in pausa fino al termine della trascrizione
nl_nl: Pauzeer afspelen tot transcriptie voltooid is
sv_se: Pausa uppspelningen tills transkriptionen är klar

# #40024
source: Mute playback until transcription is complete
de_de: Wiedergabe bis zur vollständigen Transkription stumm schalten
hu_hu: A lejátszás némítása, amíg az átírás be nem fejeződik
it_it: Muta il volume fino al termine della trascrizione
nl_nl: Geluid dempen tot transcriptie voltooid is
sv_se: Tysta ljudet i uppspelningen tills transkriptionen är klar

# #40050
source: Low battery, please charge
cs_cz: Nízký stav baterie, prosím nabijte ji
de_de: Niedriger Batteriestand, bitte laden
hu_hu: Alacsony telepfeszültség, töltés szükséges
it_it: Batteria scarica, si prega di caricare
lt_lt: Baterija baigiai išsikrauti, pakeiskite ją
nl_nl: Lage batterij, svp vervangen
pt_br: Bateria fraca, favor recarregar
sv_se: Låg batterinivå, var god ladda

# #40051
source: Battery is charging
cs_cz: Baterie se nabíjí
de_de: Batterie wird geladen
hu_hu: Az telep töltődik
it_it: La batteria è in carica
lt_lt: Baterija įkraunama
nl_nl: Batterij laadt op
pt_br: Bateria recarregando
sv_se: Batteriet laddas

# #40052
source: Battery is fully charged
cs_cz: Baterie je nabitá
de_de: Batterie ist vollständig geladen
hu_hu: A telep teljesen feltöltve
it_it: La batteria è completamente carica
lt_lt: Baterija pilnai įktrauta
nl_nl: Batterij is volledig opgeladen
pt_br: Bateria completamente carregada
sv_se: Batteriet är fulladdat

# #40053
source: Battery charger removed
cs_cz: Nabíječka baterie odpojena
de_de: Batterieladegerät entfernt
hu_hu: A töltőkészülék leválasztva
it_it: Caricabatterie rimosso
lt_lt: Baterijos įkroviklis atjungtas
nl_nl: Batterijlader verwijderd
pt_br: Carregador de bateria removido
sv_se: Batteriladdaren från kopplad

# #40054
source: Headphones inserted
cs_cz: Sluchátka připojena
de_de: Kopfhörer eingesteckt
hu_hu: Fejhallgató csatlakoztatva
it_it: Cuffie inserite
lt_lt: Ausinės prijungtos
nl_nl: Hoofdtelefoon aangesloten
pt_br: Fones de ouvido inserido
sv_se: Hörlurar upptäkta

# #40055
source: Headphones removed
cs_cz: Sluchátka odpojena
de_de: Kopfhörer entfernt
hu_hu: Fejhallgató leválasztva
it_it: Cuffie rimosse
lt_lt: Ausinės atjungtos
nl_nl: Hoofdtelefoon verwijderd
pt_br: Fones de ouvido removido
sv_se: Hörlurar frånkopplade

# #40056
source: OSMC Voice
it_it: OSMC Voce

# #40057
source: You must accept the terms under Settings -> System -> Input before you can use voice recognition
de_de: Vor Nutzung der Spracherkennung müssen die Bestimmungen unter Einstellungen -> Eingabe akzeptiert werden
hu_hu: A hangfelismerés használatához el kell fogadnia a Beállítások -> Rendszer -> Bemenet alatti feltételeket
it_it: Devi accettare i termini in Impostazioni -> Sistema -> Input prima di poter utilizzare il riconoscimento vocale
nl_nl: Je moet de voorwaarden accepteren onder Instellingen -> Systeem -> Invoer voordat je stemherkenning kunt gebruiken
sv_se: Du måste acceptera villkoren under Inställningar -> System -> Inmatning, innan du kan använda röststyrning

# #40058
source: Voice key not recognised. Please check the date and time are correct on your device
de_de: Spracheingabe nicht erkannt. Bitte Datum und Uhrzeit auf dem Gerät prüfen
hu_hu: A kulcsszó nem ismerhető fel. Ellenőrizze, hogy a dátum és az idő megfelelő-e az eszközön
it_it: Chiave vocale non riconosciuta. Assicurati che data e ora del tuo dispositivo siano corrette
nl_nl: Stemsleutel niet herkend. Controleer of datum en tijd correct zijn op je apparaat
sv_se: Felaktig röststyrnings nyckel. Kontrollera om enhetens tid och datum inställningar är korrekt

# #40059
source: This device does not support voice recognition
de_de: Dieses Gerät unterstützt keine Spracherkennung
hu_hu: Ez az eszköz nem támogatja a hangfelismerést
it_it: Questo dispositivo non supporta il riconoscimento vocale
nl_nl: Dit apparaat ondersteunt geen stemherkenning
sv_se: Den här enheten stödjer inte röststyrning

# #40060
source: Please limit the number of voice requests that you make in a period of time
de_de: Bitte die Anzahl an Sprachanfragen während einer Zeitspanne begrenzen
hu_hu: Kérjük, korlátozza egy adott időtartamon belül a hang-alapú kérések számát
it_it: Si prega di limitare il numero di richieste di riconoscimento vocale fatte nel tempo
nl_nl: Beperk het aantal stemverzoeken dat je doet in een tijdsperiode
sv_se: Var god begränsa antalet röst förfrågningar inom en kort tidsrymd
