Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.logging/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_pt, sv_se, uk_ua

# #32001
source: Upload Logs
cs_cz: Odeslat Logy
de_de: Logs hochladen
hu_hu: Naplók feltöltése
it_it: Invio Log
lt_lt: Įkelti žurnalus
nb_no: Last opp logger
pt_pt: Transferir Logs
sv_se: Skicka loggar
uk_ua: Завантаження журналів

# #32002
source: All Configs and Logs
cs_cz: Všechna nastavení a Logy
de_de: Alle Konfigurationen und Logs
hu_hu: Összes konfiguráció és napló
it_it: Tutti i Log e le Configurazioni
lt_lt: Visos konfigūracijos ir žurnalai
nb_no: Alle konfigurasjoner og logger
nl_nl: Alle configuraties en logs
pt_pt: Todas as Configs e Logs
sv_se: Alla konfigurations och loggfiler
uk_ua: Усі конфігурації та журнали

# #32003
source: Kodi Log
cs_cz: Log z Kodi
hu_hu: Kodi napló
it_it: Log Kodi
lt_lt: Kodi žurnalas
nb_no: Kodi logger
pt_pt: Log Kodi
sv_se: Kodi loggfil
uk_ua: Журнал Kodi

# #32004
source: /boot/config.txt (Pi only)
cs_cz: /boot/config.txt (pouze Pi)
de_de: /boot/config.txt (nur Pi)
hu_hu: /boot/config.txt (csak PI)
it_it: /boot/config.txt (solo Pi)
lt_lt: /boot/config.txt (tik Pi)
nb_no: /boot/config.txt (kun Raspberry Pi)
nl_nl: /boot/config.txt (alleen Pi)
pt_pt: /boot/config.txt (apenas Pi)
sv_se: /boot/config.txt (enbart Pi )
uk_ua: /boot/config.txt (тільки Pi)

# #32005
source: OSMC Packages
cs_cz: Balíčky OSMC
de_de: OSMC-Pakete
hu_hu: OSMC Csomagok
it_it: Pacchetti OSMC
lt_lt: OSMC paketai
nb_no: OSMC pakker
nl_nl: OSMC pakketten
pt_pt: Pacotes OSMC
sv_se: OSMC Packet
uk_ua: Пакети OSMC

# #32006
source: APT Logs
cs_cz: Logy APT
hu_hu: APT naplók
it_it: Log APT
lt_lt: APT žurnalai
nb_no: APT logger
pt_pt: Logs APT
sv_se: APT loggar
uk_ua: Журнали APT

# #32012
source: Upload Selected Logs Now
cs_cz: Odeslat vybrané logy teď
de_de: Ausgewählte Logs jetzt hochladen
hu_hu: Kiválasztott naplók feltöltése most
it_it: Invia Log Selezionati Adesso
lt_lt: Įkelti pasirinktus žurnalus dabar
nb_no: Last opp valgte logger nå
nl_nl: Geselecteerde logs nu uploaden
pt_pt: Transferir Logs Selecionados Agora
sv_se: Laddar upp valda loggar
uk_ua: Завантажити обрані журнали прямо зараз

# #32013
source: OSMC Log Uploader
cs_cz: Odesílání Logů OSMC
hu_hu: OSMC naplófeltöltő
it_it: Invio Log di OSMC
lt_lt: OSMC žuranlų įkėlimo priemonė
nb_no: OSMC logg-opplaster
pt_pt: Transferir Log OSMC
sv_se: OSMC loggfils uppladdning
uk_ua: Завантажувач журналів OSMC

# #32014
source: URL: %s
cs_cz: Připojení URL: %s
hu_hu: Hivatkozás: %s
lt_lt: URL adresas: %s
uk_ua: URL-адреса: %s

# #32016
source: AdvancedSettings.xml
cs_cz: Soubor AdvancedSettings.xml

# #32021
source: System Journal
cs_cz: Soubor se System Journal
de_de: Systemprotokoll
hu_hu: Rendszernapló
it_it: Registro di Sistema
lt_lt: Sistemos žurnalas
nl_nl: Systeemjournaal
pt_pt: Jornal de Sistema
uk_ua: Системний журнал

# #32022
source: All other packages
cs_cz: Všechny ostatní balíčky
de_de: Alle anderen Pakete
hu_hu: Minden egyéb csomag
it_it: Tutti gli altri pacchetti
lt_lt: Visi kiti paketai
nb_no: Alle andre pakker
nl_nl: Alle andere pakketten
pt_pt: Todos os outros pacotes
sv_se: Alla andra paket
uk_ua: Всі інші пакети

# #32023
source: Could not retrieve URL.
cs_cz: Nelze získat připojení URL.
de_de: URL konnte nicht abgerufen werden.
hu_hu: Nem sikerült lekérdezni a hivatkozást.
it_it: Impossibile recuperare l'URL.
lt_lt: Nepavyko gauti URL adreso.
nb_no: Kunne ikke hente fra URL.
nl_nl: Kon URL niet ophalen.
pt_pt: Não foi possível buscar o URL.
sv_se: Kunde inte ansluta till URL.
uk_ua: Не вдалося отримати URL-адресу.

# #32025
source: Retrieving Logs
cs_cz: Shromažďování Logů
de_de: Logs abrufen
hu_hu: Naplók lekérdezése
it_it: Ricezione Log
lt_lt: Gaunami žurnalai
nb_no: Henter loggene
nl_nl: Logs worden opgehaald
pt_pt: Buscando Logs
sv_se: Hämtar loggfiler
uk_ua: Отримання журналів

# #32026
source: Uploading and Retrieving URL
cs_cz: Odesílání a získávání URL
de_de: Hochladen und URL abrufen
hu_hu: Feltöltés és lekérdezés hivatkozás
it_it: Invio e Ricezione URL
lt_lt: Įkeliama ir gaunamas URL adresas
nb_no: Laster opp og henter URL
nl_nl: Aan het uploaden en URL ophalen
pt_pt: Transferindo e Buscando o URL
sv_se: Laddar upp och hämtar URL
uk_ua: Завантаження та отримання URL-адреси

# #32027
source: Combining and Writing Logs
cs_cz: Kombinování a zápis Logů
de_de: Logs zusammenführen und schreiben
hu_hu: Naplók kombinálása és írása
it_it: Combinazione e Scrittura Log
lt_lt: Apjungiami ir įrašomi žurnalai
nb_no: Kombinerer og skriver logger
nl_nl: Combineren en wegschrijven logs
pt_pt: Reunindo e Escrevendo Logs
sv_se: Kombinerar och Skriver loggfiler
uk_ua: Об’єднання та запис журналів

# #32028
source: Kodi Old Log (excluded from All)
cs_cz: soubor Kodi Old Log (vyřazen ze všech)
de_de: Kodi Old-Log (von Alle ausgeschlossen)
hu_hu: Kodi régi napló (kizárva az összesből)
it_it: Log Vecchio di Kodi (non compreso in Tutti)
lt_lt: Kodi senas žurnalas (neįtrauktas į visus)
nb_no: Gammel Kodi log (ekskludert fra Alle)
nl_nl: Kodi oude log (uitgesloten van Alles)
pt_pt: Log Antigo Kodi (excluído de Todos)
sv_se: Kodi Old Log (undantagen från Alla)
uk_ua: Старий журнал Kodi (виключено з усіх)

# #32030
source: /boot directory listing
cs_cz: Soubor /boot directory listing
de_de: /boot-Verzeichnisauflistung
hu_hu: /boot könyvtárlista
it_it: contenuto directory /boot
lt_lt: /boot aplanko sąrašas
nb_no: /boot katalogoppføring
nl_nl: /boot maplijst
pt_pt: Listagem do diretório /boot
sv_se: /boot fil-träd
uk_ua: Вміст каталогу /boot

# #32031
source: Kernel Details
cs_cz: Detaily Kernelu
hu_hu: Kernel részletek
it_it: Dettagli Kernel
lt_lt: Išsami branduolio informacija
nb_no: Kjernedetaljer
pt_pt: Detalhes do Kernel
sv_se: Kernel detaljer
uk_ua: Детальні відомості про ядро

# #32032
source: /etc/init.d directory listing
cs_cz: Soubor /etc/init.d directory listing
de_de: /etc/init.d-Verzeichnisauflistung
hu_hu: /etc/init.d könyvtárlista
it_it: contenuto directory /etc/init.d
lt_lt: /etc/init.d aplanko sąrašas
nb_no: /etc/init.d katalogoppføring
nl_nl: /etc/init.d maplijst
pt_pt: Listagem do diretório /etc/init.d
sv_se: /etc/init.d fil-träd
uk_ua: Вміст каталогу /etc/init.d

# #32033
source: /lib/systemd/system directory listing
cs_cz: Soubor /lib/systemd/system directory listing
de_de: /lib/systemd/system-Verzeichnisauflistung
hu_hu: /lib/systemd/system könyvtárlista
it_it: contenuto directory /lib/systemd/system
lt_lt: /lib/systemd/system aplanko sąrašas
nb_no: /lib/systemd/system katalogoppføring
nl_nl: /lib/systemd/system maplijst
pt_pt: Listagem do diretório /lib/systemd/system
sv_se: /lib/systemd/system fil-träd
uk_ua: Вміст каталогу /lib/systemd/system

# #32034
source: Free Memory
cs_cz: Volná Paměť RAM
de_de: Freier Arbeitsspeicher
hu_hu: Szabad memória
it_it: Memoria disponibile
lt_lt: Laisva atmintis
nb_no: Ledig minne
nl_nl: Vrij geheugen
pt_pt: Memória Livre
sv_se: Ledigt minne
uk_ua: Вільна пам'ять

# #32035
source: Free Diskspace
cs_cz: Volný úložný prostor
de_de: Freier Speicher
hu_hu: Szabad tárhely
it_it: Spazio su Disco disponibile
lt_lt: Laisva disko vieta
nb_no: Ledig lagringsplass
nl_nl: Vrije schijfruimte
pt_pt: Espaço livre no disco
sv_se: Ledigt diskutrymme
uk_ua: Вільне місце на диску

# #32036
source: Retrieving %s
cs_cz: Získávání %s
de_de: Abrufen %s
hu_hu: %s visszaállítása
it_it: Ricevuto %s
lt_lt: Gaunama %s
nb_no: Henter %s
nl_nl: Ophalen %s
pt_pt: Buscando %s
sv_se: Hämtar %s
uk_ua: Отримання %s

# #32037
source: Remote.xml
cs_cz: Soubor Remote.xml

# #32038
source: Copy Selected Logs to SD Card Now
cs_cz: Kopírovat nyní vybrané Logy na SD kartu
de_de: Ausgewählte Logs jetzt auf die SD-Karte kopieren
hu_hu: Kiválasztott naplók másolása SD-kártyára most
it_it: Copia i Log sulla SD Card Adesso
lt_lt: Kopijuoti pasirinktus žurnalus į SD kortelę dabar
nb_no: Kopier valgte logger til SD-kort nå
nl_nl: Kopieer geselecteerde logs nu naar SD-kaart
pt_pt: Copiar Logs Selecionados para o Cartão de Memória Agora
sv_se: Kopiera nu valda loggfiler till minneskort
uk_ua: Скопіювати обрані журнали на SD-карту

# #32039
source: Copy Logs to SD Card Instead?
cs_cz: Místo toho kopírovat Logy na SD kartu?
de_de: Logs alternativ auf die SD-Karte kopieren?
hu_hu: A naplókat az SD-kártyára másolja helyette?
it_it: Copia i Log sulla SD Card?
lt_lt: Vietoje to kopijuoti žurnalus į SD kortelę?
nb_no: Kopier logger til SD-kort i stedet?
nl_nl: Logs naar SD-kaart kopiëren?
pt_pt: Prefere copiar os Logs para o cartão de memória?
sv_se: Kopiera loggfiler till minneskort istället?
uk_ua: Замість цього скопіювати журнали на SD-карту?

# #32040
source: Copy Complete
cs_cz: Kopírování dokončeno
de_de: Kopieren vollständig
hu_hu: Másolás befejezve
it_it: Copia Completata
lt_lt: Kopijavimas baigtas
nb_no: Kopiering sluttført
nl_nl: Kopiëren voltooid
pt_pt: Cópia Concluída
sv_se: Kopiering klar
uk_ua: Копіювання завершено

# #32041
source: Kernel Message Log (dmesg)
cs_cz: Soubor Kernel Message Log (dmesg)
hu_hu: Kernel üzenetnapló (dmesg)
it_it: Messaggi Log del Kernel (dsmeg)
lt_lt: Branduolio pranešimų žurnalas (dmesg)
nb_no: Kjernemeldingslog (dmesg)
nl_nl: Kernel berichtenlog (dmesg)
pt_pt: Log Kernel Message (dmesg)
sv_se: Kernel meddelande-logg (dmesg)
uk_ua: Журнал повідомлень ядра (dmesg)

# #32042
source: Display Info
cs_cz: Informace o displeji
de_de: Informationen anzeigen
hu_hu: Információ megjelenítése
it_it: Informazioni Display
lt_lt: Ekrano informacija
nb_no: Skjerm info
nl_nl: Scherminfo
pt_pt: Mostrar Info
uk_ua: Відомості про дисплей

# #32043
source: Network Interface Configuration
cs_cz: Nastavení síťového připojení
de_de: Netzwerkschnittstellen-Konfiguration
hu_hu: Hálózati interfész konfigurálása
it_it: Configurazioni Interfaccia di Rete
lt_lt: Tinklo sąsajos konfigūracija
nb_no: Nettverksgrensesnitt konfigurasjon
nl_nl: Netwerk interface configuratie
pt_pt: Configuração da Interface de Redes
sv_se: Nätverkskorts konfiguration
uk_ua: Конфігурація мережевого інтерфейсу

# #32044
source: GUISettings.xml (includes audio settings)
cs_cz: Soubor GUISettings.xml (včetně audio nastavení)
de_de: GUISettings.xml (beinhaltet die Audioeinstellungen)
hu_hu: GUISettings.xml (tartalmazza a hangbeállításokat)
it_it: GUISettings.xml (include impostazioni audio)
lt_lt: GUISettings.xml (įskaitant garso nustatymus)
nb_no: GUISettings.xml (inkluderer lydinnstillinger)
nl_nl: GUISettings.xml (inclusief audio-instellingen)
pt_pt: GUISettings.xml (inclui preferências audio)
sv_se: GUISettings.xml (inkluderar ljud inställningar)
uk_ua: GUISettings.xml (включаючи налаштування звуку)

# #32045
source: GUISettings (abridged)
cs_cz: GUISettings (zkráceně)
de_de: GUISettings (abgekürzt)
hu_hu: GUISettings (rövidítve)
it_it: GUISettings (ridotto)
lt_lt: GUISetings.xml (sutrumpintas)
nb_no: GUISettings (forkortet)
nl_nl: GUISettings (verkort)
pt_pt: GUISettings (resumido)
sv_se: GUISettings (förkortat)
uk_ua: GUISettings (скорочено)
