Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmccommon/resources/language/resource.language.*/strings.po
Languages: cs_cz, da_dk, de_de, hu_hu, it_it, lt_lt, nb_no, sl_si, sr_rs, sr_rs@latin, sv_se

# #32001
source: OSMC Log Uploader
cs_cz: Odeslání logu OSMC
da_dk: OSMC Logfil Uploader
de_de: OSMC-Protokoll-Uploader
hu_hu: OSMC naplófeltöltő
it_it: Invio Log di OSMC
lt_lt: OSMC žurnalo įkėlimo priemonė
nb_no: OSMC logfil opplaster
sl_si: Nalaganje OSMC dnevniških zapisov
sr_rs: Отпремање OSMC евиденције
sr_rs@latin: Otpremanje OSMC evidencije
sv_se: OSMC logguppladdning

# #32002
source: URL: %s
cs_cz: Spojení URL: %s
hu_hu: Hivatkozás: %s
lt_lt: URL adresas: %s
sl_si: POVEZAVA: %s

# #32003
source: Could not retrieve URL.
cs_cz: Nelze získat spojení URL.
da_dk: URL'en kunne ikke hentes.
de_de: URL konnte nicht abgerufen werden.
hu_hu: Nem sikerült lekérni a hivatkozást.
it_it: Impossibile recuperare l'URL.
lt_lt: Nepavyko gauti URL.
nb_no: Klarte ikke å koble til URL.
sl_si: Povezave ni mogoče vzpostaviti.
sr_rs: Није било могуће преузети URL.
sr_rs@latin: Nije bilo moguće preuzeti URL.
sv_se: Kunde inte ansluta till URL.

# #32004
source: Retrieving Logs
cs_cz: Získávám Logy
da_dk: Henter logfiler
de_de: Protokolle abrufen
hu_hu: Naplók lekérése
it_it: Recupero Log in corso
lt_lt: Gaunami žurnalai
nb_no: Henter logger
sl_si: Pridobivanje dnevniških zapisov
sr_rs: Преузимање евиденције
sr_rs@latin: Preuzimanje evidencije
sv_se: Hämtar loggfiler

# #32005
source: Combining and Writing Logs
cs_cz: Kombinování a zápis logů
da_dk: kombinerer og gemmer logfiler
de_de: Protokolle zusammenführen und schreiben
hu_hu: Naplók kombinálása és írása
it_it: Unione e scrittura dei Log
lt_lt: Apjungiami ir rašomi žurnalai
nb_no: Kombinerer og skriver logger
sl_si: Združevanje in korelacija dnevniških zapisov
sr_rs: Спајање и уписивање евиденције
sr_rs@latin: Spajanje i upisivanje evidencije
sv_se: Slår ihop och skriver loggfiler

# #32006
source: Retrieving %s
cs_cz: Získávání %s
da_dk: Henter %s
de_de: Abrufen %s
hu_hu: %s lekérése
it_it: Recupero %s
lt_lt: Gaunama %s
nb_no: Henter %s
sl_si: Prenos %s
sr_rs: Преузимање %s
sr_rs@latin: Preuzimanje %s
sv_se: Hämtar %s

# #32007
source: Copy Logs to SD Card Instead?
cs_cz: Místo toho zapsat Logy na SD kartu?
da_dk: Kopier logfiler til SD kort i stedet?
de_de: Protokolle alternativ auf die SD-Karte kopieren?
hu_hu: A naplókat SD-kártyára másolja helyette?
it_it: Copiare i Log sulla scheda SD?
lt_lt: Vietoj to nukopijuoti žurnalus į SD kortelę?
nb_no: Kopiere logger til SD-kort i stedet?
sl_si: Prenesem dnevniške zapise raje na spominsko kartico?
sr_rs: Копирај евиденцију на SD картицу?
sr_rs@latin: Kopiraj evidenciju na SD karticu?
sv_se: Kopiera loggfiler till SDkort istället?

# #32008
source: Copy Complete
cs_cz: Kopírování dokončeno
da_dk: Kopiering fuldført
de_de: Kopieren vollständig
hu_hu: Másolás kész
it_it: Copia Completata
lt_lt: Kopijavimas baigtas
nb_no: Kopiering sluttført
sl_si: Prenos končan
sr_rs: Копирање завршено
sr_rs@latin: Kopiranje završeno
sv_se: Kopiering klar

# #32009
source: Copying logs to %s
cs_cz: Kopírování logů na %s
da_dk: kopiere logfiler til %s
de_de: Kopiere Protokolle nach %s
hu_hu: Naplók másolása ide: %s
it_it: Copia dei log su %s
lt_lt: Kopijuojami žurnalai į %s
nb_no: Kopierer logger til %s
sl_si: Prenašam dnevniške zapise na %s
sr_rs: Копирање евиденције у %s
sr_rs@latin: Kopiranje evidencije u %s
sv_se: Kopierar loggfiler till %s

# #32010
source: Uploading logs
cs_cz: Odesílání logů
da_dk: Uploader logfiler
de_de: Protokolle hochladen
hu_hu: Naplók feltöltése
it_it: Invio log in corso
lt_lt: Įkeliami žurnalai
nb_no: Laster opp logger
sl_si: Nalagam dnevniške zapise
sr_rs: Отпремање евиденције
sr_rs@latin: Otpremanje evidencije
sv_se: Laddar upp loggfiler

# #32011
source: Upload Complete
cs_cz: Odeslání dokončeno
da_dk: Upload fuldført
de_de: Hochladen vollständig
hu_hu: Feltöltés elkészült
it_it: Invio Completato
lt_lt: Įkėlimas baigtas
nb_no: Opplasting sluttført
sl_si: Nalaganje končano
sr_rs: Отпремање завршено
sr_rs@latin: Otpremanje završeno
sv_se: Uppladdning komplett

# #32012
source: Log file too large, unable to complete upload.
hu_hu: A naplófájl túl nagy, ezért nem lehet befejezni a feltöltést.
it_it: File log troppo grande, impossibile completare l'invio.
sv_se: För stor loggfil, kunde inte slutför uppladdningen.
