Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.networking/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_br, sv_se, uk_ua

# #32001
source: Tethering
cs_cz: Sdílení připojení
hu_hu: Kötődés
nb_no: Internettdeling
pt_br: Roteamento
sv_se: Sammankoppla
uk_ua: Точка доступу

# #32002
source: Exit
cs_cz: Ukončit
de_de: Schließen
it_it: Esci
nl_nl: Verlaten
sv_se: Avsluta

# #32004
source: OSMC Network Setup
cs_cz: Nastavení sítě OSMC
de_de: OSMC-Netzwerkeinrichtung
hu_hu: OSMC hálózati beállítások
it_it: Configurazione Rete OSMC
lt_lt: OSMC tinklo sąranka
nb_no: OSMC nettverksoppsett
nl_nl: OSMC netwerkinstellingen
pt_br: Configurações de Rede do OSMC
sv_se: OSMC Nätverk inställningar
uk_ua: Налаштування мережі OSMC

# #32005
source: The address provided is not a valid IP address.
cs_cz: Zadaná adresa není platná adresa IP.
de_de: Die angegebene Adresse ist keine gültige IP-Adresse.
hu_hu: A megadott cím nem érvényes IP-cím.
it_it: L'indirizzo inserito non un indirizzo IP valido.
lt_lt: Pateiktas adresas nėra galiojantis IP adresas.
nb_no: Den oppgitte adressen er ikke en gyldig IP-adresse.
nl_nl: Het opgegeven adres is geen geldig IP-adres.
pt_br: O endereço fornecido não é um endereço IP válido.
sv_se: Den angivna adressen är inte en giltig IP-adress.
uk_ua: Вказано недійсну IP-адресу.

# #32006
source: Configure Network Manually
cs_cz: Nastavit síť ručně
de_de: Netzwerk manuell konfigurieren
hu_hu: Hálózat manuális konfigurálása
it_it: Configura la Rete Manualmente
lt_lt: Konfigūruoti tinklą rankiniu būdu
nb_no: Konfigurer nettverket manuelt
nl_nl: Netwerk handmatig configureren
pt_br: Configurar Rede Manualmente
sv_se: Manuell Närvärks konfigurering
uk_ua: Налаштувати мережу вручну

# #32007
source: IP Address
cs_cz: IP Adresa
de_de: IP-Adresse
hu_hu: IP cím
it_it: Indirizzo IP
lt_lt: IP adresas
nb_no: IP-adresse
nl_nl: IP-adres
pt_br: Endereço IP
sv_se: IP-adress
uk_ua: IP-адреса

# #32008
source: Subnet Mask
cs_cz: Maska podsítě
de_de: Subnetzmaske
hu_hu: Alhálózati maszk
lt_lt: Potinklio kaukė
nb_no: Nettverksmaske
nl_nl: Subnetmasker
pt_br: Máscara de Rede
sv_se: Nätverksmask
uk_ua: Маска підмережі

# #32009
source: Default Gateway
cs_cz: Výchozí brána
de_de: Standard-Gateway
hu_hu: Alapértelmezett átjáró
it_it: Gateway Predefinito
lt_lt: Numatytasis tinklų sietuvas
nb_no: Standard gateway
nl_nl: Standaard gateway
pt_br: Gateway Padrão
uk_ua: Шлюз по замовчуванням

# #32010
source: Primary DNS
cs_cz: Primární DNS
de_de: Primärer DNS
hu_hu: Elsődleges DNS
it_it: DNS Primario
lt_lt: Pirminis DNS
nb_no: Primær DNS
nl_nl: Primair DNS
pt_br: DNS Primário
sv_se: Primär DNS
uk_ua: Первинний DNS

# #32011
source: Secondary DNS
cs_cz: Sekundární DNS
de_de: Sekundärer DNS
hu_hu: Másodlagos DNS
it_it: DNS Secondario
lt_lt: Antrinis DNS
nb_no: Sekundær DNS
nl_nl: Secundair DNS
pt_br: DNS Secundário
sv_se: Sekundär DNS
uk_ua: Вторинний DNS

# #32012
source: Scan for connections
cs_cz: Vyhledej připojení
de_de: Nach Verbindungen suchen
hu_hu: Kapcsolatok keresése
it_it: Cerca reti
lt_lt: Nuskaityti ryšius
nb_no: Søk etter tilkoblinger
nl_nl: Scan voor verbindingen
pt_br: Buscar conexões
sv_se: Kolla uppkopplingen
uk_ua: Шукати мережі

# #32013
source: Set Password
cs_cz: Nastav heslo
de_de: Passwort einstellen
hu_hu: Jelszó használata
it_it: Imposta Password
lt_lt: Nustatyti slaptažodį
nb_no: Sett passord
nl_nl: Wachtwoord instellen
pt_br: Configurar Senha
sv_se: Sätt ett lösenord
uk_ua: Вкажіть пароль

# #32014
source: Refresh
cs_cz: Obnovit
de_de: Aktualisieren
hu_hu: Frissítés
it_it: Ricarica
lt_lt: Atnaujinti
nb_no: Last på nytt
nl_nl: Verversen
pt_br: Atualizar
sv_se: Uppdatera
uk_ua: Оновити

# #32015
source: Enable Bluetooth
cs_cz: Povolit Bluetooth
de_de: Bluetooth aktivieren
hu_hu: Bluetooth engedélyezése
it_it: Abilita Bluetooth
lt_lt: Įjungti Bluetooth
nb_no: Aktiver Bluetooth
nl_nl: Bluetooth inschakelen
pt_br: Habilitar Bluetooth
sv_se: Aktivera Bluetooth
uk_ua: Увімкнути Bluetooth

# #32016
source: Configuring...
cs_cz: Nastavování...
de_de: Einrichten...
hu_hu: Beállítás...
it_it: Configurazione...
lt_lt: Konfigūruojama...
nb_no: Konfigurering...
nl_nl: Configureren...
pt_br: Configurando...
sv_se: Konfigurerar...
uk_ua: Налаштування...

# #32017
source: Start/Stop Discovery
cs_cz: Start/Stop Vyhledávání
de_de: Suche beginnen/beenden
hu_hu: Indítás/Leállítás felfedezés
it_it: Inizia/Ferma Ricerca
lt_lt: Pradėti/sustabdyti aptikimą
nb_no: Start/Stopp Discovery
pt_br: Iniciar/Parar Descoberta
sv_se: Starta/Stoppa upptäckten
uk_ua: Увімкнути/вимкнути доступність

# #32018
source: Paired Devices
cs_cz: Spárovaná zařízení
de_de: Gekoppelte Geräte
hu_hu: Párosított eszközök
it_it: Dispositivi Accoppiati
lt_lt: Suporuoti įrenginiai
nb_no: Sammenkoblede enheter
nl_nl: Gekoppelde apparaten
pt_br: Dispositivos Pareados
sv_se: Parade enheter
uk_ua: З’єднані пристрої

# #32019
source: Available Devices
cs_cz: Dostupná zařízení
de_de: Verfügbare Geräte
hu_hu: Elérhető eszközök
it_it: Dispositivi Disponibili
lt_lt: Prieinami įrenginiai
nb_no: Tilgjengelige enheter
nl_nl: Beschikbare apparaten
pt_br: Dispositivos Disponíveis
sv_se: Tillgängliga enheter
uk_ua: Доступні пристрої

# #32020
source: Automatically configure the network toggle
cs_cz: Automaticky nastavit síťové přepínače
de_de: Umschalter für automatische Netzwerkkonfiguration
it_it: Configura automaticamente il toggle di rete
nl_nl: Automatisch configureren van de netwerkwissel
sv_se: Automatkonfigurering av nätverksväxling

# #32021
source: Remove device
cs_cz: Odpojit zařízení
de_de: Gerät entfernen
hu_hu: Eszköz törlése
it_it: Rimuovi Dispositivo
lt_lt: Pašalinti įrenginį
nb_no: Fjern enheter
nl_nl: Apparaat verwijderen
pt_br: Remover dispositivo
sv_se: Koppla ut enhet
uk_ua: Видалити пристрій

# #32022
source: Connect to device
cs_cz: Připojit k zařízení
de_de: Gerät verbinden
hu_hu: Csatlakozás az eszközhöz
it_it: Connetti al dispositivo
lt_lt: Prisijungti prie įrenginio
nb_no: Koble til enhet
nl_nl: Verbinden met apparaat
pt_br: Conectar ao dispositivo
sv_se: Koppla an till enhet
uk_ua: Підключитися до пристрою

# #32023
source: Paired successfully with
cs_cz: Úspěšně spárováno s
de_de: Kopplung erfolgreich mit
hu_hu: Sikeresen párosítva
it_it: Accoppiato con successo con
lt_lt: Sėkmingai suporuota su
nb_no: Vellykket sammenkobling med
nl_nl: Succesvol gekoppeld met
pt_br: Pareado com
sv_se: Par-koppling slutförd med
uk_ua: Успішно поєднано з

# #32024
source: Connection to
cs_cz: Připojení k
de_de: Verbindung zu
hu_hu: Kapcsolódás
it_it: Connessione con
lt_lt: Prisijungimas prie
nb_no: Kobling til
nl_nl: Verbinding met
pt_br: Conexão com
sv_se: Koppling mot
uk_ua: Підключення до

# #32025
source: failed
cs_cz: selhalo
de_de: fehlgeschlagen
hu_hu: sikertelen
it_it: fallita
lt_lt: nepavyko
nb_no: feilet
nl_nl: mislukt
pt_br: falha
sv_se: misslyckades
uk_ua: помилка

# #32026
source: Bluetooth Pairing
cs_cz: Párování Bluetooth
de_de: Bluetooth-Kopplung
hu_hu: Bluetooth párosítás
it_it: Accoppiamento Bluetooth
lt_lt: Bluetooth poravimas
nb_no: Bluetooth-sammenkobling
nl_nl: Bluetooth koppelen
pt_br: Pareamento Bluetooth
sv_se: Bluetooth par-koppling
uk_ua: Створення пари Bluetooth

# #32027
source: Please enter the following on the device
cs_cz: Na zařízení prosím zadejte následující údaje
de_de: Bitte das folgende im Gerät eingeben
hu_hu: Kérjük, adja meg a következőket a készüléken
it_it: Inserisci quanto segue sul dispositivo
lt_lt: Įveskite tai įrenginyje
nb_no: Skriv inn følgende på enheten
nl_nl: Voer het volgende in op het apparaat
pt_br: Por favor, digite o seguinte código no dispositivo
sv_se: Var god mata in följande på enheten
uk_ua: Введіть наступне на пристрої

# #32028
source: Authorize Service
cs_cz: Autorizovat službu
de_de: Dienst authorisieren
hu_hu: Szolgáltatás engedélyezése
it_it: Autorizza Servizio
lt_lt: Autorizuoti paslaugą
nb_no: Autoriser service
nl_nl: Service authoriseren
pt_br: Autorizar Serviço
sv_se: Auktoriserings tjänst
uk_ua: Авторизувати службу

# #32029
source: on device
cs_cz: na zařízení
de_de: auf dem Gerät
hu_hu: az eszközön
it_it: sul dispositivo
lt_lt: įrenginyje
nb_no: på enhet
nl_nl: op apparaat
pt_br: no dispositivo
sv_se: på enheten
uk_ua: на пристрої

# #32030
source: Enter PIN to Pair with
cs_cz: Vložte PIN pro spárování s
de_de: Eingabe der PIN zur Kopplung mit
hu_hu: PIN-kód megadása a Párosításhoz
it_it: Inserisci PIN per Accoppiare con
lt_lt: Įveskite PIN, kad suporuoti
nb_no: Skriv inn PIN-kode for å koble til
nl_nl: PIN invoeren om te koppelen met
pt_br: Digite o PIN para parear com
sv_se: Mata in PIN-kod för par-koppling
uk_ua: Введіть PIN-код для створення пари з

# #32031
source: Confirm passkey
cs_cz: Potvrďte přístupový klíč
de_de: Hauptschlüssel bestätigen
hu_hu: Kulcs megerősítése
it_it: Conferma passkey
lt_lt: Patvirtinkite prieigos raktą
nb_no: Bekreft passnøkkel
nl_nl: Bevestig wachtwoord
pt_br: Confirme a senha
sv_se: Bekräfta säkerhetsnyckeln
uk_ua: Підтвердьте пароль

# #32032
source: for
cs_cz: pro
de_de: für
it_it: per
nl_nl: voor
pt_br: para
sv_se: för
uk_ua: для

# #32033
source: Configure Network Using DHCP
cs_cz: Nastavení sítě pomocí DHCP
de_de: Netzwerk unter Nutzung von DHCP einrichten
hu_hu: Hálózat konfigurálása DHCP használatával
it_it: Configura la Rete Usando DHCP
lt_lt: Konfigūruoti tinklą naudojant DHCP
nb_no: Konfigurer nettverk ved hjelp av DHCP
nl_nl: Netwerk instellen via DHCP
pt_br: Configurar Rede Usando DHCP
sv_se: Konfigurera nätverket med DHCP
uk_ua: Налаштувати мережу за допомогою DHCP

# #32034
source: Apply
cs_cz: Použít
de_de: Anwenden
hu_hu: Alkalmaz
it_it: Applica
lt_lt: Pritaikyti
nb_no: Bruk
nl_nl: Toepassen
pt_br: Aplicar
sv_se: Verkställ
uk_ua: Застосувати

# #32035
source: Reset
cs_cz: Resetovat
de_de: Zurücksetzen
hu_hu: Visszaállítás
it_it: Ripristina
lt_lt: Nustatyti iš naujo
nb_no: Nullstill
pt_br: Resetar
sv_se: Återställ
uk_ua: Скинути

# #32036
source: NFS Network Settings
cs_cz: Nastavení sítě NFS
de_de: NFS-Netzwerkeinstellungen
hu_hu: NFS hálózati beállítások
it_it: Impostazioni di Rete NFS
lt_lt: NFS tinklo nustatymai
nb_no: NFS Nettverksinnstillinger
nl_nl: NFS netwerkinstellingen
pt_br: Configurações de Rede NFS
sv_se: NFS nätverks inställningar
uk_ua: Налаштування мережі NFS

# #32037
source: Your Settings will not take effect until you reboot. Reboot Now?
cs_cz: Vaše nastavení se projeví až po restartu. Restartovat nyní?
de_de: Die Einstellungen werden erst bei einem Neustart übernommen. Jetzt neustarten?
hu_hu: A beállítások csak az újraindítás után lépnek érvénybe. Újraindítja most a rendszert?
it_it: Le impostazioni non saranno attive senza un riavvio. Riavvio Adesso?
lt_lt: Jūsų nustatymai neįsigalios, kol nepaleisite iš naujo. Paleisti iš naujo dabar?
nb_no: Innstillingene dine trer ikke i kraft før du starter på nytt. Starte på nytt nå?
nl_nl: Je instellingen worden pas toegepast na een herstart. Nu herstarten?
pt_br: Suas configurações não terão efeito até que você reinicie. Reiniciar agora?
sv_se: Dina inställningar verkställs först efter omstart. Starta om nu?
uk_ua: Налаштування набудуть чинності після перезавантаження системи. Перезавантажити зараз?

# #32038
source: The displayed network configuration may be out dated - A reboot is recommended before proceeding
cs_cz: Zobrazená konfigurace sítě může být zastaralá - Než budete pokračovat, doporučujeme restartovat počítač
de_de: Die angezeigten Netzwerkeinstellungen könnten nicht aktuell sein - Ein Neustart wird vor dem Fortsetzen empfohlen
hu_hu: A megjelenített hálózati konfiguráció elavult lehet - A folytatás előtt ajánlott az újraindítás
it_it: Le impostazioni di rete mostrate possono essere non più valide - Un riavvio è raccomandato prima di procedere
lt_lt: Rodoma tinklo konfigūracija gali būti pasenusi - prieš tęsiant rekomenduojama paleisti iš naujo
nb_no: Den viste nettverkskonfigurasjonen kan være utdatert - Det anbefales å starte på nytt før du fortsetter
nl_nl: De weergegeven netwerkconfiguratie kan verouderd zijn - een herstart wordt aanbevolen voor je verder gaat
pt_br: A configuração de rede exibida pode estar desatualizada - Recomenda-se reinicializar antes de continuar
sv_se: Påvisad nätverkskonfiguration kan vara gammal - Omstart rekommenderas innan du fortsätter
uk_ua: Показана конфігурація мережі може бути застарілою. Перед продовженням рекомендується перезавантажити систему

# #32039
source: Enable Adapter
cs_cz: Povolit adaptér
de_de: Adapter aktivieren
hu_hu: Adapter engedélyezése
it_it: Abilita Adattatore
lt_lt: Įgalinti adapterį
nb_no: Aktiver adapter
nl_nl: Adapter inschakelen
pt_br: Habilitar Adaptador
sv_se: Aktivera enhet
uk_ua: Увімкнути адаптер

# #32040
source: Do not connect this device to a wired network with a DHCP server
cs_cz: Nepřipojujte toto zařízení ke kabelové síti se serverem DHCP
de_de: Dieses Gerät nicht mit einem Kabelnetzwerk mit DHCP-Server verbinden
hu_hu: Ne csatlakoztassa ezt az eszközt DHCP-kiszolgálóval rendelkező vezetékes hálózathoz
it_it: Non connettere questo dispositivo a una rete cablata con un server DHCP
lt_lt: Nejunkite šio įrenginio prie laidinio tinklo naudodami DHCP serverį
nb_no: Ikke koble denne enheten til et kablet nettverk med en DHCP-server
nl_nl: Verbind dit apparaat niet met een bedraad netwerk met een DHCP server
pt_br: Não conecte este dispositivo a uma rede cabeada com um servidor DHCP
sv_se: Koppla inte in denna enhet på ett nät med befintlig DHCP server
uk_ua: Не підключайте цей пристрій до дротової мережі з сервером DHCP

# #32041
source: Wireless
cs_cz: Bezdrátové
de_de: Drahtlos
hu_hu: Vezeték nélküli kapcsolat
lt_lt: Belaidis
nb_no: Trådløst
nl_nl: Draadloos
pt_br: Sem Fio
sv_se: Trådlös
uk_ua: Бездротова

# #32042
source: Disconnect from
cs_cz: Odpojeno od
de_de: Trennen von
hu_hu: Kapcsolódás megszakítása
it_it: Disconnetti da
lt_lt: Atsijungti nuo
nb_no: Koble fra
nl_nl: Verbreek verbinding met
pt_br: Desconectar de
sv_se: Koppla ner från
uk_ua: Відключитися від

# #32043
source: Connected or not connected
cs_cz: Připojeno nebo nepřipojeno
de_de: Verbunden oder nicht verbunden
it_it: Connesso o non connesso
nl_nl: Verbonden of niet verbonden
sv_se: Uppkopplad eller inte

# #32044
source: Status
cs_cz: Stav
hu_hu: Állapot
it_it: Stato
lt_lt: Būsena
uk_ua: Стан

# #32045
source: Checking....
cs_cz: Kontrola....
de_de: Prüfen...
hu_hu: Ellenőrzés....
it_it: Controllo...
lt_lt: Tikrinama....
nb_no: Sjekker…
nl_nl: Controleren...
pt_br: Verificando...
sv_se: Undersöker....
uk_ua: Перевірка...

# #32046
source: Connected
cs_cz: Připojeno
de_de: Verbunden
hu_hu: Kapcsolódva
it_it: Connesso
lt_lt: Prisijungta
nb_no: Tilkoblet
nl_nl: Verbonden
pt_br: Conectado
sv_se: Uppkopplad
uk_ua: Підключено

# #32047
source: No internet
cs_cz: Bez internetu
de_de: Kein Internet
hu_hu: Nincs internet
lt_lt: Nėra interneto
nb_no: Ingen Internett
nl_nl: Geen internet
pt_br: Sem internet
sv_se: Inget internet
uk_ua: Без Інтернету

# #32048
source: Disabled
cs_cz: Zakázáno
de_de: Deaktiviert
hu_hu: Letíltva
it_it: Disattivato
lt_lt: Išjungta
nb_no: Deaktivert
nl_nl: Uitgeschakeld
pt_br: Desabilitado
sv_se: Avaktiverad
uk_ua: Вимкнено

# #32049
source: No wired connection
cs_cz: Bez připojení kabelem
de_de: Keine Kabelverbindung
hu_hu: Nincs vezetékes kapcsolat
it_it: Nessuna connessione cablata
lt_lt: Nėra laidinio ryšio
nb_no: Ingen kablet tilkobling
nl_nl: Geen bedrade verbinding
pt_br: Sem conexão cabeada
sv_se: Ingen trådbunden kontakt
uk_ua: Немає дротового підключення

# #32050
source: No wireless connection
cs_cz: Bez bezdrátového připojení
de_de: Keine drahtlose Verbindung
hu_hu: Nincs vezetéknélküli kapcsolat
it_it: Nessuna connessione wireless
lt_lt: Nėra belaidžio ryšio
nb_no: Ingen trådløs tilkobling
nl_nl: Geen draadloze verbinding
pt_br: Sem conexão sem fio
sv_se: Ingen trådlös kontakt
uk_ua: Немає бездротового підключення

# #32051
source: Cancel
cs_cz: Zrušit
de_de: Abbrechen
hu_hu: Mégse
it_it: Annulla
lt_lt: Atšaukti
nb_no: Avbryt
nl_nl: Annuleren
pt_br: Cancelar
sv_se: Avbryt
uk_ua: Скасувати

# #32052
source: Connect to
cs_cz: Připojit k
de_de: Verbinden mit
hu_hu: Kapcsolódás
it_it: Connetti a
lt_lt: Prisijungti prie
nb_no: Koble til
nl_nl: Verbinden met
pt_br: Conectar a
sv_se: Koppla upp mot
uk_ua: Підключитися до

# #32053
source: Please disconnect from the current network before connecting to a different one
cs_cz: Před připojením k jiné síti se prosím odpojte od aktuální sítě
de_de: Bitte vor dem Verbinden mit einem anderen Netzwerk vom momentanen trennen
hu_hu: Kérjük, válassza le a jelenlegi hálózatot, mielőtt egy másik hálózathoz csatlakozna
it_it: Disconnettiti dalla rete attuale prima di connetterti ad una differente
lt_lt: Prieš prisijungdami prie kito tinklo, atsijunkite nuo dabartinio tinklo
nb_no: Koble fra det nåværende nettverket før du kobler til et annet
nl_nl: Verbreek de verbinding met het huidige netwerk voordat je verbindt met een andere
pt_br: Desconecte-se da rede atual antes de conectar-se a outra
sv_se: Var god koppla ifrån befintligt nätverk innan anslutning sker till ett annat nätverk
uk_ua: Відключіться від поточної мережі перед підключенням до іншої

# #32054
source: Wait for Network
cs_cz: Čekání na síť
de_de: Auf Netzwerk warten
hu_hu: Várakozás a hálózatra
it_it: Attendi Rete
lt_lt: Laukti tinklo
nb_no: Vent på nettverket
nl_nl: Wachten op netwerk
pt_br: Aguardando Rede
sv_se: Väntar på nätverk
uk_ua: Очікувати на мережу

# #32055
source: No
cs_cz: Ne
de_de: Nein
hu_hu: Nem
lt_lt: Ne
nb_no: Nei
nl_nl: Nee
pt_br: Não
sv_se: Nej
uk_ua: Ні

# #32056
source: Pair and connect
cs_cz: Párovat a připojit
de_de: Pairen und verbinden
it_it: Accoppia e connetti
nl_nl: Koppelen en verbinden
sv_se: Par-koppla och anslut

# #32057
source: Connect without PIN
cs_cz: Připojení bez PINu
de_de: Ohne PIN verbinden
hu_hu: Kapcsolódás PIN-kód nélkül
it_it: Connetti senza PIN
lt_lt: Prisijungti be PIN
nb_no: Koble til uten PIN-kode
nl_nl: Koppelen zonder PIN
pt_br: Conectar sem PIN
sv_se: Anslut utan PIN
uk_ua: Підключитись без PIN-коду

# #32058
source: Disconnect
cs_cz: Odpojit
de_de: Trennen
hu_hu: Leválasztás
it_it: Disconnetti
lt_lt: Atsijungti
nb_no: Koble fra
nl_nl: Verbinding verbreken
pt_br: Desconectar
sv_se: Koppla ner
uk_ua: Відключитись

# #32059
source: Disconnect and Forget
cs_cz: Odpojit a zapomenout
de_de: Trennen und vergessen
hu_hu: Leválasztás és elfelejtés
it_it: Disconnetti e Dimentica
lt_lt: Atsijungti ir pamiršti
nb_no: Koble fra og glem
nl_nl: Verbinding verbreken en vergeten
pt_br: Desconectar e Esquecer
sv_se: Koppla ner och glöm
uk_ua: Відключитись і забути

# #32060
source: Wired
cs_cz: Kabelem
de_de: Verkabelt
hu_hu: Kábellel kapcsolódva
it_it: Cablata
lt_lt: Laidinis
nb_no: Kablet
nl_nl: Bedraad
pt_br: Com Fio
sv_se: Kabelbunden
uk_ua: Дротова

# #32061
source: Hotspot SSID
cs_cz: SSID hotspotu
hu_hu: Kapcsolódási pont SSID
it_it: SSID Hotspot
lt_lt: Viešosios interneto prieigos taško SSID
pt_br: SSID do Hotspot
uk_ua: SSID точки доступу

# #32062
source: Hotspot passphrase
cs_cz: Heslo hotspotu
de_de: Hotspot-Passwort
hu_hu: Kapcsolódási pont jelszava
it_it: Passphrase Hotspot
lt_lt: Viešosios interneto prieigos taško slaptafrazė
nb_no: Hotspot passordfrase
nl_nl: Hotspot wachtwoord
pt_br: Senha do Hotspot
sv_se: Hotspots lösenord
uk_ua: Пароль для точки доступу

# #32063
source: Portable Hotspot
cs_cz: Přenosný hotspot
de_de: Tragbarer Hotspot
hu_hu: Hordozható kapcsolódási pont
it_it: Hotspot Portatile
lt_lt: Nešiojamas viešosios interneto prieigos taškas
nb_no: Mobilt hotspot
nl_nl: Draagbare hotspot
pt_br: Hotspot Portátil
sv_se: Flyttbar Hotspot
uk_ua: Портативна точка доступу

# #32064
source: Ethernet to WiFi
cs_cz: Ethernet do WiFi
de_de: Ethernet zu WiFi
hu_hu: Kábelről WiFi-re
it_it: Ethernet a WiFi
nb_no: Ethernet til WiFi
nl_nl: Ethernet nar WiFi
pt_br: Ethernet para WiFi
sv_se: Ethernet till WiFi
uk_ua: Ethernet у WiFi

# #32065
source: WiFi to Ethernet
cs_cz: WiFi do Ethernetu
de_de: WiFi zu Ethernet
hu_hu: WiFi-ről Kábelre
it_it: WiFi a Ethernet
nb_no: WiFi til Ethernet
nl_nl: WiFi naar Ethernet
pt_br: WiFi para Ethernet
sv_se: WiFi till Ethernet
uk_ua: WiFi в Ethernet

# #32066
source: Enable
cs_cz: Povolit
de_de: Aktivieren
hu_hu: Engedélyezés
it_it: Abilita
lt_lt: Įjungti
nb_no: Aktiver
nl_nl: Inschakelen
pt_br: Habilitar
sv_se: Aktivera
uk_ua: Увімкнути

# #32067
source: Disable
cs_cz: Zakázat
de_de: Deaktivieren
hu_hu: Letiltás
it_it: Disabilita
lt_lt: Išjungti
nb_no: Deaktiver
nl_nl: Uitschakelen
pt_br: Desabilitar
sv_se: Avaktivera
uk_ua: Вимкнути

# #32068
source: Enter new SSID
cs_cz: Vložit nové SSID
de_de: Neue SSID eingeben
hu_hu: Új SSID megadása
it_it: Inserisci nuovo SSID
lt_lt: Įveskite naują SSID
nb_no: Skriv inn ny SSID
nl_nl: Voer nieuwe SSID in
pt_br: Digite novo SSID
sv_se: Ange ny SSID
uk_ua: Введіть новий SSID

# #32069
source: Enter new passphrase
cs_cz: Vložte nové heslo
de_de: Neues Passwort eingeben
hu_hu: Új jelszó megadása
it_it: Inserisci nuova passphrase
lt_lt: Įveskite naują slaptafrazę
nb_no: Skriv inn ny passordfrase
nl_nl: Voer nieuw wachtwoord in
pt_br: Digite nova senha
sv_se: Ange nytt lösenord
uk_ua: Введіть новий пароль

# #32070
source: SSID must be set to enable WiFi Tethering
cs_cz: SSID musí být nastaven pro povolení Tethering WiFi
de_de: SSID muss für das Aktivieren von WiFi-Tethering gesetzt sein
hu_hu: A WiFi Internetmegosztás engedélyezéséhez be kell állítani az SSID-t
it_it: SSID deve essere impostato per abilitare il Tethering
nb_no: SSID må være angitt for å aktivere WiFi-internettdeling
nl_nl: SSID moet ingesteld zijn voor WiFi tethering
pt_br: O SSID deve ser configurado para habilitar o Hotspot WiFi
sv_se: SSID måste anges för att aktiver WiFi-tjudring (tethering)
uk_ua: Щоб увімкнути точку доступу Wi-Fi, потрібно вказати SSID

# #32071
source: Passphrase must at least 8 characters long
cs_cz: Heslo musí mít alespoň 8 znaků
de_de: Passwort muss mindest 8 Zeichen lang sein
hu_hu: A jelszónak legalább 8 karakter hosszúnak kell lennie
it_it: Passphrase deve essere di almeno 8 caratteri
lt_lt: Slaptafrazė turi būti bent 8 simbolių ilgio
nb_no: Passordfrase må være minst 8 tegn langt
nl_nl: Wachtwoord moet tenminste 8 tekens lang zijn
pt_br: A senha deve ter ao menos 8 caracteres
sv_se: Lösenordet måste vara minst 8 tecken
uk_ua: Пароль має містити щонайменше 8 символів

# #32072
source: Error enabling hotspot - see log for details
cs_cz: Chyba při povolení hotspotu - podrobnosti viz protokol
de_de: Fehler beim Aktivieren des Hotspots - siehe Protokoll für Details
hu_hu: Hiba a kapcsolódási pont engedélyezésében - részletek a naplóban
it_it: Errore durante l'attivazione dell'hotspot - vedere il log per i dettagli
lt_lt: Įgalinant viešosios interneto prieigos tašką įvyko klaida - išsamesnės informacijos ieškokite žurnale
nb_no: Feil ved aktivering av hotspot - se logg for detaljer
nl_nl: Fout bij inschakelen hotspot - zie log voor details
pt_br: Erro ao habilitar o hotspot - Veja log para detalhes
sv_se: Fel vid hotspot aktivering - se loggfiler för detaljer
uk_ua: Не вдалося увімкнути точки доступу. Подробиці див. в журналі

# #32073
source: Enter SSID to connect to this hidden network
cs_cz: Zadejte SSID pro připojení k této skryté síti
de_de: SSID zum Verbinden zu diesem verborgenen Netzwerk eingeben
hu_hu: Adja meg az SSID-t a rejtett hálózathoz való csatlakozáshoz
it_it: Immettere SSID per connettersi a questa rete nascosta
lt_lt: Įveskite SSID, jei norite prisijungti prie šio paslėpto tinklo
nb_no: Skriv inn SSID for å koble til dette skjulte nettverket
nl_nl: Voer SSID in om te verbinden met dit verborgen netwerk
pt_br: Digite o SSID para se conectar a esta rede oculta
sv_se: Ange SSID för anslutning mot detta gömda nätverk
uk_ua: Щоб підключитися до цієї прихованої мережі, введіть її SSID
