Repository: osmc/osmc
Catalog: package/mediacenter-addon-osmc/src/script.module.osmcsetting.networking/resources/language/resource.language.*/strings.po
Languages: cs_cz, de_de, hu_hu, it_it, lt_lt, nb_no, nl_nl, pt_br, sv_se, uk_ua

# #32074
source: Passphrase must be 63 characters or less
cs_cz: Heslo musí mít maximálně 63 znaků
de_de: Passwort muss 63 Zeichen oder weniger haben
hu_hu: A jelszónak legfeljebb 63 karakterből kell állnia
it_it: La passphrase deve avere 63 caratteri o meno
lt_lt: Slaptafrazę turi sudaryti 63 ar mažiau simbolių
nb_no: Passordfrase må inneholde maks 63 tegn
nl_nl: Wachtwoord mag maximaal 63 tekens lang zijn
pt_br: A senha deve ter menos de 64 caracteres
sv_se: Lösenordet måste var 63 tecken eller mindre
uk_ua: Парольна фраза має містити 63 символи або менше

# #32075
source: Re-connect
cs_cz: Znovu připojit
de_de: Wiederverbinden
hu_hu: Újrakapcsolódás
it_it: Riconnetti
lt_lt: Prisijungti iš naujo
nb_no: Koble til på nytt
nl_nl: Opnieuw verbinden
pt_br: Reconectar
sv_se: Återanslut
uk_ua: Повторно підключитись

# #32076
source: configuring
cs_cz: nastavování
de_de: konfiguriere
hu_hu: konfigurálás
it_it: configurando
lt_lt: konfigūruojama
nb_no: konfigurere
nl_nl: configureert
pt_br: configurando
sv_se: konfigurering
uk_ua: налаштування

# #32078
source: OSMC has detected MySQL details in your advancedsettings file and turned on "Waiting for Network" at boot. MySQL connection issues may be resolved on reboot.
cs_cz: OSMC zjistilo podrobnosti MySQL ve vašem souboru advancedsettings.xml a zapnulo „Čekání na síť“ při spouštění . Problémy s připojením MySQL mohou být vyřešeny po restartu.
de_de: OSMC hat MySQL-Details in der Advancedsettings-Datei festgestellt und "Auf Netzwerk warten" beim Hochfahren aktiviert. MySQL-Verbindungsprobleme könnten beim Neustarten behoben sein.
hu_hu: Az OSMC észlelte a MySQL adatait az Ön részletes beállítások fájljában, és bekapcsolta a "Hálózatra várva" opciót a rendszerindításkor. A MySQL-kapcsolat problémái újraindításkor megoldódhatnak.
it_it: OSMC ha trovato impostazioni MySQL nel file advancedsettings e ha abilitato "Attendi rete" all'avvio. Problemi di connessione a MySQL potrebbero risolversi al riavvio.
lt_lt: OSMC aptiko MySQL duomenis jūsų išplėstinių nustatymų faile ir įkrovimo metu įjungė „Laukti tinklo“ nustatymą. MySQL ryšio problemos gali būti išspręstos paleidus iš naujo.
nb_no: OSMC har oppdaget MySQL detaljer i filen for forhåndsinnstillinger og slått på "Venter på nettverk" ved oppstart. MySQL tilkoblingsproblemer kan løses ved omstart.
nl_nl: OSMC vond MySQL-gegevens in je advancedsettings-bestand, daarom is 'Wachten op netwerk' ingeschakeld bij opstarten. MySQL verbindingsproblemen zijn mogelijk opgelost na herstart.
pt_br: OSMC detectou detalhes do MySQL em seu arquivo advancedsettings e ativou o "Aguardando rede" na inicialização. Os problemas de conexão do MySQL podem ser resolvidos na reinicialização.
sv_se: OSMC har upptäckt MySQL detaljer i din advancesettings.xml och aktivera därigenom "Vänta på nätverk" vid uppstart. MySQL anslutnings problam bör vara löst vid omstart.
uk_ua: OSMC виявив дані MySQL у файлі додаткових налаштувань і ввімкнув параметр «Очікувати на мережу» під час завантаження. Проблеми з підключенням MySQL можуть бути вирішені під час перезавантаження.

# #32079
source: Undo
cs_cz: Zpět
de_de: Rückgängig
hu_hu: Visszavonás
it_it: Annulla
lt_lt: Anuliuoti
nb_no: Angre
nl_nl: Ongedaan maken
pt_br: Desfazer
sv_se: Ångra
uk_ua: Скасувати

# #32080
source: OK
cs_cz: Hotovo
lt_lt: Gerai
uk_ua: ОК

# #32082
source: MySQL settings are incomplete.
cs_cz: Nastavení MySQL je neúplné.
de_de: MySQL-Einstellungen sind unvollständig.
hu_hu: A MySQL beállításai hiányosak.
it_it: Le impostazioni di MySQL sono incomplete.
lt_lt: MySQL nustatymai nepilni.
nb_no: MySQL innstillingene er ufullstendige.
nl_nl: MySQL-instellingen zijn onvolledig.
pt_br: As configurações MySQL estão incompletas.
sv_se: MySQL inställningarna är inte kompletta.
uk_ua: Налаштування MySQL неповні.

# #32083
source: Discard MySQL settings changes?
cs_cz: Zrušit změny v nastavení MySQL?
de_de: Änderungen der MySQL-Einstellungen verwerfen?
hu_hu: A MySQL-beállítások módosításainak elvetése?
it_it: Eliminare le modifiche alle impostazioni MySQL?
lt_lt: Atmesti MySQL nustatymų pakeitimus?
nb_no: Vil du forkaste endringer i MySQL innstillinger?
nl_nl: Wijzigingen in MySQL-instellingen verwijderen?
pt_br: Descartar alterações nas configurações MySQL?
sv_se: Ignorera förändringar i MySQL inställningarna?
uk_ua: Скасувати зміни налаштувань MySQL?

# #32084
source: Writing to advancedsettings.xml failed: Permission restrictions
cs_cz: Zápis do advancedsettings.xml selhal: Omezené oprávnění
de_de: Schreiben in advancedsettings.xml fehlgeschlagen: Beschränkte Berechtigungen
hu_hu: Az advancedsettings.xml-be való írás sikertelen: Engedélykorlátozások
it_it: Scrittura in advancedsettings.xml non riuscita: restrizioni di autorizzazione
lt_lt: Nepavyko įrašyti į advancedsettings.xml: leidimų apribojimai
nb_no: Å skrive til advancedsettings.xml mislyktes: Tillatelsesbegrensninger
nl_nl: Schrijven naar advancedsettings.xml mislukt: Permissiebeperkingen
pt_br: A escrita ao advancedsettings.xml falhou: Restrições de permissões
sv_se: Försök att skriva till advancedsettings.xml misslyckades: Fil rättighets problem
uk_ua: Помилка запису в advancedsettings.xml: доступ обмежений

# #32085
source: Will you allow OSMC to change those restrictions?
cs_cz: Povolíte OSMC změnit tato oprávnění?
de_de: OSMC das Ändern dieser Berechtigungen erlauben?
hu_hu: Engedélyezi, hogy az OSMC megváltoztassa ezeket a korlátozásokat?
it_it: Consenti a OSMC di modificare tali restrizioni?
lt_lt: Ar leisite OSMC pakeisti šiuos apribojimus?
nb_no: Vil du tillate OSMC å endre disse begrensningene?
nl_nl: Mag OSMC deze beperkingen aanpassen?
pt_br: Você permitirá que o OSMC altere estas restrições?
sv_se: Tillåter du att OSMC ändrar de begränsningarna?
uk_ua: Дозволити OSMC змінити ці обмеження?

# #32086
source: Failed to change permission restrictions.
cs_cz: Chyba při změně omezení oprávnění.
de_de: Ändern der Berechtigungsbeschränkungen fehlgeschlagen.
hu_hu: Nem sikerült megváltoztatni az engedélyezési korlátozásokat.
it_it: Impossibile modificare le restrizioni di autorizzazione.
lt_lt: Nepavyko pakeisti leidimų apribojimų.
nb_no: Kunne ikke endre tillatelsesbegrensninger.
nl_nl: Aanpassen permissiebeperkingen mislukt.
pt_br: Falha ao alterar restrições de permissões.
sv_se: Misslyckades att ändra begränsningar i fil-rättigheterna.
uk_ua: Не вдалося змінити обмеження дозволу.

# #32087
source: More details may be found in the log.
cs_cz: Více detailů lze najít v logu.
de_de: Weitere Details können im Protokoll gefunden werden.
hu_hu: További részletek a naplóban találhatók.
it_it: Maggiori dettagli possono essere trovati nel log.
lt_lt: Daugiau informacijos galima rasti žurnale.
nb_no: Flere detaljer finnes i loggen.
nl_nl: Meer details vind je in het log.
pt_br: Maiores detalhes podem ser encontrados no log.
sv_se: Mer detaljer kan ses i loggfilen.
uk_ua: Більш детальну інформацію див. у журналі.

# #32088
source: Failed to write to advancedsettings.xml again.
cs_cz: Chyba při opakovaném zápisu do advancedsettings.xml.
de_de: Schreiben in advancedsettings.xml erneut fehlgeschlagen.
hu_hu: Nem sikerült újra írni az advancedsettings.xml-be.
it_it: Scrittura in advancedsettings.xml fallita nuovamente.
lt_lt: Vėl nepavyko įrašyti į advancedsettings.xml.
nb_no: Kunne ikke skrive til advancedsettings.xml igjen.
nl_nl: Schrijven naar advancedsettings.xml opnieuw mislukt.
pt_br: Falha ao escrever ao advancedsettings.xml novamente.
sv_se: Misslyckades skriva till advancedsettings.xml igen.
uk_ua: Знову не вдалося записати в advancedsettings.xml.

# #32089
source: Failed to change file permissions.
cs_cz: Chyba při změně oprávnění souboru.
de_de: Ändern der Berechtigungen fehlgeschlagen.
hu_hu: Nem sikerült megváltoztatni a fájljogosultságokat.
it_it: Impossibile modificare le autorizzazioni dei file.
lt_lt: Nepavyko pakeisti failo leidimų.
nb_no: Kunne ikke endre filtillatelser.
nl_nl: Wijzigen bestandspermissies mislukt.
pt_br: Falha ao alterar as permissões do arquivo.
sv_se: Ändring av fil-rättigheter misslyckades.
uk_ua: Не вдалося змінити дозволи на файл.

# #32090
source: Please Enter MySQL Username
cs_cz: Prosím vložte uživatelské jméno MySQL
de_de: Bitte MySQL-Nutzername eingeben
hu_hu: Kérjük, adja meg a MySQL felhasználónevet
it_it: Inserisci Nome Utente MySQL
lt_lt: Įveskite MySQL vartotojo vardą
nb_no: Skriv inn brukernavn for MySQL
nl_nl: Invoeren MySQL gebruikersnaam
pt_br: Digite o Usuário MySQL
sv_se: Var god ange MySQL användare
uk_ua: Введіть ім’я користувача MySQL

# #32091
source: Please Enter MySQL Password
cs_cz: Prosím vložte heslo pro MySQL
de_de: Bitte MySQL-Passwort eingeben
hu_hu: Kérjük, adja meg a MySQL jelszót
it_it: Inserisci Password MySQL
lt_lt: Įveskite MySQL slaptažodį
nb_no: Skriv inn passord for MySQL
nl_nl: Invoeren MySQL wachtwoord
pt_br: Digite a Senha MySQL
sv_se: Var god ange MySQL lösenord
uk_ua: Введіть пароль MySQL

# #32092
source: Please Enter MySQL Port Number
cs_cz: Prosím vložte číslo portu MySQL
de_de: Bitte MySQL-Portnummer eingeben
hu_hu: Kérjük, adja meg a MySQL port számát
it_it: Inserisci Numero Porta MySQL
lt_lt: Įveskite MySQL prievado numerį
nb_no: Skriv inn portnummer for MySQL
nl_nl: Invoeren MySQL poortnummer
pt_br: Digite a Porta MySQL
sv_se: Var god ange MySQL anslutnings port
uk_ua: Введіть номер порту MySQL

# #32093
source: Please Enter New Name
cs_cz: Prosím vložte nové jméno
de_de: Bitte neuen Namen eingeben
hu_hu: Kérjük, adja meg az új nevet
it_it: Inserisci Nuovo Nome
lt_lt: Įveskite naują vardą
nb_no: Skriv inn nytt navn
nl_nl: Invoeren nieuwe naam
pt_br: Digite o Novo Nome
sv_se: Var god ange nytt namn
uk_ua: Введіть нове ім’я

# #32094
source: Forget %s?
cs_cz: Zapomenout %s?
de_de: %s vergessen?
hu_hu: %s elfelejtése?
it_it: Dimentica %s?
lt_lt: Pamiršti %s?
nb_no: Glem %s?
nl_nl: Vergeet %s?
pt_br: Esquecer %s?
sv_se: Glömma %s?
uk_ua: Забули %s?

# #32095
source: Enable MySQL Video Database
cs_cz: Povolit video databázi MySQL
de_de: MySQL-Videodatenbank aktivieren
it_it: Abilita Database Video MySQL
nl_nl: Inschakelen MySQL videodatabase
sv_se: Aktivera MySQL videodatabas

# #32096
source: Name
cs_cz: Jméno
it_it: Nome
nl_nl: Naam
sv_se: Namn

# #32098
source: IP Address
cs_cz: IP Adresa
de_de: IP-Adresse
it_it: Indirizzo IP
nl_nl: IP-adres
sv_se: IP-adress

# #32100
source: User
cs_cz: Uživatel
de_de: Anwender
it_it: Utente
nl_nl: Gebruiker
sv_se: Användare

# #32102
source: Import Watched State
cs_cz: Načíst Stav shlédnutí
de_de: 'Gesehen'-Status importieren
it_it: Importa Stato Guardato
nl_nl: Importeer bekeken-status
sv_se: Importera "Tittat-status"

# #32103
source: Import Resume Points
cs_cz: Načíst Body obnovení
de_de: Fortsetzungspunkte importieren
it_it: Importa Punti di Ripristino
nl_nl: Importeer hervattingspunten
sv_se: Importera återupptagnings punkter

# #32104
source: Enable MySQL MusicDB
cs_cz: Povolit MySQL MusicDB
de_de: MySQL-Musikdatenbank aktivieren
it_it: Abilita Database Musica MySQL
nl_nl: Inschakelen MySQL muziekdatabase
sv_se: Aktivera MySQL musikdatabas

# #32106
source: Unhandled Exception caught - See log for details
cs_cz: Zjištěna neošetřená chyba - Detaily naleznete v logu
it_it: Catturata Eccezione non gestita - Vedi log per dettagli
nl_nl: Onbekende uitzondering afgevangen - zie log voor details
sv_se: Ohanterat undantag upptäckt - Se loggfiler för detaljer

# #32101
source: Pass
de_de: Passwort
it_it: Password
nl_nl: Overslaan
sv_se: Lösen

# #32099
source: Port
it_it: Porta
nl_nl: Poort

# #32056
source: Pair with PIN
hu_hu: Párosítás PIN-kóddal
lt_lt: Suporuoti naudojant PIN
